[
    {
        "title": "Freight Company Tells SEC It Needs Millions in $TRUMP to Get Access to the President",
        "description": "The transactional nature of the Trump presidency, now on the blockchain.",
        "url": "https://gizmodo.com/freight-company-tells-sec-it-needs-millions-in-trump-to-get-access-to-the-president-2000598631",
        "source": "Gizmodo.com",
        "publishedAt": "2025-05-06T18:10:22Z",
        "full_text": ""
    },
    {
        "title": "AI could consume more power than Bitcoin by the end of 2025",
        "description": "AI could soon surpass Bitcoin mining in energy consumption, according to a new analysis that concludes artificial intelligence could use close to half of all the electricity consumed by data centers globally by the end of 2025. The estimates come from Alex de…",
        "url": "https://www.theverge.com/climate-change/676528/ai-data-center-energy-forecast-bitcoin-mining",
        "source": "The Verge",
        "publishedAt": "2025-05-29T18:58:37Z",
        "full_text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nAI could soon surpass Bitcoin mining in energy consumption, according to a new analysis that concludes artificial intelligence could use close to half of all the electricity consumed by data centers globally by the end of 2025.\n\nThe estimates come from Alex de Vries-Gao, a PhD candidate at Vrije Universiteit Amsterdam Institute for Environmental Studies who has tracked cryptocurrencies’ electricity consumption and environmental impact in previous research and on his website Digiconomist. He published his latest commentary on AI’s growing electricity demand last week in the journal Joule.\n\nAI already accounts for up to a fifth of the electricity that data centers use, according to de Vries-Gao. It’s a tricky number to pin down without big tech companies sharing data specifically on how much energy their AI models consume. De Vries-Gao had to make projections based on the supply chain for specialized computer chips used for AI. He and other researchers trying to understand AI’s energy consumption have found, however, that its appetite is growing despite efficiency gains — and at a fast enough clip to warrant more scrutiny.\n\n“Oh boy, here we go.”\n\nWith alternative cryptocurrencies to Bitcoin — namely Ethereum — moving to less energy-intensive technologies, de Vries-Gao says he figured he was about to hang up his hat. And then “ChatGPT happened,” he tells The Verge. “I was like, Oh boy, here we go. This is another usually energy-intensive technology, especially in extremely competitive markets.”\n\nThere are a couple key parallels he sees. First is a mindset of “bigger is better.” “We see these big tech [companies] constantly boosting the size of their models, trying to have the very best model out there, but in the meanwhile, of course, also boosting the resource demands of those models,” he says.\n\nThat chase has led to a boom in new data centers for AI, particularly in the US, where there are more data centers than in any other country. Energy companies plan to build out new gas-fired power plants and nuclear reactors to meet growing electricity demand from AI. Sudden spikes in electricity demand can stress power grids and derail efforts to switch to cleaner sources of energy, problems similarly posed by new crypto mines that are essentially like data centers used to validate blockchain transactions.\n\nThe other parallel de Vries-Gao sees with his previous work on crypto mining is how hard it can be to suss out how much energy these technologies are actually using and their environmental impact. To be sure, many major tech companies developing AI tools have set climate goals and include their greenhouse gas emissions in annual sustainability reports. That’s how we know that both Google’s and Microsoft’s carbon footprints have grown in recent years as they focus on AI. But companies usually don’t break down the data to show what’s attributable to AI specifically.\n\nRelated Meta faces Democratic probe into plans to power a giant data center with gas\n\nTo figure this out, de Vries-Gao used what he calls a “triangulation” technique. He turned to publicly available device details, analyst estimates, and companies’ earnings calls to estimate hardware production for AI and how much energy that hardware will likely use. Taiwan Semiconductor Manufacturing Company (TSMC), which fabricates AI chips for other companies including Nvidia and AMD, saw its production capacity for packaged chips used for AI more than double between 2023 and 2024.\n\nAfter calculating how much specialized AI equipment can be produced, de Vries-Gao compared that to information about how much electricity these devices consume. Last year, they likely burned through as much electricity as de Vries-Gao’s home country of the Netherlands, he found. He expects that number to grow closer to a country as large as the UK by the end of 2025, with power demand for AI reaching 23GW.\n\nLast week, a separate report from consulting firm ICF forecast a 25 percent rise in electricity demand in the US by the end of the decade thanks in large part to AI, traditional data centers, and Bitcoin mining.\n\nIt’s still really hard to make blanket predictions about AI’s energy consumption and the resulting environmental impact — a point laid out clearly in a deeply reported article published in MIT Technology Review last week with support from the Tarbell Center for AI Journalism. A person using AI tools to promote a fundraiser might create nearly twice as much carbon pollution if their queries were answered by data centers in West Virginia than in California, as an example. Energy intensity and emissions depend on a range of factors including the types of queries made, the size of the models answering those queries, and the share of renewables and fossil fuels on the local power grid feeding the data center.\n\nIt’s a mystery that could be solved if tech companies were more transparent\n\nIt’s a mystery that could be solved if tech companies were more transparent about AI in their sustainability reporting. “The crazy amount of steps that you have to go through to be able to put any number at all on this, I think this is really absurd,” de Vries-Gao says. “It shouldn’t be this ridiculously hard. But sadly, it is.”\n\nLooking further into the future, there’s even more uncertainty when it comes to whether energy efficiency gains will eventually flatten out electricity demand. DeepSeek made a splash earlier this year when it said that its AI model could use a fraction of the electricity that Meta’s Llama 3.1 model does — raising questions about whether tech companies really need to be such energy hogs in order to make advances in AI. The question is whether they’ll prioritize building more efficient models and abandon the “bigger is better” approach of simply throwing more data and computing power at their AI ambitions.\n\nWhen Ethereum transitioned to a far more energy efficient strategy for validating transactions than Bitcoin mining, its electricity consumption suddenly dropped by 99.988 percent. Environmental advocates have pressured other blockchain networks to follow suit. But others — namely Bitcoin miners — are reluctant to abandon investments they’ve already made in existing hardware (nor give up other ideological arguments for sticking with old habits).\n\nThere’s also the risk of Jevons paradox with AI, that more efficient models will still gobble up increasing amounts of electricity because people just start to use the technology more. Either way, it’ll be hard to manage the issue without measuring it first."
    },
    {
        "title": "The Trump Memecoin Dinner Winners Are Getting Rid of Their Coins",
        "description": "Many of the crypto investors preparing to attend an exclusive gala dinner with US president Donald Trump have offloaded the coins that won them their seats.",
        "url": "https://www.wired.com/story/the-trump-memecoin-dinner-winners-are-getting-rid-of-their-coins/",
        "source": "Wired",
        "publishedAt": "2025-05-16T16:45:02Z",
        "full_text": "Next week, a coterie of crypto investors will share an extravagant dinner with US president Donald Trump at his golf club in Washington, DC. They won their seats at the dinner by purchasing large amounts of Trump’s personal crypto coin. But since their places were confirmed on Monday, almost half have gotten rid of their holdings, whether by selling the coins or transferring them to different wallets, a WIRED analysis shows.\n\nThe team behind the TRUMP coin announced the dinner competition on April 23, promising to invite the top 220 holders to dine alongside the president. The top 25, meanwhile, would qualify for a doubly exclusive tour and predinner reception, the website explained.\n\nThe organizers selected the attendees based on who had bought the most TRUMP and held their coins the longest between the announcement date and May 12. Although a few of the winners have identified themselves publicly—like Sheldon Xia, founder of crypto exchange BitMart—the identities of most are concealed behind leaderboard usernames and alphanumeric crypto wallet addresses.\n\nTo claim a spot at the dinner, investors had to purchase at least 4,196 units of the TRUMP coin, worth about $54,000 at the time of writing. To qualify for the reception, the VIPs held around 325,000 TRUMP coins on average, worth roughly $4.2 million.\n\nAt the time of writing, 100 of the 220 attendees have done away with practically their entire TRUMP stash, including 17 of the 25 VIPs. One VIP, going by the username Woo, appears to have made a $2.5 million profit on their TRUMP holdings, which they delivered to crypto exchange Binance on Wednesday, presumably with the intention to sell.\n\nThough the attendees would appear to be eager for an audience with Trump, their trading activities since the competition deadline appear to imply a low conviction in the long-term potential of the president’s coin as an investment asset. Representatives for Trump did not respond immediately to a request for comment.\n\nThat sentiment appears to be shared broadly among sophisticated crypto investors. As of Friday, only nine smart money traders—meaning those with a strong track record of profitability—are invested in the TRUMP coin, according to analysis by Nicolai Søndergaard, research analyst at blockchain analytics company Nansen.\n\nAfter the dinner was first announced, analysts expressed concerns about a potential slump in the price after the spaces at the dinner had been confirmed, caused by a sell-off among investors whose immediate incentive to hold the coin had evaporated.\n\nOn May 12, the day of the competition deadline, the organizers tried to encourage the qualifying attendees to hold onto their coins, presumably in a bid to avoid a sell-off. Any attendees who arrived at the dinner with as many units of TRUMP as they held at the end of the competition, the organizers announced on X, would be rewarded with a “very special and rare” NFT. They also teased a “rewards points program,” the details of which have not yet been revealed."
    },
    {
        "title": "Global high-performance proof-of-stake blockchain with erasure coding",
        "description": "Alpenglow: Global High-Performance Proof-of-Stake Blockchain with Erasure Coding - qkniep/alpenglow",
        "url": "https://github.com/qkniep/alpenglow",
        "source": "Github.com",
        "publishedAt": "2025-05-28T02:47:53Z",
        "full_text": "Alpenglow\n\nResearch reference implementation of the Alpenglow consensus protocol.\n\nGetting Started\n\nA local cluster example can be run with the following command:\n\n./run.sh\n\nThis spawns a local cluster with 6 nodes. These nodes communicate via UDP on localhost. Console output from the fastrace crate shows the progress of all nodes.\n\nFurther, we provide the simulations binary target. It provides various simulations of parts of the Alpenglow protocol, specifically resilience of Rotor, as well as latency and bandwidth requirements of Alpenglow as a whole. Currently, configuration is a bit cumbersome and is done via the const values in src/bin/simulations/main.rs .\n\nSome of the simulations, specifically the latency simulation, requires first downloading a public ping dataset via this script:\n\n./download_data.sh\n\nAfter that, the simulations can be run like this:\n\nRUST_LOG= \" simulations=debug \" cargo run --release --bin=simulations\n\nBenchmarks\n\nSome micro-benchmarks can be run like this:\n\ncargo bench\n\nTests\n\nRegular tests can be run like this:\n\n./test.sh\n\nThe more extensive test suite, including some slow tests, can be run like this:\n\n./test.sh slow\n\nStandalone node\n\nThere is a rudimentary implementation of a standalone node in the node binary. To use it, please do the folowing.\n\nDefine the cluster\n\nSince there is no gossip and stake manipulation in this prototype, you need to define all peers manually in advance. To do that, prepare a text file defining the socket addresses of the nodes that will be used in the test, e.g.\n\n127.0.0.1:3000 127.0.0.1:3003 127.0.0.1:3006 127.0.0.1:3009\n\nObviously, you can use any IP addresses here, as long as they are reachable. Only first out of 3 needed ports is specified, the others are port+1 and port+2.\n\nGenerate config files for the nodes\n\n► cargo run --release --bin node -- --generate-config-files ip_list --config-name ag_node\n\nwill produce a config file starting with ag_node for each socket address found in ip_list file.\n\nRun the nodes\n\nYou may want to use multiple terminals or a script to start the nodes:\n\ncargo run --release --bin node -- --config-name ag_node_0.toml & cargo run --release --bin node -- --config-name ag_node_1.toml & cargo run --release --bin node -- --config-name ag_node_2.toml & cargo run --release --bin node -- --config-name ag_node_3.toml\n\nYou should be able to take one node offline and bring it back up at will without cluster stopping.\n\nSecurity\n\nFor security related issues, please do not file a public issue on GitHub, instead reach out directly via email to:\n\nquentin (at) anza (dot) xyz\n\nLicense\n\nCopyright (c) Anza Technology, Inc.\n\nLicensed under the Apache License, Version 2.0. See LICENSE for details."
    },
    {
        "title": "Playtron rolls out Game Dollar stablecoin for gaming to enable purchases, subscriptions and rewards",
        "description": "Playtron, a Web3 gaming operating system, announced plans to roll out Game Dollar, a stablecoin for gaming that will be used to power purchases, subscriptions, and rewards across Playtron’s and other gaming ecosystems in the future.  Game Dollar will be used …",
        "url": "https://venturebeat.com/games/playtron-rolls-out-game-dollar-stablecoin-for-gaming-to-enable-purchases-subscriptions-and-rewards/",
        "source": "VentureBeat",
        "publishedAt": "2025-05-05T13:15:00Z",
        "full_text": ""
    },
    {
        "title": "Bitkraft doubles down on Web3 games with added leaders",
        "description": "Bitkraft Ventures, an early-stage investment firm focused on games, has announced new leaders who will double down on Web3 gaming.",
        "url": "https://venturebeat.com/games/bitkraft-doubles-down-on-web3-games-with-added-leaders/",
        "source": "VentureBeat",
        "publishedAt": "2025-05-30T13:45:00Z",
        "full_text": "Bitkraft Ventures, an early-stage game investment firm, has added new leaders who will double down on Web3 gaming investments.\n\nBitkraft, which raised its third fund in 2024 and has $1 billion in assets under management, announced promotions for Carlos Pereira and Jonathan Huang to general partner and partner, respectively, helping bolster their Web3 investment strategy and further committing to the blockchain segment of the gaming market.\n\nAdditionally, Matt Halstead, former director of the Teacher Retirement System of Texas (Texas Teachers) Investment Fund and an early Web3 investor, has joined the firm as a venture partner.\n\nPereira has been instrumental to the growth of Bitkraft’s Web3 Strategy, which he has led since 2022. To date, Bitkraft has backed many category leaders at the intersection of interactive entertainment, tech and crypto. It has led rounds in Immutable, the gaming-dedicated blockchain; Eve Frontier, a new blockchain enabled game by the creators of the epic EVE Online; Karate Combat, a fast-growing tokenized MMA league with over 100 million monthly impressions; and, Mira, a 2025 CB Insights Top 100 company in AI building verification infrastructure that’s processing three billion tokens a day in support of 4.5 million users.\n\nIt is a bold bet by Bitkraft — started by Jens Hilgers in Berlin — in part because the path to success in Web3 games has stretched out and mass market acceptance isn’t guaranteed, even as many crypto bets in non-gaming spaces have turned out to be better investments. Some gamers in the West have had an allergic reaction to Web3 and that has stalled efforts by the big game companies to adopt blockchain solutions. And about 93% of Web3 game startups have failed with their token launches.\n\nStill, Web3 game companies are hitting milestones, and a number of big bets are still under way. Web3 game investments, accordingly, are starting to come back after hitting a trough (with scores of investments per quarter) — perhaps because U.S. President Donald Trump favors an unfettered crypto market.\n\nWhy double down?\n\nCarlos Pereira has been appointed a general partner at Bitkraft Ventures.\n\nAs the Web3 market matures, Bitkraft is doubling down on its thesis that blockchain-enabled\n\ndigital rights, property, identity and economies will redefine gaming, creator monetization, and\n\ndigital experiences.\n\nI asked Pereira why Bitkraft is doubling down, given Web3 gaming’s challenges. He replied in a message to GamesBeat, “Because we think we have an edge in the category, not just in games but in consumer applications that increasingly lean on gamification and financialization as a generational trend.”\n\nHe added, “Our numbers tell a compelling story: up to now we’ve been less than 5% of our category funding, and yet the quarter or so of our portfolio companies that have a token represent almost half of the category’s overall market cap.”\n\nHe said that an abundance of funding, if anything, is a leading indicator of compression of returns going forward as valuations get pushed up. To shy away from a category because it’s too contrarian or under-funded would be in a sense anti-VC.\n\n“The lack of mass market successes shouldn’t be a surprise considering the general time it takes to build hit games vs how long Web3 games have been investable, the general ‘hit rate’ of VC investments, and the fact that in Web3 you’ve had to build a game and figure out non-trivial distribution and infrastructure challenges that only really in the last year or two have gotten a jump in quality/capacity,” Pereira said.\n\nHe noted there are several emerging examples of apps at a quality bar that is broadly competitive, for example Boxed in Bitkraft’s portfolio with almost $30 million in ARR, Cambria with high monetizing seasons that are deeply engaging to whales, Karate Combat with over 100 million monthly impressions and strong awareness in Web2, Mythical with its sports properties with high value partners and strong unit economics, and Gunzilla with strong daily active user retention.\n\n“Good things take time, but the direction of travel is clear,” Pereira said.\n\nLeadership backgrounds\n\nBitkraft Ventures has $1 billion in assets under management.\n\nHuang joined Bitkraft in 2023 and brings a decade of experience across Web2 and Web3 investments out of Asia, including SEA Capital and Temasek, where Huang drove their Series G investment into Roblox. He focuses on consumer platforms, mobile studios and creator ecosystems across Asia, with an emphasis on next-generation user behavior, use-cases, and emerging monetization models that are reshaping the industry at scale.\n\nHuang’s elevation to partner helps strengthen Bitkraft’s position in Asia and reflects Bitkraft’s continued\n\ninvestment in the region’s potential as a global epicenter for innovation across both Web2 and\n\nWeb3.\n\nHalstead brings a rare blend of traditional asset management and Web3 experience to Bitkraft. As one of the first institutional investors in crypto, he spearheaded blockchain investment strategies for the Texas Teachers, an investment institution managing over $200 billion in assets. The firm believes his move to Bitkraft is a powerful endorsement of Web3 gaming’s legitimacy as an investable category—and a sign that seasoned institutional capital allocators are seeing real value in this space.\n\nBitkraft launched its Web3 Gaming fund in 2021, which was a key catalyst in the firm’s evolution — expanding beyond Early Stage equity investing into new asset classes, emerging markets and diversified financing solutions broadly serving the Interactive Media industry. Since then, Bitkraft has grown to $1 billion in assets under management, welcomed a strategic minority investment from Blue Owl, and broadened its global reach last year with a new presence in India.\n\nMythical Games is making FIFA Rivals under license from FIFA.\n\n“Web3 has unlocked new creative and economic models for developers, players, and communities, and Bitkraft has long been committed to its potential,” said Pereira, in a statement. “As we enter the next phase of growth, we are expanding our reach with experienced investors like Matt, whose institutional experience and deep roots in crypto can only strengthen our Web3 strategy. Matt isn’t just a respected investor, he’s a peer and a visionary in the space, and I couldn’t be more excited to have him join Bitkraft.”\n\n“Bitkraft has built a track record of Web3 successes across the US, Asia, and emerging markets,” said Huang, in a statement. “With blockchain adoption continuing to scale and new economic models proving sustainable, this is a pivotal moment to back the next generation of Web3 founders. We’re doubling down on our Web3 strategy to help build the future of gaming, digital assets, and interactive experiences.”\n\n“I joined Bitkraft because I believe their vision for Web3 isn’t just forward-thinking, it’s transformative,” said Halstead, in a statement. “Web3 has the power to bridge the digital and physical worlds, unlocking new experiences and economic models that put control back in the hands of creators and players.”\n\nHe added, “Bitkraft doesn’t just invest in this future; they help build it as active participants, deeply embedded in Web3, gaming, and emerging technologies. This makes them the ideal partner for those shaping the next era of digital entertainment, and I’m excited to help them reach and support innovators in the space.”"
    },
    {
        "title": "Trump's Stablecoin Chosen For $2 Billion Abu Dhabi Investment In Binance",
        "description": "Donald Trump's crypto company created a digital dollar called USD1, which is now being used by a big investor in Abu Dhabi to help fund a $2 billion deal with Binance, the world's largest crypto exchange. Reuters reports: Stablecoins are an increasingly lucra…",
        "url": "https://slashdot.org/story/25/05/01/2040201/trumps-stablecoin-chosen-for-2-billion-abu-dhabi-investment-in-binance",
        "source": "Slashdot.org",
        "publishedAt": "2025-05-01T23:20:00Z",
        "full_text": "Donald Trump's crypto company created a digital dollar called USD1, which is now being used by a big investor in Abu Dhabi to help fund a $2 billion deal with Binance , the world's largest crypto exchange. Reuters reports:"
    },
    {
        "title": "Sam Altman and Elon Musk are racing to build an ‘everything app’",
        "description": "Sam Altman and Elon Musk aren't just competing in the AI race; they both have ambitions to build Silicon Valley's holy grail: an \"everything\" super app encompassing finance, social media, gaming, and more. Earlier this week, I got a peek at Altman's plan from…",
        "url": "https://www.theverge.com/command-line-newsletter/660674/sam-altman-elon-musk-everything-app-worldcoin-x",
        "source": "The Verge",
        "publishedAt": "2025-05-02T23:50:13Z",
        "full_text": "is a deputy editor and author of thenewsletter. He has been reporting on the tech industry for more than a decade.\n\nSam Altman and Elon Musk aren’t just competing in the AI race; they both have ambitions to build Silicon Valley’s holy grail: an “everything” super app encompassing finance, social media, gaming, and more.\n\nEarlier this week, I got a peek at Altman’s plan from a cavernous event space on the northern edge of San Francisco. He was not there as the CEO of OpenAI, but as the co-founder and chairman of Tools for Humanity, the parent company of a cryptocurrency called Worldcoin that’s now available in the US. Worldcoin is distributed to people who scan their eyes at one of the startup’s orbs, which are rolling out in retail stores across America. At the same time, the token is being used to build a super app to rival X.\n\nTools for Humanity’s World app is a crypto wallet, social network, and mini-app platform all in one. Its monthly user base has doubled in the last six months to 26 million people, 12 million of whom have been verified by an orb. In the World app, you can message others via a chat interface tied to World IDs — the blockchain-based identifier you get after scanning your eyes — and send or receive cryptocurrency. There are also dozens of mini apps available from developers like Kalshi, many of which let you transact in-app with Worldcoin.\n\nCreating a hub for finance and social networking is Musk’s stated intention for X, which is gearing up to launch Venmo-like money features later this year in partnership with Visa. This week, Tools for Humanity also announced a partnership with Visa to release a US debit card later this summer. It will let you transact with Worldcoin and offer rewards for AI subscriptions.\n\nBy verifying that people are human, Tools for Humanity is also trying to address the bot problem that Musk said he wanted to fix when he bought Twitter. Onstage at the event, Altman recalled a walk co-founder Alex Blania and he took through San Francisco five years ago, well before the launch of ChatGPT.\n\n“It was clear to us that there was a need for something like this, that we needed some sort of way for authenticating humans in the age of AGI,” he said. “We wanted a way to make sure that humans stayed special and central in a world where the internet was going to have lots of AI-driven content.”\n\nDuring a press Q&A after the keynote, Tools for Humanity CEO Alex Blania called out X as the kind of platform he’s trying to improve with World ID verification, which the startup plans to eventually charge developers for. Bots on X used to be “so stupid that you could see it was some crypto scam,” he said, acknowledging that now, it’s “not as clear.”\n\nThere were several OpenAI leaders in the audience at this week’s event. A rumor leading up to it was that the two companies would announce a partnership for OpenAI’s planned social network. Given the Altman connection, I asked Blania during the press Q&A if he wanted to work with OpenAI. He responded that he was “definitely open to it” and hinted that there would be more to come on that front. I had hoped to ask Altman about it as well, but he slipped out after the keynote.\n\nMeta’s AI app strategy\n\nEarlier this week, I attended Meta’s first-ever AI developer event, LlamaCon, at its headquarters in Menlo Park. That same morning, the standalone Meta AI app was released with a social feed for sharing interactions with the assistant. Eventually, the app is going to add a premium tier and ads.\n\nAfter his opening keynote at LlamaCon, I caught up with Meta’s chief product officer, Chris Cox, to ask why Meta AI is getting its own app, why it has a social component, and what else he thinks sets the app apart.\n\nThe following conversation has been edited for length and clarity:\n\nWhat’s the goal of doing a standalone Meta AI app?\n\nAlmost a billion people are using Meta AI. There’s a bunch of lighter-weight usage, but then there are some communities of people that are going super deep on it. We wanted to offer the lightweight mode in our apps and also the heavyweight mode.\n\nDoes this mean that Meta AI’s hooks in the other apps (Instagram, Facebook, WhatsApp) will disappear or become optional?\n\nOur plan is to keep it the way it is. Some of these things make sense in the apps. A lot of people are using it in search to learn more about a specific meme or a specific piece of content. We’ll continue to have those sorts of integrations.\n\nWhen you compare Meta AI to other assistants like ChatGPT, what do you think is its edge?\n\nThere’s voice, there’s personalization, the social features, and then there’s the integration with hardware. We’ve done a lot of work on getting the voice to really low latency and making it really expressive, which lets you have an ongoing conversation.\n\nThe second piece is the personalization. It remembers everything I’ve told it. It also incorporates your Facebook and Instagram data, if you connect your accounts, to understand interests in a niche way. It knows I’m a marathoner. It knows I’m very interested in AI. It knows the humor I like. That starts to get you a pretty fascinating level of depth when it comes to answering basic questions. We’ve created the best personalized experiences in social media, and we know that’s the difference between a vanilla app and something that people really love. So that’s going to be a big differentiator, I expect, for us.\n\nThe social stuff is incredibly fun. Many people post the equivalent of political cartoons with visual commentary on today’s events. An observation we had is that people don’t know what to do with AI, and it’s not until they’ve been walked through it by somebody who’s an expert that the light bulb goes off. Just like social media, a lot of this is memetic. You’re inspired by what you see other people do.\n\nWill the Meta AI Discover feed become more of its own social network and not just a way to find prompts?\n\nI think we’ll add more to it. I’ve already found a bunch of AI creators using it. With early communities, you want a dedicated place because it’s less pressurized. I’m not going to share my AI-generated artwork on Instagram unless it’s really good. If you have a place that’s just for this thing, there’s going to be a community around it.\n\nIs there hope that this app also helps drive Meta Ray-Ban sales, since it’s how you pair with them?\n\nI think it could in the following way: you see people using Ray-Bans in the app. For a lot of people, that’s going to be the way they get excited about it instead of seeing marketing.\n\nWhat did you all learn from the Llama 4 benchmark fiasco?\n\nI think the most important thing for benchmarks is to stay focused on what actually matters for your product. Part of what we need to do is just be really, really, really clear on that. I think every organization is going through some version of this. The eval that matters is whether the product is good, period.\n\nLink list\n\nMore to click on:\n\nAs always, I welcome your feedback, especially if you have thoughts on this issue or a story idea to share. You can respond here or ping me securely on Signal."
    },
    {
        "title": "Presidential seals, “light vetting,” $100,000 gem-encrusted watches, and a Marriott afterparty",
        "description": "The winners of the $TRUMP meme coin contest did get to see President Donald Trump speak at a private dinner closed to the press - but his speech was probably the least exciting part of their night. They did get a better, more valuable, and potentially more lu…",
        "url": "https://www.theverge.com/politics/673870/trump-meme-coin-dinner-justin-sun-watch-presidential-seal",
        "source": "The Verge",
        "publishedAt": "2025-05-23T21:19:03Z",
        "full_text": "The winners of the $TRUMP meme coin contest did get to see President Donald Trump speak at a private dinner closed to the press — but his speech was probably the least exciting part of their night. They did get a better, more valuable, and potentially more lucrative experience: the opportunity to network with the biggest crypto traders in the game, win watches worth hundreds of thousands of dollars, and attend a not-so-exclusive afterparty at the Capitol Hill Marriott afterward — all without having to complete particularly thorough background checks.\n\nThe vetting process for entering the dinner was a ‘pretty light’ KYC check\n\nAfter being whisked behind the gates of the Trump National Golf Club in Sterling, Virginia, past a throng of journalists snapping photos and protesters screaming at them for being corrupt, the 220 attendees went through security and had their IDs checked. According to one attendee, many were wealthy but some were living on normal-ish paychecks. The other guests, he said, were largely foreigners from overseas, all with an extremely high risk tolerance for gambling with crypto. The attendee said the vetting process for entering the dinner was a “pretty light” KYC check done by a third party, which he found odd considering he was about to have dinner in proximity to the president. (Know Your Customer is an anti-money-laundering compliance measure that banks, crypto exchanges, and other financial institutions are required to do.)\n\n“I talked to someone about getting into the White House, and it’s a lot more strict in terms of you have to show your passport and all that,” he told The Verge.\n\n“If this is true, it’s disappointing, but not surprising. When we sued during the first Trump administration to see who the Secret Service was running background checks on at Mar-a-Lago, we were told that the government wasn’t vetting the people meeting with Trump there, it was all done by his private business,” Jordan Libowitz, vice president of communications for Citizens for Responsibility and Ethics in Washington (CREW), wrote in email to The Verge. “This is a massive ethical issue that we reportedly have foreign nationals paying thousands if not millions of dollars to a sitting president to get access to him, and it’s all done in a way that the government does not have records of who they are. If you were drawing up a playbook for potential corruption, this is how you’d do it.”\n\nAccording to the attendee, Trump’s presence was limited to a speech from behind a podium bearing the presidential seal — despite the White House having previously called it a private event on the president’s “personal time” — then immediately flying back to Washington on Marine One. “For the most part, it was just him talking about his campaign, and about how he beat Biden, and blah, blah, blah, how we were in a terrible place with crypto before he got elected and now we’re in a great place,” the attendee said.\n\nThough Trump was greeted like a celebrity, with guests clamoring up close and hoping for signatures, the real draw of the event was Justin Sun, the crypto billionaire, who was swarmed with fans and selfie-seekers during the dinner.\n\nSun came in first place, having bought more than $20 million worth of $TRUMP during the contest. During a prize ceremony at the end of the night, he was presented with a $100,000 Trump-branded Tourbillon watch — the grand prize for the top four winners. (Unfortunately for third and fourth place, their Tourbillons were not ready by the time of the dinner and will be shipped to them later.) Later, there was a raffle for two other Trump-branded watches, each with an estimated retail value of $500.\n\nOther crypto stars were spotted at the event: Vincent Liu, chief investment officer at the Taiwan-based crypto trading firm Kronos Research; “Ice,” the founder of Memecore, a Singapore-based crypto organization that came in second place; and GAnt, a crypto influencer who came in fourth place and had been sharing his preparations for the dinner with his followers on Telegram. According to a report from the blockchain analysis company Nansen, the contestants collectively spent $394 million to participate in the dinner, with the winners spending anywhere between $55,000 and $37.7 million to participate.\n\nIf people wanted to keep the festivities going after dinner, there were buses available to take them to the Capitol Hill Marriott back in DC, where Memecore was hosting a private afterparty at the rooftop bar. (The party had apparently been reserved for the top 25, but eventually it ballooned to include anyone else who wanted to attend.)\n\nThe owners of $TRUMP and the White House have declined to publish a list of attendees, sparking outrage from lawmakers concerned about the potential for the token to be used for bribing the president. But several attendees were more than willing to make themselves known, giving on-the-record interviews with news outlets both before and after the dinner, posting photos and videos on their socials, and even openly discussing their experiences with their online Telegram followers.\n\nThe dinner hosts themselves were just as eager to show off their success. A photographer was offering attendees the chance to find themselves in the event album via facial recognition. At the end of the night, after all the gifts had been handed out, Bill Zanker, the CEO of Fight Fight Fight LLC, asked everyone in the audience to put on their commemorative trucker hats, emblazoned with a slimmed-down Trump and the words “Fight! Fight! Fight!” for a celebratory photo. Everyone in the crowd flung theirs in the air, as if it were a college graduation. According to the attendee, Zanker then asked everyone to hashtag their photo with “Trump meme dinner or whatever” when they posted them.\n\nAlthough The Verge found photos of the hats on social media, we were not able to find any particular hashtag associated with them.\n\nThe White House did not immediately respond to a request for comment.\n\nCorrection, May 23: An earlier version of this article misidentified Zanker as the CEO of World Liberty Financial. He is the CEO of Fight Fight Fight LLC."
    },
    {
        "title": "Crypto billionaire Justin Sun showed off a $100K Trump watch after an exclusive dinner with the president — here's everything you should know about him",
        "description": "The crypto billionaire now sports a Trump-branded watch after an exclusive dinner with President Donald Trump.",
        "url": "https://www.businessinsider.com/everything-you-should-know-about-justin-sun-trump-watch-crypto-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-24T20:51:04Z",
        "full_text": "lighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nCrypto entrepreneur Justin Sun now has a $100,000 Trump-branded watch on his arm, but he's no stranger to the high life.\n\nThe billionaire was one of 220 top backers of President Donald Trump's meme coin , $TRUMP, who were invited to a special dinner with the president on May 22.\n\nAt the event, Sun said he was gifted a Trump Tourbillon watch, which sells for $100,000 — another of the Trump family's private business interests in addition to cryptocurrency.\n\nAccording to Forbes' real-time net worth tracker, the 34-year-old founder of Tron is estimated to be worth around $8.5 billion.\n\nHere's everything to know about Sun — from his legal troubles to his purchase of a duct-taped banana.\n\nSun's early life and education\n\nSun grew up in a rural province of China and left home at a young age to study the strategy game \"Go\" in Wuhan, The Verge reported.\n\nSun graduated from Peking University with a bachelor's degree in history in 2011. Two years later, he earned a master's degree in political economy from the University of Pennsylvania.\n\nSun then attended Hupan University — a Chinese business school started by Alibaba cofounder Jack Ma in 2015 — where he wrote a thesis on the blockchain industry, titled \"The Birth of a Decentralized Internet.\"\n\nSun was the youngest member of Hupan's inaugural class, which included 30 students whom Ma recruited because he believed they could revolutionize the Chinese business world, the South China Morning Post reported. Sun graduated from Hupan in 2018.\n\nSun's oldest Instagram photo shows him receiving a certificate from Ma. The caption reads, \"Inspired by the best to shape the future for the better. \"\n\nSun's rise in the crypto world\n\nSun worked at San Francisco-based crypto company, Ripple Labs, a cryptocurrency startup that has received backing from Google Ventures, Andreessen Horowitz, and other blue-chip investors.\n\nIn 2013, Sun founded a social chat room app called Peiwo. The app matched users with each other based on their interests and 10-second audio clips. However, China ultimately kicked Peiwo off the Android and Apple app stores and shut it down for disrupting \"socialist values,\" The Verge reported.\n\nIn 2017, Sun founded Tron, a blockchain company with its own cryptocurrency that is \"dedicated to building the infrastructure for a truly decentralized internet.\" Tron says its network has over 308 million users on the blockchain and has had over 10.4 billion transactions.\n\nLess than a year later, Tron acquired BitTorrent, a peer-to-peer file-sharing service, for a reported $126 million.\n\nIn 2022, Sun joined the Global Advisory Board of cryptocurrency exchange HTX, then known as Huobi Global.\n\nPersonal life and Warren Buffett\n\nSun has amassed more than 3.8 million followers on X and 240,000 Instagram followers, where he has posted pictures of himself posing with celebrities such as Los Angeles Lakers legend Kobe Bryant.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nForbes included Sun in its 30 under 30 Asia list for Consumer Technology in 2017, and more recently, the outlet featured Sun as its digital daily cover in March of this year.\n\nIn 2019, Sun bid $4.57 million on an eBay-sponsored charity lunch with Warren Buffett. Sun said he planned to use the meal to convert Buffett, a notorious skeptic of bitcoin and other cryptocurrencies, into a true believer. Buffett has said bitcoin has \"no unique value\" and will ultimately become worthless, and derided it as a \"delusion\" and \"probably rat poison squared.\"\n\nSun postponed the dinner with Buffett, citing kidney stones, which sparked conspiracy theories that he was being pressured by China. But months later, Sun finally had his dinner with Buffett in January 2020, inviting eToro founder and CEO Yoni Assia, Litecoin creator Charlie Lee, and other crypto advocates to dine with them.\n\nLegal troubles and investment in World Liberty Financial\n\nIn 2023, the Securities and Exchange Commission filed charges against Sun and three of his companies — Tron Foundation, BitTorrent Foundation, and Rainberry.\n\nThe federal agency accused Sun of offering and selling crypto asset securities without proper registration. Sun is also facing allegations of fraud for manipulating the market price of his cryptocurrency, TRX.\n\nSun was additionally charged with not disclosing how much he compensated celebrities like Lindsay Lohan, Jake Paul, and Soulja Boy to promote his cryptocurrency, which would have violated federal securities laws.\n\nIn December 2024, Sun purchased $30 million in crypto tokens from World Liberty Financial, making him the largest investor in the new venture backed by Trump and his family. On February 26, the SEC filed a motion to pause its case against Sun and allowed a 60-day period to explore a potential settlement.\n\nSince then, Sun has invested an additional $45 million in WLF. On January 22, Sun posted on X that if he \"made any money in cryptocurrency, all credit goes to President Trump.\"\n\nA flashy lifestyle\n\nIn November 2024, Sun purchased Maurizio Cattelan's conceptual artwork titled Comedian, which consisted of a banana duct-taped to a wall, for $6.2 million at a Sotheby's auction.\n\nThe sale of the highly divisive piece significantly exceeded its estimated value of $1 to $1.5 million.\n\nShortly after the acquisition, Sun consumed the banana during a press event in Hong Kong, stating that \"the real value is the concept itself.\" He said that the act was not about destroying the artwork but about highlighting its ephemeral nature.\n\nAt the live event, Sun also pledged to purchase 100,000 bananas from the New York street vendor who sold the original fruit used in the artwork.\n\n\"To thank Mr. Shah Alam, I've decided to buy 100,000 bananas from his stand in New York's Upper East Side,\" Sun wrote on X.\n\nThis isn't the only time Sun splurged on artwork.\n\nIn December 2021, he bought a Joker-themed NFT from the Bored Ape Yacht Club Tron collection for $15 million, one of the most expensive NFT purchases.\n\nSun also spent $78.4 million on Giacometti's cast bronze sculpture Le Nez, adding to his collection of a $20 million Picasso portrait of Marie-Thérese, a triptych of \"fright wig\" portraits by Andy Warhol for $2 million, and KAWS' Untitled (Kimpsons) for $323,647, Artnet reported.\n\nAside from art, Sun also spent $28 million to secure a seat on a Blue Origin flight to space, which he revealed after winning the bid at auction for the first crewed mission on the New Shepard rocket.\n\n\n\nSamantha Delouya contributed to an earlier version of this post."
    },
    {
        "title": "Q1’s $7.8B in game investments and M&A marks largest quarter since 2023 | DDM",
        "description": "The game industry’s motto for all of last year was \"survive til 2025.\" And in some respects, that wasn't just wishful thinking.",
        "url": "https://venturebeat.com/games/q1s-7-8b-in-game-investments-and-ma-marks-largest-quarter-since-2023-ddm/",
        "source": "VentureBeat",
        "publishedAt": "2025-05-08T15:00:00Z",
        "full_text": ""
    },
    {
        "title": "Meet Michael Grimes, the investment banker to Elon Musk who's running Trump's invest-in-America agenda",
        "description": "Michael Grimes made a name for himself as a banker to tech giants like Uber and Google. Now, he's running Trump's investment accelerator.",
        "url": "https://www.businessinsider.com/michael-grimes-morgan-stanley-investment-accelerator-trump-commerce-department-2025-3",
        "source": "Business Insider",
        "publishedAt": "2025-05-25T09:00:02Z",
        "full_text": "Michael Grimes, who has joined the Trump administration, is pictured next to Linda Yaccarino, the CEO of X, formerly Twitter.\n\nMichael Grimes, who has joined the Trump administration, is pictured next to Linda Yaccarino, the CEO of X, formerly Twitter. Leigh Vogel/Getty Images for Uber, X and The Free Press\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nHe conquered Wall Street by winning over Silicon Valley. Now, he's got a big job in Washington, D.C., wooing foreign investors to the United States.\n\nAfter 30 years helping Morgan Stanley snag some of the biggest tech mergers and IPOs, Michael Grimes has traded in the investment banker lifestyle for a top position with the Commerce Department, headed by Wall Street veteran Howard Lutnick of Cantor Fitzgerald.\n\nGrimes is not a household name, but he is well known in investment-banking circles as a go-to banker for some of Silicon Valley's biggest names, from Google to Uber. He helped the billionaire Tesla CEO, Elon Musk, buy Twitter and is famous for wooing clients by becoming a student of their technology and other services.\n\nSince joining the Commerce Department in February, Grimes has been named the executive director of the US Investment Accelerator, a program to encourage foreign investments in the US that Trump established via an executive order at the end of March.\n\nThe program seeks to assist investors with more than $1 billion to spend with regulatory and legal hurdles that can hamper construction and other investment projects.\n\n\"It is in the interest of the American people that the Federal Government dramatically expand its assistance to companies seeking to invest and build in the United States,\" the executive order says.\n\nHe's everything we know about Morgan Stanley's star former tech banker, Michael Grimes."
    },
    {
        "title": "China Reviews U.S. Proposal to Scale Down Tariffs",
        "description": "China officially acknowledges the U.S. is reaching out for trade talks sparking market optimism, Ethereum co-founder Vitalik Buterin wants to make the layer ...",
        "url": "https://videos.coindesk.com/previews/OxCyQKgd",
        "source": "CoinDesk",
        "publishedAt": "2025-05-05T15:59:35Z",
        "full_text": "China Reviews U.S. Proposal to Scale Down Tariffs\n\nChina officially acknowledges the U.S. is reaching out for trade talks sparking market optimism, Ethereum co-founder Vitalik Buterin wants to make the layer 1 blockchain as simple as bitcoin, and Tether announces its entry into the crypto AI sector. CoinDesk's Christine Lee hosts \"CoinDesk Daily.\""
    },
    {
        "title": "MoviePass Launches Box Office Betting Platform Unfortunately Tied to Crypto",
        "description": "The platform, Mogul, is like fantasy sports for film buffs.",
        "url": "https://gizmodo.com/moviepass-launches-box-office-betting-platform-unfortunately-tied-to-crypto-2000597085",
        "source": "Gizmodo.com",
        "publishedAt": "2025-05-01T21:40:23Z",
        "full_text": ""
    },
    {
        "title": "5 big crypto shifts no one’s talking about in 2025",
        "description": "Crypto is quietly evolving in 2025 — here are five major shifts shaping the $3.4T market that no one’s talking about.",
        "url": "https://www.thestreet.com/crypto/markets/5-big-crypto-shifts-no-ones-talking-about-in-2025",
        "source": "TheStreet",
        "publishedAt": "2025-05-12T19:32:32Z",
        "full_text": ""
    },
    {
        "title": "Raising ethics questions, top Trump meme coin investors to dine with president tonight",
        "description": "President Trump is hosting an exclusive dinner tonight for the largest investors in the $TRUMP meme coin, putting the murky world of cryptocurrencies on a collision course with White House ethics.",
        "url": "https://www.npr.org/2025/05/22/nx-s1-5406209/trump-meme-coin-dinner-crypto",
        "source": "NPR",
        "publishedAt": "2025-05-22T09:00:00Z",
        "full_text": "Raising ethics questions, top Trump meme coin investors to dine with president tonight\n\ntoggle caption Giuseppe Cacace/AFP via Getty Images\n\nPresident Trump is hosting an exclusive dinner tonight at his Trump National Golf Club near Washington, D.C., with a unique guest list: 220 of the largest investors in his $TRUMP meme coin, whose current or previous holdings of the cryptocurrency earned them a seat at the table.\n\nIt's an event where the murky world of cryptocurrencies collides with questions of presidential ethics.\n\nHere are three key things to know about the president's meme coin, Thursday's dinner and what it all might mean.\n\nWhat is $TRUMP?\n\nDays before the inauguration, the president launched $TRUMP, which surged to a $27 billion market cap within hours – valuing the president's personal stake at more than $20 billion. Its price peaked at more than $74 before plummeting. Since hitting a low in April, it has recovered some of its losses, making back much of it in the last month as the $TRUMP dinner was hyped.\n\nSponsor Message\n\nIn a Bitcoin World editorial about the meme coin dinner, the publication said that the timing of the latest spike suggests that \"access to a high-profiled political figure and event acted as a powerful catalyst.\"\n\nMeme coins are cryptocurrencies inspired by internet memes or viral trends — or in this case, a U.S. president. They are typically created for entertainment or speculative purposes and are driven mostly by hype. As speculation, they tend to enrich early investors who are able to dump their coins before their value crashes.\n\nLike Bitcoin, meme coins, sometimes called meme tokens, use blockchain technology, but usually lack a clear use case and underlying value.\n\n\"Meme coins aren't investments. I wouldn't even call them speculative. They're riskier than the dog track,\" according to Michael Lee, the founder of Michael Lee Strategy, a wealth planning and investment management firm.\n\nLee describes himself as \"a full red-blooded Trump supporter\" and calls the original cryptocurrency Bitcoin \"digital gold.\" But as an investor, he says he wouldn't touch $TRUMP.\n\n\"This isn't even casino-level risk,\" he said. \"In a casino, at least there's odds.\"\n\nCIC Digital LLC, an affiliate of The Trump Organization, and Fight Fight Fight LLC collectively own about 80% of the total supply of one billion $TRUMP tokens, according to GetTrumpMemes.com, the official website.\n\ntoggle caption Mladen Antonov/AFP via Getty Images\n\nWho is attending the $TRUMP dinner?\n\nOf the 220 investors planning to attend, all but a very few have only been identified by their \"crypto wallet address\" online handles.\n\nSponsor Message\n\n\"There's been a lot of speculation about who might hold them and who might not,\" Politico reporter Declan Harty told NPR recently. \"But from those folks who are talking about their plans to attend the dinner, they are mostly cryptocurrency believers and hoping to really get an audience with the president.\"\n\nLike Chinese-born crypto-investor Justin Sun, the founder of the blockchain-based operating platform TRON. Sun announced on X that he is the top holder of $TRUMP and will therefore be on the list for the dinner and an additional private reception and \"special tour.\"\n\n\"Honored to support @POTUS and grateful for the invitation from @GetTrumpMemes to attend President Trump's Gala Dinner as his TOP fan!\" he wrote.\n\nIn 2023, Sun was charged by the Securities and Exchange Commission for the unregistered sale of his cryptocurrencies, for artificially inflating their trading volume, as well as concealing payments to celebrity endorsers to promote them, according to the SEC. As of February, the SEC case was still pending, according to Reuters.\n\nBut Sun is perhaps best known to the general public for another purchase he made last year at a New York auction. The tech mogul bought a $6.2 million banana stuck to a wall with duct tape — a conceptual work by Italian artist Maurizio Cattelan. Sun subsequently ate the banana, bragging about it on social media.\n\nAfter Sun, MemeCore, a Singapore-based crypto network, ranks second. Like Sun, MemeCore made no secret of its quest for the No. 1 slot, posting on X earlier this month that \"We're not just aiming for #1 in the $TRUMP leaderboard – we're here to conquer the entire meme space.\"\n\nWintermute, a London-based crypto market-making firm, reportedly comes in at #3, according to BitCoin World. NPR reached out to the company to confirm its holdings, but did not receive an immediate reply.\n\nWhat are the ethical implications?\n\nNorm Eisen is a former ambassador who was an ethics advisor to former President Barack Obama and now serves as the executive chair of Democracy Defenders Action.\n\nSponsor Message\n\nCiting the Emoluments Clause, the constitutional provision that bars federal officials from accepting gifts, payments, or other benefits from foreign governments without congressional consent, Eisen describes the dinner as \"the most profound ethics and constitutional emoluments violations in the history of our presidency.\"\n\n\"The existence of this digital currency is a naked attempt to exploit [Trump's] prior and current presidencies,\" Eisen said.\n\n\"Foreigners and foreign governments are going to take advantage of that situation to put money in — expecting things in return,\" he predicted.\n\nCreating such a quid pro quo could have significant national security implications, with such influence potentially leading to foreign policy decision that favor other countries over the U.S. Notably, foreign entities are prohibited from donating to political campaigns or influencing decision making of candidates — all to avoid foreign interference in U.S. affairs.\n\nIn an emailed statement to NPR, White House deputy press secretary Anna Kelly said: \"The president is working to secure GOOD deals for the American people, not for himself.\"\n\n\"President Trump only acts in the best interests of the American public — which is why they overwhelmingly re-elected him to this office, despite years of lies and false accusations against him and his businesses from the fake news media,\" she said.\n\nSpeaking on condition of anonymity, a White House official said, \"the meme coin has nothing to do with the White House.\"\n\nDespite originally announcing that the top 25 coin investors would also receive a private White House tour, the Get Trump Memes website later stripped that language from the announcement, urging top coin holders to instead stay in town for a \"Special VIP Tour.\"\n\nLee, the investment manager, says he doesn't think the meme tokens or the dinner present a particularly thorny ethical dilemma. \"I don't know how you would get close to Trump by buying his meme coin,\" he says. \"If you're a person of means, you can get close to any politician, right?\"\n\nSponsor Message\n\nBut even some Republican lawmakers have expressed concerns. Wyoming Sen. Cynthia Lummis, a staunch Trump supporter, said that the situation \"gives me pause,\" while Alaska Republican Sen. Lisa Murkowski, speaking to NBC, said \"I don't think it would be appropriate for me to charge people to come into the Capitol and take a tour.\"\n\nEisen believes during Obama's presidency, it would have been inconceivable for such an event to take place.\n\n\"Conversely, if one of us had suggested it, he would have thrown us out of the Oval Office,\" he said.\n\nBut he does believe that Trump's challenge to the Emoluments Clause of the Constitution will be challenged in the courts. Otherwise, Eisen says, \"if this goes unchecked, it will hang a 'for sale' sign on the White House.\""
    },
    {
        "title": "Comprehensive Analysis of De-Anonymization Attacks Against the Privacy Coin XMR",
        "description": "Monero (XMR), a cryptocurrency renowned for its privacy-centric design, has drawn the attention of governments, cybersecurity experts, and analytics firms seeking to deanonymize its transactions.",
        "url": "https://monero.forex/is-monero-totally-private-a-comprehensive-analysis-of-de-anonymization-attacks-against-the-privacy-coin/",
        "source": "Monero.forex",
        "publishedAt": "2025-05-28T14:11:47Z",
        "full_text": "Share on Social Media\n\nAnalyzing Attempts to Deanonymize and Track Monero Transactions: A Technical and Strategic Overview.\n\nDecember 23, 2024\n\nBy: Trevor Baaddi\n\nMonero (XMR), a cryptocurrency renowned for its privacy-centric design, has drawn the attention of governments, cybersecurity experts, and analytics firms seeking to deanonymize its transactions. Unlike Bitcoin, where transactions are publicly visible on the blockchain, Monero employs sophisticated privacy features such as ring signatures, stealth addresses, and confidential transactions. This article analyzes notable attempts to compromise Monero’s privacy, detailing the methodologies used, their efficacy, and their limitations.\n\nMonero’s Privacy Features: A Brief Overview\n\nTo appreciate the challenges of deanonymizing Monero, it is essential to understand its privacy architecture:\n\nRing Signatures : Combine a sender’s output with decoy outputs, obscuring the true origin of a transaction.\n\n: Combine a sender’s output with decoy outputs, obscuring the true origin of a transaction. Stealth Addresses : Generate unique one-time addresses for recipients, ensuring transactions cannot be linked back to a public address.\n\n: Generate unique one-time addresses for recipients, ensuring transactions cannot be linked back to a public address. Ring Confidential Transactions (RingCT) : Conceal transaction amounts.\n\n: Conceal transaction amounts. Dandelion++ Protocol: Helps obscure the origin of transactions during network propagation.\n\nThese features collectively create a blockchain that is opaque by design, frustrating conventional blockchain analysis techniques.\n\n1. Chainalysis and Monero Tracking Services\n\nAttempt: Chainalysis, a prominent blockchain analytics company, has been reported to develop tools capable of providing some insights into Monero transactions. While specifics are scarce due to the proprietary nature of their methods, Chainalysis has publicly acknowledged limited success with Monero tracking.\n\nMethodology: Their approach likely involves exploiting known vulnerabilities, such as timing analysis of transactions or correlating off-chain data (e.g., exchange deposits and withdrawals).\n\nEfficacy: Limited. Chainalysis’s methods have reportedly provided probabilistic results rather than deterministic deanonymization. For example, law enforcement contracts suggest they may only achieve partial success in scenarios where Monero interacts with non-private cryptocurrencies or centralized exchanges.\n\n2. CipherTrace’s Monero Analysis Tool\n\nAttempt: In 2020, CipherTrace claimed to develop tools to track Monero transactions, purportedly offering these capabilities to the U.S. Department of Homeland Security (DHS).\n\nMethodology:\n\nTransaction Heuristics : CipherTrace suggested it could identify patterns or anomalies in transaction data.\n\n: CipherTrace suggested it could identify patterns or anomalies in transaction data. Network Analysis: Monitoring IP addresses and network-level metadata during transaction broadcasts.\n\nEfficacy: Controversial. Critics argue CipherTrace has not demonstrated comprehensive deanonymization and question the validity of their claims. Monero’s development team and community members have scrutinized CipherTrace’s assertions, pointing out the lack of independent verification.\n\n3. Academic Research: Breaking Monero’s Privacy with Statistical Analysis\n\nAttempt: Various academic papers have explored vulnerabilities in Monero’s privacy model. A notable example is the 2017 research by Möser, Kappos, and Böhme, which analyzed Monero’s ring signature scheme.\n\nMethodology:\n\nStatistical Analysis of Ring Signatures : The researchers identified weaknesses in older versions of Monero’s ring signature implementation, where decoy selection was not truly random.\n\n: The researchers identified weaknesses in older versions of Monero’s ring signature implementation, where decoy selection was not truly random. Temporal Analysis: Exploiting the time at which outputs were used as inputs in subsequent transactions to infer relationships.\n\nEfficacy: Significant but outdated. Monero developers promptly addressed these vulnerabilities by introducing mandatory RingCT and improving decoy selection algorithms.\n\n4. Blockchain Analysis Firms and Metadata Correlation\n\nAttempt: Firms like Elliptic and others have explored off-chain metadata correlation to deanonymize Monero users indirectly.\n\nMethodology:\n\nExchange Data : Linking Monero transactions to known addresses at centralized exchanges.\n\n: Linking Monero transactions to known addresses at centralized exchanges. IP and Geolocation Data: Using network-level surveillance to track transaction broadcasts.\n\nEfficacy: Partial. Success depends on external factors, such as users’ operational security practices and reliance on exchanges with Know Your Customer (KYC) protocols.\n\n5. Government Initiatives: The IRS Bounty Program\n\nAttempt: In 2020, the Internal Revenue Service (IRS) offered a $625,000 bounty for anyone capable of cracking Monero’s privacy.\n\nMethodology:\n\nCollaborations with Analytics Firms : Contracts with Chainalysis and Integra FEC aimed to develop Monero-tracking tools.\n\n: Contracts with Chainalysis and Integra FEC aimed to develop Monero-tracking tools. Network Surveillance: Leveraging external data sources and possible timing attacks.\n\nEfficacy: Unknown/Zero. While the bounty led to partnerships, there is no public evidence that these efforts resulted in comprehensive deanonymization.\n\n6. Community-Driven Efforts: “Breaking Monero” Series\n\nAttempt: The Monero Research Lab and community members created the “Breaking Monero” series, which proactively identifies and mitigates potential vulnerabilities.\n\nMethodology:\n\nWhite-Hat Analysis : Evaluating transaction linkability, decoy selection, and network-level attacks.\n\n: Evaluating transaction linkability, decoy selection, and network-level attacks. Ongoing Hard Forks: Implementing upgrades to enhance Monero’s privacy features.\n\nEfficacy: Proactive and robust. These efforts have strengthened Monero’s resistance to tracking.\n\nConclusion: Monero’s Privacy Remains Resilient\n\nDespite various attempts by governments, firms, and researchers to deanonymize Monero, the cryptocurrency’s privacy features have proven remarkably resilient. While certain methodologies have exploited weaknesses or probabilistically reduced anonymity, none have achieved reliable, widespread deanonymization. Monero’s active development community continues to fortify its defenses, ensuring it remains a leading choice for privacy-focused users.\n\nReferences:"
    },
    {
        "title": "Kraken to allow trading of tokenized versions of Apple and other popular stocks",
        "description": "If you love Apple and you love crypto, good news: cryptocurrency exchange Kraken is preparing to let users trade tokenized versions of popular stocks like Apple, Tesla, and Nvidia. Except if you’re in the U.S., that is.\n\n\n\n more…",
        "url": "https://9to5mac.com/2025/05/22/kraken-to-allow-trading-of-tokenized-versions-of-apple-stocks/",
        "source": "9to5Mac",
        "publishedAt": "2025-05-22T15:42:58Z",
        "full_text": "If you love Apple and you love crypto, good news: cryptocurrency exchange Kraken is preparing to let users trade tokenized versions of popular stocks like Apple, Tesla, and Nvidia. Except if you’re in the U.S., that is.\n\nAccording to an exclusive report by the WSJ, Kraken’s new product, called xStocks, will first be made available to customers in Europe, Latin America, Africa, and Asia, with a broader rollout planned in the coming weeks.\n\nxStocks\n\nAs the WSJ explains:\n\nKraken refers to its new breed of tokens with the brand name “xStocks.” They will be deployed on the Solana blockchain platform. (…) Behind the scenes, xStocks tokens will be backed by shares of the underlying security, with Kraken’s partner company Backed Finance acquiring new shares as needed, the companies say. The tokens are to be redeemable for the cash value of the underlying securities. In theory, that should keep the tokens’ prices in line with the prices of the corresponding stocks and ETFs.\n\nIn practice, this means xStocks will behave more like stablecoins pegged to real-world assets than like actual shares. This will let users speculate on the price of Apple or Tesla without owning any voting rights or receiving dividends.\n\nAmong the ETFs Kraken plans to tokenize are the SPDR S&P 500 (SPY) and SPDR Gold Shares, two of the most widely held index funds in the world.\n\nWhy tokenize Apple stock?\n\nKraken’s pitch is simple: international access to U.S. markets is still clunky, expensive, and slow. “There’s a lot of friction,” Kraken co-CEO Arjun Sethi told the WSJ. xStocks aim to fix that by offering instant settlement and around-the-clock global availability.\n\nIn effect, this could be the first step toward putting U.S. stocks on the internet in a truly native way, making assets like Apple or Tesla tradable 24/7, even when Wall Street is asleep.\n\n“But didn’t Binance already try this?” Yes. And it didn’t end well.\n\nBinance briefly offered tokenized stocks like Tesla back in 2021, but shut them down months later after facing regulatory pressure. To avoid this scenario, Kraken says it’s working with regulators in each region.\n\nAnd the landscape has shifted. Tokenization is no longer just crypto hype. It’s slowly creeping into the financial mainstream. Apple stock on a blockchain might sound like a niche experiment today, but if companies like Kraken play this right, this could really be the beginning of a new way for global investors to access U.S. assets."
    },
    {
        "title": "A crypto founder faked his death. We found him alive at his dad's house",
        "description": "Crypto founder Jeffy Yu appeared to commit suicide in a Sunday video. Then we found him alive and well on Wednesday at his dad's San Francisco home.",
        "url": "https://sfstandard.com/2025/05/08/jeffy-yu-zerebro-fake-death/",
        "source": "Sfstandard.com",
        "publishedAt": "2025-05-12T13:07:58Z",
        "full_text": "Jeffy Yu was days away from his 23rd birthday when he appeared to take his own life Sunday in a video. A flattering obituary appeared, calling the aspiring crypto mogul “a visionary artist, technologist, and cultural force” and “a tech prodigy from an early age.” A memecoin in Yu’s honor went up for sale.\n\n\n\nBut in the days that followed, online sleuths raised doubts about the video’s authenticity. The obituary disappeared. Whatever deceptive game was being played came to an indisputable end when The Standard found Yu on Wednesday, holed up at his parents’ Crocker-Amazon home.\n\nStanding outside the two-story house, the supposedly gifted tech developer was agitated and shocked that he had been found after some routine internet searches.\n\n“I’ve been doxxed. I’ve been harassed. If you can find me, other people can find me,” he said. “Now I have to move my parents out of here this week.”\n\nYu is the developer of Zerebro, an obscure cryptocurrency token with a market capitalization of $44 million. (Bitcoin, by comparison, has a market cap of $2 trillion.) Zerebro was little known until videos of Yu appearing to shoot himself began circulating early Sunday."
    },
    {
        "title": "I used Govee's pixel display, and it is fabulous",
        "description": "Govee's Gaming Pixel Light is a pixel grid that has limitless customizability. With a vibrant LED panel, over 150 scenes, and gorgeous pixel art, this is the best retro desk accessory around.",
        "url": "https://www.androidcentral.com/accessories/govee-gaming-pixel-light-fabulous-retro-accessory",
        "source": "Android Central",
        "publishedAt": "2025-05-19T13:18:32Z",
        "full_text": "I have a half-dozen Govee products, including wall lights, TV backlights, gaming-focused lights, and curtain lights, and the brand consistently does a great job delivering useful features and rock-solid connectivity. Govee's latest product is the Gaming Pixel Light, and it is basically a pixel light grid that's highly customizable.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nThe Gaming Pixel Light is available in two sizes — a 32x32 grid that measures 5.3 x 5.3 inches, and a 52x32 grid that comes in at 8.5 x 5.3 inches — and Govee sent both models over. I prefer the 52x32 as it has a bigger canvas. Interestingly, both models get a 3W audio driver, and you can get alerts via the device itself. There's a stand included in the package that lets you put the Gaming Pixel Light on your desk, and it is wall-mountable.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nGovee showcased the product in January, and it went on sale starting May 19. The 32x32 variant of the Gaming Pixel Light (H6630) is on Amazon at $119, and the 52x32 model (H6631) costs $139. Both models are available on Govee's website as well, and they cost the same as Amazon.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nThe idea behind the Gaming Pixel Light is that you can put it up on your desk and have it scroll through various scenes; it serves as an analog or digital clock, shows real-time weather (you'll need to enter the city name), and there's a nifty countdown timer as well. And if you're invested in all things blockchain, you even get the ability to view real-time Bitcoin pricing (it refreshes every five minutes).\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nI like the ability to use it as an analog clock, but as it doesn't show the seconds hand, I switched to weather mode instead, and it was quite nifty. What's particularly great is that you can use the pixel grid to show various scenes; there are over 150 scenes programmed in the Govee app, and you get a vast selection of choices. The best part about using Govee products is that they can be integrated into Home Assistant, and it is a big reason why I prefer using the brand.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nThe pixelated grid is decidedly retro, but the LED colors are uniform, and you can adjust the brightness of the panel. There's a music mode as well that changes the patterns dynamically based on music playing in the vicinity (it has a built-in mic), and my favorite feature is the ability to use your own images or videos on the panel.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nLike everything else these days, you get an AI-assisted feature that lets you create new scenes by talking to the Govee AI assistant. I asked it to create a Pac-Man scene, and it did a semi-decent job. To round out the features, you get a finger drawing mode that lets you sketch out a pattern to use on the panel.\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nImage 1 of 3 (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central)\n\nThe design itself ties in with a gamer-focused aesthetic, with the black design intersected by jagged edges and green etched lines. The speaker is housed at the back, and you have controls up top to switch the panel on or off, adjust volume, and change scenes.\n\nImage 1 of 5 (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central) (Image credit: Apoorva Bhardwaj / Android Central)\n\nThe only limitation with the Gaming Pixel Light is that it needs to be plugged in — there's no built-in battery. That obviously curbs its usability as you'll need to house it in a location with easy access to a wall plug, and I would've liked a truly portable unit with a battery.\n\n(Image credit: Apoorva Bhardwaj / Android Central)\n\nOther than that, the Gaming Pixel Light is faultless. If you grew up playing 8-bit games and want a pixel grid that's highly customizable, this is the one to get. Govee did a fantastic job with the panel, but it's the customizability where the Gaming Pixel Light truly shines. If you're eyeing this product, I'd suggest getting the 52x32 model."
    },
    {
        "title": "Trump’s meme coin business racks up fees as buyers jump for access to president",
        "description": "President Donald Trump on Monday promoted a dinner he’s set to attend later this month that’s open to almost anyone who buys enough of his meme coin",
        "url": "https://abcnews.go.com/US/wireStory/trumps-meme-coin-business-racks-fees-buyers-jump-121497918",
        "source": "ABC News",
        "publishedAt": "2025-05-06T00:50:41Z",
        "full_text": ""
    },
    {
        "title": "8 countries where Trump has been making new business deals, from Pakistan to Vietnam",
        "description": "Businesses spearheaded by President Donald Trump have struck numerous deals since Trump returned to the White Housein January.Read more...",
        "url": "https://qz.com/trump-organization-deals-countries-real-estate-crypto-1851781604",
        "source": "Quartz India",
        "publishedAt": "2025-05-21T09:00:00Z",
        "full_text": "Businesses spearheaded by President Donald Trump have struck numerous deals since Trump returned to the White House in January.\n\nAdvertisement\n\nLeading the way is the Trump Organization, a conglomerate privately owned by the president. With more than 250 subsidiaries, it serves as a holding company for Trump’s various hotels, residential real estate, towers, resorts, and golf courses across the world.\n\nWorld Liberty Financial, a decentralized protocol that merges financial services and cryptocurrency, has also brokered deals. A Trump business entity owns 60% of World Liberty and is entitled to 75% of all revenue from coin sales. Eric Trump and Donald Trump Jr. manage the company.\n\nHere are the countries where the Trump empire has been dealmaking."
    },
    {
        "title": "Understanding What Blockchain Can Offer Enterprises",
        "description": "Here are real-world business benefits that blockchain can offer and two key considerations for assessing its fit.",
        "url": "https://www.forbes.com/councils/forbestechcouncil/2025/05/05/understanding-what-blockchain-can-offer-enterprises/",
        "source": "Forbes",
        "publishedAt": "2025-05-05T10:30:00Z",
        "full_text": ""
    },
    {
        "title": "Understanding Real-World Assets On The Blockchain",
        "description": "There are things we do in the real world that can be perfect for blockchains.",
        "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/05/12/understanding-real-world-assets-on-the-blockchain/",
        "source": "Forbes",
        "publishedAt": "2025-05-12T11:45:00Z",
        "full_text": ""
    },
    {
        "title": "Xinbi Telegram Market Tied to $8.4B in Crypto Crime, Romance Scams, North Korea Laundering",
        "description": "A Chinese-language, Telegram-based marketplace called Xinbi Guarantee has facilitated no less than $8.4 billion in transactions since 2022, making it the second major black market to be exposed after HuiOne Guarantee.\nAccording to a report published by blockc…",
        "url": "https://thehackernews.com/2025/05/xinbi-telegram-market-tied-to-84b-in.html",
        "source": "Internet",
        "publishedAt": "2025-05-14T15:27:00Z",
        "full_text": ""
    },
    {
        "title": "Disney+ launches fan perks with Disney Pinnacle by Dapper Labs",
        "description": "Disney+ has launched its always-on perks program with exclusive offers designed for subscribers. And with Disney is also launching Disney Pinnacle by Dapper Labs.",
        "url": "https://venturebeat.com/games/disney-launches-fan-perks-with-disney-pinnacle-by-dapper-labs/",
        "source": "VentureBeat",
        "publishedAt": "2025-05-29T19:35:00Z",
        "full_text": "Disney+ has launched its always-on perks program with exclusive offers designed for subscribers. And with Disney is also launching Disney Pinnacle by Dapper Labs.\n\nThe aim is to increase loyalty and reward fans with exclusive access, special discounts and fan-focused experiences. The Disney Pinnacle part is interesting as Dapper Labs is a Web3 gaming company. More on that below.\n\nDisney+ has launched of its new, always-on Perks program, offering fans rewards ranging from access to one-of-a-kind experiences and limited-time sweepstakes to everyday savings and special discounts. The program launches today in the U.S., expanding the streamer’s current offerings into an always-on program, with additional international rollouts to follow later this year.\n\nAt launch, Disney+ and bundle subscribers will have access to a chance to win tickets to the Freakier Friday World Premiere and be among the first to see the all-new sequel before it arrives in theaters August 8. There’s also a chance to win a four-night cruise on the Disney Destiny, the newest ship in the Disney Cruise Line fleet, sailing from Ft. Lauderdale beginning November 2025.\n\nUsers can also get a six-month free DashPass membership from DoorDash, a 20% off on adidas.com and in the adidas app, a 15% off purchases at Funko.com and Loungefly.com, a three-month free trial of CLEAR+ for travelers, and a two-month Super Duolingo free trial. And gamers can get a free in-game emoji from Disney Emoji Blitz.\n\nDapper Labs, a blockchain game company, is involved in Disney Pinnacle. Disney+ subscribers will get early access to the closed release of Disney Pinnacle by Dapper Labs, a monthly Mystery Capsule. Those subscribers will have until June 26th to claim a $10 Dapper Credit.\n\nUsers can also get special summer savings at Walt Disney World Resort! Stay 2 nights or longer at select Disney Resorts Collection hotels and get rates starting from $99 per night at Disney’s All-Star Sports Resort. And players can get a free Monopoly Go and Star Wars TIE fighter in-game token.\n\nBeginning June 2, Hulu will debut its first-ever suite of offerings, complementing the Disney+ Perks program and unlocking even more benefits for Hulu and bundle subscribers. Throughout the summer, new Hulu Perks will drop weekly including a chance to go to Comic-Con and more.\n\n“Our fans are some of the most passionate in the world, and Perks are our way of thanking them for subscribing to Disney+,” said Samantha Rosenberg, Executive Vice President, Marketing, Disney+, in a statement. “Whether it’s access to in-demand experiences that only Disney can offer or everyday savings and special discounts from top brands, we’re building two complimentary programs that are all about celebrating our viewers.”\n\nMore than a year ago, Disney+ pioneered the first subscriber perks program in streaming, and now, joined by Hulu, both platforms are setting a new standard for how streamers reward their audiences, adding ongoing value and delight to the Disney streaming experience.\n\nThis is just the beginning. New Perks will drop regularly, giving fans more reasons to check in, discover something new, and engage with the stories they love. Visit disneyplus.com/perks for additional information and stay tuned to @hulu on social.\n\nDisney+ Perks requires an active Disney+ subscription and enrollment in the program; terms apply. See https://perks.disneyplus.com/en_us/offer-terms for offer terms.\n\nDetails on Disney Pinnacle by Dapper Labs\n\nDisney Pinnacle by Dapper Labs\n\nDisney Pinnacle by Dapper Labs is a big deal as it’s a step into Web3 collectibles.\n\nDisney Pinnacle is a socially driven collectible experience that brings the magic of digital pin collecting to the modern age. Disney Pinnacle by Dapper Labs unites characters spanning 100 years of Disney, along with favorites from Pixar and iconic figures from the Star Wars galaxy, all uniquely styled as collectible and tradable digital pins. Join now to begin collecting and trading your favorite characters.\n\nDisney Pinnacle by Dapper Labs is currently launching in a closed release which will be open to select collectors. Collectors can purchase digital pins directly in the shop which contains a revolving storefront, Mystery Capsules and bundles.\n\nIn the revolving storefront, collectors can buy select open edition digital pins during limited sales windows. Mystery Capsules are available from various sets, each containing one digital pin. Details on specific pins and their odds can be found on the Mystery Capsule page. Look out for regular Open Edition and Limited Edition releases, each featuring a curated set of digital pins from Walt Disney Animation Studios, Pixar Animation Studios and Star Wars.\n\nAs for being able to trade Disney Pins with other collectors, Disney said people should stay tuned. A marketplace will be coming to Disney Pinnacle by Dapper Labs at a later date.\n\nPinbooks are the best way to show off your Disney Pinnacle by Dapper Labs collection to your friends and fellow collectors in the community. You can create your pinbook in the Disney Pinnacle by Dapper Labs app where you can customize, save and share it with your friends.\n\nDisney Pinnacle by Dapper Labs is now available in Early Access on both Android and iOS. Collectors can purchase digital pins using in-app purchases to complete their transactions. At this time, Dapper Balance will not be available for purchases but players should watch socials for the latest updates regarding accepted payment methods in the future."
    },
    {
        "title": "Protesters decry 'crypto corruption' as Trump fetes top investors in his meme coin",
        "description": "President Trump praised the top investors in his cryptocurrency meme coin at an exclusive black-tie dinner Thursday as protesters demonstrated outside the event.",
        "url": "https://abcnews.go.com/US/protesters-decry-crypto-corruption-trump-fetes-top-investors/story?id=122111834",
        "source": "ABC News",
        "publishedAt": "2025-05-23T17:39:03Z",
        "full_text": ""
    },
    {
        "title": "Trump's top meme coin investors invited to White House",
        "description": "Some investors in President Trump's meme coin were expected to visit the White House Friday, despite officials saying a gala for them was outside Trump's official duties.",
        "url": "https://abcnews.go.com/US/trumps-top-meme-coin-investors-invited-white-house/story?id=122128541",
        "source": "ABC News",
        "publishedAt": "2025-05-24T00:05:39Z",
        "full_text": ""
    },
    {
        "title": "Stanford's Blockchain And AI Conference Needs More Bitcoin",
        "description": "In mid-March, Stanford University hosted a Blockchain and AI conference, bringing together professors, startup CEOs, and venture capitalists (VCs).",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/19/stanfords-blockchain-and-ai-conference-needs-more-bitcoin/",
        "source": "Forbes",
        "publishedAt": "2025-05-19T15:35:49Z",
        "full_text": ""
    },
    {
        "title": "How Blockchain Technology Can Revolutionize Healthcare Data Cybersecurity",
        "description": "As of 2025, blockchain technology has seen growing yet still early-stage implementation among health insurance companies.",
        "url": "https://www.forbes.com/councils/forbestechcouncil/2025/05/29/how-blockchain-technology-can-revolutionize-healthcare-data-cybersecurity/",
        "source": "Forbes",
        "publishedAt": "2025-05-29T14:15:00Z",
        "full_text": ""
    },
    {
        "title": "Meet the 10 AI startup unicorns with tiny teams",
        "description": "These AI startups are hitting billion-dollar valuations with 50 employees or fewer as founders use new tech to maintain lean teams.",
        "url": "https://www.businessinsider.com/ai-startup-unicorns-with-tiny-teams-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-07T09:00:02Z",
        "full_text": "Ilya Sutskever, cofounder and chief scientist at Safe Superintelligence and cofounder and former chief scientist at OpenAI.\n\nIlya Sutskever, cofounder and chief scientist at Safe Superintelligence and cofounder and former chief scientist at OpenAI. JACK GUEZ/AFP via Getty Images\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe advent of AI has enabled startups to do more with less, prompting some founders to maintain extremely lean teams.\n\n\"We're going to see 10-person companies with billion-dollar valuations pretty soon,\" OpenAI CEO Sam Altman said in February 2024. \"In my little group chat with my tech CEO friends, there's this betting pool for the first year there is a one-person billion-dollar company, which would've been unimaginable without AI. And now [it] will happen.\"\n\nSome of AI's biggest names have built upon tiny teams, such as Anysphere, the maker of coding copilot Cursor, which grew from $1 million to $100 million in annual recurring revenue in less than a year with fewer than 50 employees, per private market research platform Sacra.\n\nAs a general rule, companies hire more employees when their businesses grow. Small tech teams aren't entirely unheard of — Facebook bought Instagram in 2012 for $1 billion when the photo-sharing app only had 13 employees — but they're exceedingly uncommon for startup unicorns.\n\nNow, the venture ecosystem is powering a new generation of billion-dollar companies, made so efficient with AI that they only need a handful of employees.\n\nBusiness Insider compiled a list of the highest-valued AI startups around the world with teams of 50 employees or fewer, according to PitchBook data.\n\nPitchBook said its data only includes VC-backed companies with known employee counts and may not be the most up-to-date information. Business Insider independently contacted the companies listed and cross-referenced PitchBook's data with the number of employees associated with the startups' LinkedIn pages.\n\nHere are the 12 AI startups valued at $1 billion+ with teams of 50 people or fewer."
    },
    {
        "title": "How GPUs could shape the future of blockchain and blockchain could shape the future of GPUs",
        "description": "Jensen Huang's keynote at GTC 2025 has again been a real show. It gave insights on the future of AI, quantum computing, self-driving cars, etc. But I couldn't help but notice one big absence though: blockchain. AI, especially with the advent of Large Language…",
        "url": "https://betanews.com/2025/05/27/how-gpus-could-shape-the-future-of-blockchain-and-blockchain-could-shape-the-future-of-gpus/",
        "source": "BetaNews",
        "publishedAt": "2025-05-27T11:28:22Z",
        "full_text": "Jensen Huang's keynote at GTC 2025 has again been a real show. It gave insights on the future of AI, quantum computing, self-driving cars, etc. But I couldn't help but notice one big absence though: blockchain.\n\nAI, especially with the advent of Large Language Models (LLMs) has driven a massive demand for GPUs. Real-time processing in self-driving cars is also very demanding, so those are areas where GPUs can play a critical role. However, while GPUs have historically been used for cryptocurrency mining, it seems like Nvidia has been cautious about blockchain as a focus area in recent years. This might be due to the volatility of the market, regulatory concerns, or a shift in the overall blockchain landscape -- especially with Ethereum's shift from proof-of-work to proof-of-stake, which reduces the need for traditional mining hardware.\n\nThat said, advanced cryptography techniques are being embedded in blockchains as we speak: Zero Knowledge Proofs (ZK) and Fully Homomorphic Encryption (FHE).\n\nZK proofs are designed to prove a statement without revealing the underlying data. It’s being used today for privacy-preserving transactions, decentralized identity verification, and scalability (via ZK-Rollups). However, ZK proofs are generally limited to verifying correctness (e.g., proving that you know a secret without revealing it) and do not allow arbitrary computation on encrypted data.\n\nFHE on the other hand, allows computations to be performed on encrypted data without decrypting it first, which is a huge leap forward in terms of privacy and security. As blockchain systems move toward more privacy-preserving solutions, FHE will be crucial, especially for sensitive data that needs to remain encrypted throughout its lifecycle. This is where GPUs could come to play a significant role. Indeed, smart contracts that integrate FHE will require heavy computational power, as FHE operations are much more resource-intensive than their non-encrypted counterparts. GPUs, with their massive parallel processing power, are perfectly suited to handle this kind of workload, allowing for more efficient execution of FHE-based computations.\n\nNvidia (and other GPU manufacturers) could benefit from this shift in blockchain technology. Rather than being limited to traditional mining, GPUs could become essential for the real-time processing of smart contracts that require secure, encrypted computations. The performance demands for processing these encrypted transactions might not be fully realized yet, but as blockchain adoption grows, so will the need for this kind of GPU acceleration.\n\nI see it as a huge opportunity for GPU manufacturers. This could lead to new partnerships or developments in blockchain technology, as well as the broader adoption of GPUs in decentralized applications that require secure computation.\n\nWe're already seeing blockchain companies start experimenting with FHE (Shiba for example). Blockchain is a space that evolves rapidly, and privacy features like FHE are highly relevant as the demand for secure, private transactions grows.\n\nAs companies experiment with FHE, there will likely be some challenges around performance, scalability, and ease of implementation. But if FHE proves to be as powerful as expected for secure computation, its adoption could become a driving force for accelerated computing.\n\nHardware manufacturers will likely have to work closely with blockchain developers to optimize their products for these types of tasks. It might open the door to entirely new software and hardware ecosystems focused on privacy-preserving blockchain applications, making it a really exciting area to watch.\n\nIt'll be interesting to see how quickly the blockchain industry can leverage the potential of FHE to grow beyond its current state. As blockchain adoption grows, we could see privacy-focused applications become a key selling point, further accelerating the need for FHE-enabled solutions.\n\nImage credit: Acnalesky/Dreamstime.com\n\nAgnès Leroy is GPU Director at Zama."
    },
    {
        "title": "Web3 Advertising Trends For 2025",
        "description": "Web3 advertising is powered by innovative tech like blockchain, smart contracts and tokenization.",
        "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/05/29/web3-advertising-trends-for-2025/",
        "source": "Forbes",
        "publishedAt": "2025-05-29T13:00:00Z",
        "full_text": ""
    },
    {
        "title": "BlackRock-Backed Securitize Raises Strategic Funding From Jump Crypto",
        "description": "As tokenization of real-world assets explodes, two blockchain-focused companies are expanding institutional access.",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/08/blackrock-backed-securitize-raises-strategic-funding-from-jump-crypto/",
        "source": "Forbes",
        "publishedAt": "2025-05-08T15:30:58Z",
        "full_text": ""
    },
    {
        "title": "Jamie Dimon says JPMorgan will let customers buy Bitcoin",
        "description": "The JPMorgan Chase CEO has long been skeptical of the cryptocurrency",
        "url": "https://qz.com/jpmorgan-chase-bitcoin-jamie-dimon-crypto-1851781358",
        "source": "Quartz India",
        "publishedAt": "2025-05-19T19:57:00Z",
        "full_text": "Crypto is about to get even more mainstream.\n\n\n\nJPMorgan Chase (JPM-1.03% ) customers will soon be able to buy Bitcoin through the bank, CEO Jamie Dimon said Monday during the company’s annual Investor Day.\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\n“We are going to allow you to buy it,” Dimon said to shareholders, while adding that the bank won’t hold the asset in custody, according to CoinDesk. The firm didn’t immediately respond when Quartz about its timeframe.\n\nAdvertisement\n\nThe move is especially surprising considering Dimon’s long-held negative views of the leading cryptocurrency. “Bitcoin itself has no intrinsic value,” he said in an interview with CBS News (PARA-0.77% ) in January. “It’s used heavily by sex traffickers, by money launderers, ransomware. So I just don’t feel great about Bitcoin.” At the time, he also likened the token to smoking. “I applaud your ability to want to buy or sell it, just like I think you have the right to smoke,” he said. “But I don’t think you should smoke.”\n\nAdvertisement\n\nLast year, Dimon called Bitcoin a “fraud” and “Ponzi scheme” in an interview with Bloomberg.\n\nAdvertisement\n\nDuring his closing remarks on Monday, Dimon reiterated his anti-crypto stance, saying he’s still “not a fan” of Bitcoin because of its links to illegal activities.\n\n“We have been talking about blockchain for 12 to 15 years,” he said, according to CoinDesk. “We spend too much on it. It doesn’t matter as much as you all think.”\n\nAdvertisement\n\nDespite Dimon’s hangups, the new endeavor isn’t JPMorgan’s first move into crypto. Last week, the bank’s blockchain platform, Kinexys, conducted a test transaction on a public blockchain for the first time.\n\nOther major banks have also pushed into the crypto space in recent months. In August, Morgan Stanley (MS-1.00% ) began allowing its financial advisors to pitch spot Bitcoin exchange-traded funds (ETFs) to certain clients. Morgan Stanley CEO Ted Pick told CNBC at Davos in January that the bank is looking for ways to get more involved in the crypto market. In February, Bank of America (BAC-1.24% ) CEO Brian Moynihan said the bank would issue its own stablecoin if a legal framework for doing so were to be established."
    },
    {
        "title": "How to title your blog post or whatever",
        "description": "choose a classifier",
        "url": "https://dynomight.net/titles/",
        "source": "Dynomight.net",
        "publishedAt": "2025-05-12T16:11:43Z",
        "full_text": "So you’ve made a thing. I’ll pretend it’s a blog post, though it doesn’t really matter. If people read your thing, some would like it, and some wouldn’t.\n\nYou should try to make a good thing, that many people would like. That presents certain challenges. But our subject today is only how to give your thing a title.\n\nMy advice is: Think of the title as “classifier”.\n\nWhen people see the title, some are likely to click on it and some won’t. Abstractly speaking, the title adds a second dimension to the above figure:\n\nA title has two goals. First, think of all the people in the world who, if they clicked on your thing, would finish it and love it. Ideally, those people would click. That is, you want there to be people in the like + click region:\n\nOther people will hate your thing. It’s fine, some people hate everything. But if they click on your thing, they’ll be annoyed and tell everyone you are dumb and bad. You don’t want that. So you don’t want people in the hate + click region.\n\nI find it helpful to think about all title-related issues from this perspective.\n\nEveryone is deluged with content. Few people will hate your thing, because very few will care enough to have any feelings about it at all.\n\nThe good news is that it’s a big world and none of us are that unique. If you make a thing that you would love, then I guarantee you at least 0.0001% of other people would love it too. That’s still 8000 people! The problem is finding them.\n\nThat’s hard. Because—you don’t like most things, right? So you start with a strong prior that most things are bad (for you). Life is short, so you only click on things when there’s a very strong signal they’ll be good (for you).\n\nSay you write a post about concrete. Should you call it, “My favorite concrete pozzolanic admixtures”, even though 99.9% of people have no idea what pozzolanic means? Well, think of the people who’d actually like your thing. Do they know? If so, use “pozzolanic”. That gives a strong signal to Concrete People: “Hey! This is for you! And you know I’m not lying about that, because I’ve driven away all the noobs.”\n\nSo ideally you’re aiming for something like this:\n\nBe careful imitating famous people. If Barack Obama made a thing called “Thoughts on blockchain”, everyone would read it, because the implicit title is “Thoughts on blockchain, by Barack Goddamn Obama”. Most of the titles you see probably come from people who have some kind of established “brand”. If you don’t have that, you probably don’t want to choose the same kind of titles.\n\nThe title isn’t just about the subject. I called this post, “How to title your blog post or whatever” partly because I hope some of this applies to other things beyond blog posts. But mostly I did that because it signals that my style is breezy and informal. I think people really underrate this.\n\nSome people choose clever punny titles. If you have a big audience that reads all your things, then your title doesn’t need to be a good classifier. I’m not in that situation, but I sometimes find a pun so amusing that I can’t resist. “Fahren-height” was worth it. “Taste games” was not.\n\nTraditional advice says that you should put your main “message” in the title. I have mixed feelings about that. On the one hand, it provides a lot of signal. On the other hand, it seems to get people’s hackles up. The world is full of bad things that basically pick a conclusion and ignore or distort all conflicting evidence. If you’re attempting to be fair or nuanced, putting your conclusion in the title might signal that you’re going to be a typical biased/bad thing. It will definitely lead to lots of comments “refuting” you from people who didn’t read your thing.\n\nPutting your conclusion in the title may also ruin your “story”. Though you should ask: Do the people who’d like your thing really care about your story?\n\nA difficult case is things that create new “labels”. Sometimes there’s an idea floating around, and we need someone to make a canonical thing with a Name. To serve that role, the thing’s title needs to be that name. This presents a trade-off. A post titled “The Waluigi Effect” is great for people who want to know what that is, but terrible for everyone else.\n\nFor the best title ever I nominate, “I’m worried about Chicago”. It doesn’t look fancy, but do you see how elegantly it balances all the above issues?\n\nYou’d think that, by 2025, technology would have solved the problem of things getting to people. I think it’s the opposite. Social media is optimized to keep people engaged and does not want people leaving the walled garden. Openly prohibiting links would cause a revolt, so instead they go as close as people will tolerate. Which, it turns out, is pretty close.\n\nBoring titles are OK. I know that no one will click on “Links for April” who doesn’t already follow me. But I think that’s fine, because I don’t think anyone else would like it.\n\nConsider title-driven thing creation. That is, consider first choosing a title and then creating a thing that delivers on the title. It’s sad to admit, but I think there are many good things that simply don’t have good titles. Consider not making those things. The cynical view of this is that without a good title, no one will read your thing, so why bother? The optimistic view is that we’re all drowning in content, so what the world actually needs is good things that can find their way to the people who will benefit from them. In practice, it’s often something in the middle: You start to create your thing, then you choose a title, then you structure your thing to deliver on the title.\n\nMy favorite thing category is “Lucid examination of all sides of an issue which finds some evidence pointing in various directions and doesn’t reach a definitive conclusion because the world is complicated”. Some people make fun of me for spending so much time researching seed oils and then lamely calling my thing “Thoughts on seed oil”. But what should I have called that instead? Lots of bloggers create things in this category, and no one seems to have solved the problem."
    },
    {
        "title": "Cardano to Directly Feature Blockchain and Assets on Brave Browser",
        "description": "Brave Wallet, the crypto wallet integrated into the privacy-focused Brave web browser, will soon support the Cardano blockchain, allowing users to send, receive and swap ADA ADA and Cardano-native assets directly.\nThe move comes as Brave deepens its multichai…",
        "url": "https://biztoc.com/x/b7a168b86f81cb1d",
        "source": "Biztoc.com",
        "publishedAt": "2025-05-13T09:54:22Z",
        "full_text": "Ukraine launched one of the largest drone assaults deep inside Russia, targeting 40+ strategic bombers and air bases, escalating the conflict just before peace talks.\n\nMarket Summary Markets reacted sharply to U.S. tariff hikes, with Asian equities mostly lower while oil prices surged on OPEC+ production decisions. The CE 100 Index climbed 1.7% led by AI stocks, while Dow futures slipped amid tariff worries. Investors remain cautious ahead of mixed economic data and Fed rate cut signals.\n\nFigure of the Day 50% - U.S. steel tariff hike announced by President Trump, doubling previous rates.\n\nNawrocki Clinches Polish Presidency Amid EU Tensions Polish Election Too Close to Call as Runoff Nears Polish presidential election results fuel political tension in Europe, with right-wing Nawrocki narrowly winning and potential impacts on EU relations.\n\nBullish CE 100 Index Rallies 1.7% as AI Stocks Lead Market Recovery Investor enthusiasm for artificial intelligence drives a 1.7% gain in the CE 100 Index, signaling renewed confidence in tech innovation amid trade uncertainties. More on pymnts.com\n\nBearish Trump’s Steel Tariff Hike Sparks Global Market Turmoil Doubling U.S. steel tariffs to 50% rattles Asia-Pacific markets, triggers commodity price jumps, and fuels trade tensions worldwide. More on breakingthenews.net\n\nFBI Probes Targeted Terror Attack in Boulder, Colorado Multiple Injured in Targeted Colorado Attack; Suspect Held Political unrest and terror attacks shake the US, with a targeted terror attack in Boulder, Colorado drawing FBI and White House attention.\n\nRegulatory Impact The Trump administration announces a doubling of steel and aluminum tariffs to 50%, maintains assertive trade policies amid ongoing U.S.-China tensions, and signals regulatory tightening on international tech and defense sectors.\n\nChina Blasts US for Breaking Geneva Trade Deal China Vows Forceful Measures Over US Trade Violations US-China trade tensions persist as China accuses the US of violating trade agreements, escalating diplomatic friction over tech and tariffs.\n\nQuote Inflation fears are alarmist; the U.S. will never default on its debt.\n\n— Treasury Secretary Scott Bessent\n\nTreasury’s Bessent Insists US Will Never Default Bessent Challenges Inflation Alarmism, Defends Trade Tariffs Treasury Secretary Scott Bessent reassures markets claiming US will never default amid ongoing debt ceiling negotiations and tariff disputes.\n\nPoland Swings Right as Nationalist Nawrocki Wins Presidency Poland Exit Polls Show Trump-Backed Candidate Narrowly Ahead European political shifts mark the rise of nationalist leadership in Poland and concerns over future directions within the EU.\n\nUber Exec Details AI Tools Powering Workplace Productivity Anthropic AI Startup Hits Reported $3 Billion Revenue Milestone Tech industry advances AI at work and consumer level, with big names experimenting while debates over AI ethics and productivity continue."
    },
    {
        "title": "The Technology Trio: AI, Blockchain And Cloud Are Driving The Next Tech Revolution",
        "description": "The convergence of AI, blockchain and cloud computing represents an unparalleled synergy that can amplify the strengths of each technology.",
        "url": "https://www.forbes.com/councils/forbestechcouncil/2025/05/02/the-technology-trio-ai-blockchain-and-cloud-are-driving-the-next-tech-revolution/",
        "source": "Forbes",
        "publishedAt": "2025-05-02T11:30:00Z",
        "full_text": ""
    },
    {
        "title": "3 Takeaways From Bitcoin 2025 And Beyond",
        "description": "Bitcoin 2025 made splashy headlines, but major adoption of blockchain and crypto continue to accelerate off center stage",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/30/3-takeaways-from-bitcoin-2025-and-beyond/",
        "source": "Forbes",
        "publishedAt": "2025-05-30T22:18:38Z",
        "full_text": ""
    },
    {
        "title": "May-DEI Survive? Blockchain’s Role In Sustaining Equity Initiatives",
        "description": "How blockchain empowers DEIA programs, sustains equity, and supports marginalized communities amid systemic rollbacks of diversity, equity, and inclusion initiatives.",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/01/may-dei-survive-blockchains-role-in-sustaining-equity-initiatives/",
        "source": "Forbes",
        "publishedAt": "2025-05-01T19:20:16Z",
        "full_text": ""
    },
    {
        "title": "Crypto Founder Jeffy Yu Faked His Own Death on a Live Stream",
        "description": "The man is alive, residing in Arizona, and unhappy to have been found.",
        "url": "https://gizmodo.com/crypto-founder-jeffy-yu-faked-his-own-death-on-a-live-stream-2000600294",
        "source": "Gizmodo.com",
        "publishedAt": "2025-05-10T12:30:54Z",
        "full_text": ""
    },
    {
        "title": "Bitcoin just hit a new record after a long crypto slump",
        "description": "Bitcoin rose to a new record high on Wednesday, surpassing the previous high it hit earlier this year.Read more...",
        "url": "https://qz.com/bitcoin-price-record-high-cryptocurrency-1851781731",
        "source": "Quartz India",
        "publishedAt": "2025-05-21T16:24:00Z",
        "full_text": "Bitcoin rose to a new record high on Wednesday, surpassing the previous high it hit earlier this year.\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish view video How Trump’s tariffs could make your iPhone cost $3,500\n\nHow Trump’s tariffs could make your iPhone cost $3,500 CC Share Subtitles Off\n\nEnglish How Trump’s tariffs could make your iPhone cost $3,500\n\nThe world’s leading cryptocurrency hit a peak of $109,359.59 Wednesday morning, according to Dow Jones Market Data. Its previous high-water mark came on President Donald Trump’s inauguration day in January.\n\nAdvertisement\n\nLike many other cryptocurrencies, Bitcoin suffered through a prolonged slump in the months between, falling as low as $75,000 in March. Its price has climbed steadily ever since and is up 16% so far in May.\n\nAdvertisement\n\nThe rally comes as crypto becomes more accepted by U.S. regulatory bodies and the broader financial world. JPMorgan Chase (JPM-1.03% ) CEO Jamie Dimon announced Monday that its customers will soon be able to buy Bitcoin through the bank. JPMorgan’s blockchain platform, Kinexys, conducted a test transaction on a public blockchain for the first time last week.\n\nAdvertisement\n\nOn Tuesday, the Senate voted to advance the GENIUS Act stablecoin regulation bill, which would create the U.S.’ first regulatory framework for stablecoins. Trump has said he wants crypto regulation ready to sign by the time Congress takes its August recess.\n\nThat news could be especially noteworthy for Bank of America (BAC-1.24% ) : The bank’ CEO Brian Moynihan said in February that Bank of America would issue its own stablecoin if a legal framework for doing so were to be established.\n\nAdvertisement\n\nIn August, Morgan Stanley (MS-1.00% ) began allowing its financial advisors to pitch spot Bitcoin exchange-traded funds (ETFs) to certain clients. Morgan Stanley CEO Ted Pick told CNBC in January that the bank is looking for ways to get more involved in the crypto market.\n\nEarlier this month, Coinbase (COIN-3.06% ) , the biggest crypto exchange in the U.S., joined the S&P 500 stock index, marking a big moment for the industry. The firm holds a reserve of Bitcoin estimated to be worth $750,000, according to CoinGecko. Tesla (TSLA-3.33% ) is also a huge owner of Bitcoin, with an estimated $1.3 billion worth on its ledger."
    },
    {
        "title": "Meet The Tech Innovators On The 2025 30 Under 30 Asia: Consumer & Enterprise List",
        "description": "From blockchain-backed verifications to EVs and edtech platforms, entrepreneurs on the Consumer & Enterprise Technology list are leveraging technologies to offer more efficient and affordable solutions.",
        "url": "https://www.forbes.com/sites/ardianwibisono/2025/05/14/meet-the-tech-innovators-on-the-2025-30-under-30-asia-consumer--enterprise-list/",
        "source": "Forbes",
        "publishedAt": "2025-05-14T21:25:47Z",
        "full_text": ""
    },
    {
        "title": "How To Navigate The Hype Cycle Of Emerging Tech",
        "description": "Learn how to navigate the tech hype cycle and invest in emerging technologies like AI, blockchain, and IoT with timing and strategy that match your goals.",
        "url": "https://www.forbes.com/sites/karlmoore/2025/05/27/how-to-navigate-the-hype-cycle-of-emerging-tech/",
        "source": "Forbes",
        "publishedAt": "2025-05-27T14:08:29Z",
        "full_text": ""
    },
    {
        "title": "Green Fintech’s Data Dividend: How APIs, ESG-Linked Trade And “Kilowatt Tokens” Turn Sustainability Data Into Cash Flow",
        "description": "Green fintech is monetising sustainability data: carbon-tracking APIs, ESG-linked trade finance and blockchain kilowatt tokens slash costs and unlock new revenue.",
        "url": "https://www.forbes.com/sites/zennonkapron/2025/05/29/green-fintechs-data-dividend-how-apis-esg-linked-trade-and-kilowatt-tokens-turn-sustainability-data-into-cash-flow/",
        "source": "Forbes",
        "publishedAt": "2025-05-30T02:38:00Z",
        "full_text": ""
    },
    {
        "title": "Europe’s €1.6B Blackout Shows Why We Need DePIN And AI Now",
        "description": "The 2025 blackout cost Spain over €1.6 billion and exposed deep failures in centralized systems. Blockchain, DePIN, and AI may hold the key to resilient infrastructure.",
        "url": "https://www.forbes.com/sites/digital-assets/2025/05/12/europes-16b-blackout-shows-why-we-need-depin-and-ai-now/",
        "source": "Forbes",
        "publishedAt": "2025-05-13T01:04:46Z",
        "full_text": ""
    },
    {
        "title": "How To Stake Solana And Earn Rewards",
        "description": "Learn how to stake Solana and earn rewards. This guide covers staking basics, staking Solana, and maximizing your earnings on the Solana blockchain.",
        "url": "https://www.forbes.com/sites/digital-assets/article/how-to-stake-solana/",
        "source": "Forbes",
        "publishedAt": "2025-05-25T11:00:00Z",
        "full_text": ""
    },
    {
        "title": "Speed And Safety: What Circle’s IPO Means For Stablecoins",
        "description": "Circle's IPO brings the financial system one step closer to an ecosystem where the \"speed, cost, and access\" of blockchain commerce unlocks global prosperity.",
        "url": "https://www.forbes.com/sites/earlcarr/2025/05/15/speed-and-safety-what-circles-ipo-means-for-stablecoins/",
        "source": "Forbes",
        "publishedAt": "2025-05-15T18:51:08Z",
        "full_text": ""
    },
    {
        "title": "Altman's eyeball-scanning biometric blockchain orbs officially come to America",
        "description": "El Reg checks out shop in SF On Thursday, six stores across America opened their doors with a curious proposition: Come on in, let a metal orb scan your irises, and walk out with a new online profile that promises you're an individual human – and a few bucks …",
        "url": "https://www.theregister.com/2025/05/04/sam_altman_startup_world/",
        "source": "Theregister.com",
        "publishedAt": "2025-05-04T12:43:11Z",
        "full_text": "On Thursday, six stores across America opened their doors with a curious proposition: Come on in, let a metal orb scan your irises, and walk out with a new online profile that promises you're an individual human – and a few bucks in crypto for your troubles.\n\nThe US retail stores are the latest outgrowth of the World (formerly known as WorldCoin) project - the flagship initiative from Tools for Humanity, a startup co-founded in 2019 by OpenAI boss Sam Altman, along with Alex Blania and Max Novendstern.\n\nWorld allows you to verify you are an actual person so that you can log into services that require the platform. It specializes in attempting to distinguish real humans from bots and AI-generated imitators. The idea being, if you're running a site or app – internet gaming or dating, say – and you really want to make sure each of your users are genuine individuals and not automated fakes, World provides that level of user identity and authenticity management.\n\nHere's the catch: The most reliable way to do this, the startup argues, is with biometric scanning.\n\nWorld's key components include the Orb (a glossy sphere that photos your iris and face), World ID (a blockchain-based so-called proof-of-personhood system), the World App (where users manage their ID and get access to services), and Worldcoin (aka WLD, A cryptocurrency distributed to users as a reward).\n\nUnsurprisingly, regulators around the world have raised concerns about this whole idea of an upstart collecting and storing people's biometric data. South Korea fined the startup over $800,000 for privacy violations. Hong Kong ordered it to cease operations entirely, and Germany, Kenya, and Spain have initiated various legal actions against the firm.​\n\nBut never mind all that - on to America! The upstart has now set up shopfronts in Austin, Atlanta, Los Angeles, Miami, Nashville, and San Francisco, with its eyeball-scanning Orb devices. Since SF is also the home of Vulture West, we decided to pop in and have a look.\n\nThe store, nestled between Macy's and Louis Vuitton in the city's Union Square, is a tad ramshackle and barely painted. A wooden structure in the center of the room houses eight soccer ball-sized Orbs at varying heights.\n\nWorld's San Francisco outlet ... The Apple Store it ain't\n\nHere's how it works for us netizens. We'll assume you need to create (or anticipate creating) a verified-human profile on World that's required by an app or service you want to use.\n\nFirst, you must download the World App, sign in, and after entering the store, wait as it links with a nearby Orb. The app tells you where to stand in relation to the sphere and how to position your head, and the scan of your eyes and face takes a few seconds to complete. That data is used to build a blockchain-based World ID unique to you based on your physically biometric info.\n\nSpecifically, that biometric scan is encrypted and sent directly to your phone to be converted into that unique identity token, after which the info is deleted on the Orb itself, the project says. As an incentive, the World app is credited with Worldcoins worth a little over $16 in real-world money. That token is then used later on when logging into things to prove you are a unique, genuinely real human.\n\nDespite all the scrutiny, the startup claims to have 26 million people using its app around the world, with 12 million people having added their biometric data.\n\nAt a Wednesday event in SF, Altman and Blania officially launched the organization in the US – there have been trials around the world – and said the outfit wanted to have 7,500 Orbs - four times the total current installed base - in place across the States by the end of the year. The biz has set up a factory in Texas to pump out Orbs for America and the rest of the world, and is working on a miniaturized version to increase verification.\n\n“I’m a very proud American, I think America should lead innovation, not fight it off,” Altman said at the shindig, which you can watch below.\n\nYoutube Video\n\nAt the gathering, Blania said the three areas the business will be focusing on are gaming, online dating, and social media, mainly to eliminate bots masquerading as real people. World IDs can help assure people they are chatting to actual people online, he claimed. That said, it's not a panacea; we can think of some drawbacks.\n\nWorld announced two partnerships during its US launch. A Visa-backed debit card will be issued later this year, and Match.com in Japan will be using World ID to reassure nervous daters.\n\nDuring our store visit, an assistant said the amount of traffic for the Orbs had been very high, but we observed only a handful of people giving it a try in the 15 minutes in the shop. One man, a visitor to the RSA Conference happening just down the road, said he'd heard about it at the show and \"free money is free money.\" We hope he's right. ®"
    },
    {
        "title": "Solana Name Service airdrops 40% of token supply after FIDA tokenomics deemed unsustainable",
        "description": "The project is a \"decentralized naming protocol\" on the Solana blockchain, which is meant to streamline user interactions.",
        "url": "https://biztoc.com/x/9c12984c8d30268e",
        "source": "Biztoc.com",
        "publishedAt": "2025-05-13T18:38:18Z",
        "full_text": "Ukraine launched one of the largest drone assaults deep inside Russia, targeting 40+ strategic bombers and air bases, escalating the conflict just before peace talks.\n\nMarket Summary Markets reacted sharply to U.S. tariff hikes, with Asian equities mostly lower while oil prices surged on OPEC+ production decisions. The CE 100 Index climbed 1.7% led by AI stocks, while Dow futures slipped amid tariff worries. Investors remain cautious ahead of mixed economic data and Fed rate cut signals.\n\nFigure of the Day 50% - U.S. steel tariff hike announced by President Trump, doubling previous rates.\n\nNawrocki Clinches Polish Presidency Amid EU Tensions Polish Election Too Close to Call as Runoff Nears Polish presidential election results fuel political tension in Europe, with right-wing Nawrocki narrowly winning and potential impacts on EU relations.\n\nBullish CE 100 Index Rallies 1.7% as AI Stocks Lead Market Recovery Investor enthusiasm for artificial intelligence drives a 1.7% gain in the CE 100 Index, signaling renewed confidence in tech innovation amid trade uncertainties. More on pymnts.com\n\nBearish Trump’s Steel Tariff Hike Sparks Global Market Turmoil Doubling U.S. steel tariffs to 50% rattles Asia-Pacific markets, triggers commodity price jumps, and fuels trade tensions worldwide. More on breakingthenews.net\n\nFBI Probes Targeted Terror Attack in Boulder, Colorado Multiple Injured in Targeted Colorado Attack; Suspect Held Political unrest and terror attacks shake the US, with a targeted terror attack in Boulder, Colorado drawing FBI and White House attention.\n\nRegulatory Impact The Trump administration announces a doubling of steel and aluminum tariffs to 50%, maintains assertive trade policies amid ongoing U.S.-China tensions, and signals regulatory tightening on international tech and defense sectors.\n\nChina Blasts US for Breaking Geneva Trade Deal China Vows Forceful Measures Over US Trade Violations US-China trade tensions persist as China accuses the US of violating trade agreements, escalating diplomatic friction over tech and tariffs.\n\nQuote Inflation fears are alarmist; the U.S. will never default on its debt.\n\n— Treasury Secretary Scott Bessent\n\nTreasury’s Bessent Insists US Will Never Default Bessent Challenges Inflation Alarmism, Defends Trade Tariffs Treasury Secretary Scott Bessent reassures markets claiming US will never default amid ongoing debt ceiling negotiations and tariff disputes.\n\nPoland Swings Right as Nationalist Nawrocki Wins Presidency Poland Exit Polls Show Trump-Backed Candidate Narrowly Ahead European political shifts mark the rise of nationalist leadership in Poland and concerns over future directions within the EU.\n\nUber Exec Details AI Tools Powering Workplace Productivity Anthropic AI Startup Hits Reported $3 Billion Revenue Milestone Tech industry advances AI at work and consumer level, with big names experimenting while debates over AI ethics and productivity continue."
    }
]