[
    {
        "id": "1gx2mue",
        "title": "Has anyone had success with the Cloud computing degree with no prior experience?",
        "subreddit": "WGU",
        "score": 5,
        "created_utc": "2024-11-22T07:43:48+00:00",
        "url": "https://www.reddit.com/r/WGU/comments/1gx2mue/has_anyone_had_success_with_the_cloud_computing/",
        "permalink": "https://reddit.com/r/WGU/comments/1gx2mue/has_anyone_had_success_with_the_cloud_computing/",
        "selftext": "Basically the title, I'm debating between getting the general IT degree vs the cloud computing degree.\n\nI know cloud jobs aren't typically entry level however, I still want to know how bad the market is for any junior roles in cloud. \n\nI was also thinking that if I did do the cloud degree, it wouldn't hinder my chances at getting a help desk role or anything similar seeing as how you still have to complete the comptia trifecta to get the degree in the first place, what do you guys thing?"
    },
    {
        "id": "1e4e8x4",
        "title": "How to Start a Career in Cloud Computing please help me out ",
        "subreddit": "developersIndia",
        "score": 27,
        "created_utc": "2024-07-16T03:10:05+00:00",
        "url": "https://www.reddit.com/r/developersIndia/comments/1e4e8x4/how_to_start_a_career_in_cloud_computing_please/",
        "permalink": "https://reddit.com/r/developersIndia/comments/1e4e8x4/how_to_start_a_career_in_cloud_computing_please/",
        "selftext": "Hey there I've just started learning about cloud computing and I'm really excited about the future prospects. I want to dive into it with interest. Can you guys please suggest whether I should start with AWS, GCP, or Azure? And also, what's a good roadmap to become a cloud engineer?"
    },
    {
        "id": "1c5v0z6",
        "title": "Is Cloud Computing oversaturated yet?",
        "subreddit": "it",
        "score": 21,
        "created_utc": "2024-04-16T23:39:56+00:00",
        "url": "https://www.reddit.com/r/it/comments/1c5v0z6/is_cloud_computing_oversaturated_yet/",
        "permalink": "https://reddit.com/r/it/comments/1c5v0z6/is_cloud_computing_oversaturated_yet/",
        "selftext": "I’m a senior in high school and idk if it’s just TikTok getting to me but people are saying that IT jobs are getting oversaturated and aren’t in demand anymore. However, I haven’t seen anything about Cloud Computing. Is it still something I should go for or pick something else to major?"
    },
    {
        "id": "13ll1hy",
        "title": "Cloud Computing Success Stories.>><<",
        "subreddit": "WGU",
        "score": 48,
        "created_utc": "2023-05-19T04:35:07+00:00",
        "url": "https://www.reddit.com/r/WGU/comments/13ll1hy/cloud_computing_success_stories/",
        "permalink": "https://reddit.com/r/WGU/comments/13ll1hy/cloud_computing_success_stories/",
        "selftext": "Any success stories from the cloud computing program ... i.e. new jobs or promotions, or career changes. Was thinking about this program and just wanted some feedback from former students."
    },
    {
        "id": "1665fks",
        "title": "Is a BS in Cloud Computing worth it?",
        "subreddit": "WGU",
        "score": 0,
        "created_utc": "2023-08-31T08:39:02+00:00",
        "url": "https://www.reddit.com/r/WGU/comments/1665fks/is_a_bs_in_cloud_computing_worth_it/",
        "permalink": "https://reddit.com/r/WGU/comments/1665fks/is_a_bs_in_cloud_computing_worth_it/",
        "selftext": "Edit/update: im a whole lot better, seeing things as they are and not just in numbers, all because of the support of people here. You guys are BOMB! \n\nxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx\n\nI'm having doubts here honestly,,,, can someone help me out with this? Because how many cloud personnel would an organization have the need for? Help please.\n\nEDIT: just a few points i forgot to mention. i love the entire concept and the courses offered in Cloud Computing.Im literally loving it......and then suddenly last night i went to the WGU page( not the student portal- the homepage) and started checking out the courses again (I do weird stuff like that)....and found that according to the bureau of labor stats, cc has been predicted an overall growth for the field at 3% !!! from 2021-2031 , for the entire decade, 3%. THREE PERCENT!! and this was right under the courses and everything towards the bottom at the WGU site. Please let me know what do you all think, I am open to anything, any example of you your friend, any counsellor at WGU that i can speak with or so, or anything in favor of the degree, ANYTHING is welcome (except judgements without understanding what the post is about) I checked the other Bachelors in IT degrees just for comparison, Cloud Computing is the lowest! here's an image, I've been so effing disheartened. PS: Just a small side note, i know the \"do what you love\" thing, but here I want to balance my passion and applying my passion pragmatically and taking it further, ( like a sweet spot between emotional and practical. )"
    },
    {
        "id": "7qc055",
        "title": "What exactly is cloud computing?",
        "subreddit": "cloudcomputing",
        "score": 18,
        "created_utc": "2018-01-14T14:06:58+00:00",
        "url": "https://www.reddit.com/r/cloudcomputing/comments/7qc055/what_exactly_is_cloud_computing/",
        "permalink": "https://reddit.com/r/cloudcomputing/comments/7qc055/what_exactly_is_cloud_computing/",
        "selftext": "Is this idea that I have correct: Cloud computing is a place in some company that is offering cloud computing where it has some servers there that are shared among applications that are subscribed to this cloud.\n\nFor example BAAS, uses cloud computing where the company example google offers some services like push notification/storage/database instead of the programmer using his own server and writing his own server code.\n\nIs this right?"
    },
    {
        "id": "10bdp0k",
        "title": "Is cloud computing a good pick for someone new to the IT world?",
        "subreddit": "WGU",
        "score": 9,
        "created_utc": "2023-01-14T03:03:31+00:00",
        "url": "https://www.reddit.com/r/WGU/comments/10bdp0k/is_cloud_computing_a_good_pick_for_someone_new_to/",
        "permalink": "https://reddit.com/r/WGU/comments/10bdp0k/is_cloud_computing_a_good_pick_for_someone_new_to/",
        "selftext": ""
    },
    {
        "id": "1drnd3a",
        "title": "B.S. Cloud Computing: Is it Beginner Friendly?",
        "subreddit": "WGU",
        "score": 5,
        "created_utc": "2024-06-29T22:57:01+00:00",
        "url": "https://www.reddit.com/r/WGU/comments/1drnd3a/bs_cloud_computing_is_it_beginner_friendly/",
        "permalink": "https://reddit.com/r/WGU/comments/1drnd3a/bs_cloud_computing_is_it_beginner_friendly/",
        "selftext": "Hello Everyone,\n\nI am interested in getting a B.S. in cloud computing from WGU. I have some experience with very basic Linux/Python and a bit of computational chemistry research under my belt. Essentially, I know I am interested in cloud computing, but I will be starting from ground zero. I want to make sure I have a good foundation in any necessary programming languages by the time I graduate. Is this program beginner friendly? Should I start with a C.S. certificate first?\n\nThank you!\n\nUpdate: Thank you, all, for sharing your insights on the cloud computing program. I appreciate your realistic perspectives on the level of hard work and commitment needed to succeed. Your advice has been incredibly helpful, and I'm looking forward to applying it as I plan my learning journey. "
    },
    {
        "id": "1c6wk9m",
        "title": "Google called police on their own employees for protesting their $1.2 billion cloud computing + AI contract with Israel/IDF",
        "subreddit": "TikTokCringe",
        "score": 26389,
        "created_utc": "2024-04-18T06:32:51+00:00",
        "url": "https://v.redd.it/zxkuj375n6vc1",
        "permalink": "https://reddit.com/r/TikTokCringe/comments/1c6wk9m/google_called_police_on_their_own_employees_for/",
        "selftext": ""
    },
    {
        "id": "1d6gpql",
        "title": "The \"cloud\" is just somebody else's computer",
        "subreddit": "NonPoliticalTwitter",
        "score": 52936,
        "created_utc": "2024-06-02T16:09:42+00:00",
        "url": "https://i.redd.it/sopkruo5n64d1.png",
        "permalink": "https://reddit.com/r/NonPoliticalTwitter/comments/1d6gpql/the_cloud_is_just_somebody_elses_computer/",
        "selftext": ""
    }
]