[
    {
        "title": "Trump’s media company says it’s buying $2.5 billion in Bitcoin",
        "description": "President Donald Trump’s media company could soon own $2.5 billion in Bitcoin. On Tuesday, Trump Media announced that it’s working with “approximately 50 institutional investors” to sell and issue $1.5 billion in stock and $1 billion in convertible notes. The…",
        "url": "https://www.theverge.com/news/674684/trump-media-bitcoin-treasury-deal",
        "source": "The Verge",
        "publishedAt": "2025-05-27T14:31:48Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nPresident Donald Trump’s media company could soon own $2.5 billion in Bitcoin. On Tuesday, Trump Media announced that it’s working with “approximately 50 institutional investors” to sell and issue $1.5 billion in stock and $1 billion in convertible notes. The company, which operates Truth Social among other services, will be used to establish a large holding of Bitcoin.\n\nTrump Media says Crypto.com and the crypto banking platform Anchorage Digital will provide custody services for the company’s Bitcoin treasury.\n\n”We view Bitcoin as an apex instrument of financial freedom, and now Trump Media will hold cryptocurrency as a crucial part of our assets,” Trump Media CEO Devin Nunes said in the press release. “Our first acquisition of a crown jewel asset, this investment will help defend our Company against harassment and discrimination by financial institutions.”\n\nTrump Media announced a fintech subsidiary named Truth.fi earlier this year, and the Trump family is behind crypto startup World Liberty Financial, which has collected millions in deals The New York Times concluded “eviscerated the boundary between private enterprise and government policy.”"
    },
    {
        "title": "A startup that helps you copy influencers' stock trades just raised $30 million. Read its pitch deck.",
        "description": "Dub, a fintech startup, raised $30 million in Series A funding to expand its platform, which helps users copy stock trades from financial influencers.",
        "url": "https://www.businessinsider.com/pitch-deck-fintech-finance-influencer-startup-dub-raises-30-million-2025-4",
        "source": "Business Insider",
        "publishedAt": "2025-05-01T13:18:16Z",
        "full_text": "lighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nHave an account? Log in .\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThere's a new app that helps you copy stock trades from your favorite financial influencers and other investors.\n\nDub, launched last year, lets users track trades from finance influencers and notable investors through a subscription-based model.\n\nIn April, Dub raised $30 million in Series A funding from investors including Notable Capital to scale the platform and expand its features.\n\nCEO and founder Steven Wang said the idea for Dub came after he witnessed a generational shift in how people invest, he told Business Insider. For some, community, personalities, and social influence drive investing decisions rather than traditional financial metrics.\n\n\"All of my product decisions these days are driven and influenced by what influencers and creators are telling me, so, at the end of the day, we're just bringing that to investing,\" Wang said.\n\nPersonal finance is a popular category on social media. Some finance influencers have gained large followings for tips and advice on navigating tariffs and a shaky stock market.\n\nWith Dub's creator program, investors can monetize their investment insights. The platform pays those accepted into its creator program who let users track their trades on the app.\n\nCreators must open a brokerage account with Dub and create a portfolio on the app for others to see.\n\nAnyone can become a creator, but to monetize and make money when people start \"copy trading\" your portfolio, as Dub calls it, you must meet a minimum set of metrics to be accepted into Dub's top creator program. Once accepted, Dub pays creators royalty fees. The percentage varies based on the number of portfolio copies and how well the portfolio is performing, the company said.\n\nThe platform charges users a $9.99 monthly subscription fee to use the app. Dub plans to offer a free version sometime this year. That tier would allow users to make free copy-trades, but they'd still have to pay to copy certain creators.\n\n\"You can either be the copier that decides to take, let's say $10 to copy someone else's trades, and all future trades are copied automatically, or you can be the creator for other people to copy,\" Wang said.\n\nThere are other copy-trade platforms, like eToro and AvaTrade, but Dub said it's setting itself apart by owning a brokerage.\n\nThe company is registered with the Securities and Exchange Commission. Users don't have to link to another account to use Dub; they can deposit money directly into the app.\n\nRead the 15-page pitch deck Dub used to raise its Series A funding:"
    },
    {
        "title": "Coinbase's $3B Deribit move marks 'new era' for crypto M&A",
        "description": "Coinbase (COIN) is making waves with a $2.9 billion deal to acquire crypto options platform Deribit. Citi fintech analyst Peter Christiansen joins Catalysts ...",
        "url": "https://finance.yahoo.com/video/coinbases-3b-deribit-move-marks-180723670.html",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-05-09T18:07:23Z",
        "full_text": "00:00 Speaker A\n\nTalk to me about this deal from Coinbase and and how you rate it. Do you think that this was the right move?\n\n00:08 Speaker B\n\nAbsolutely. And and thank you, Madison. Great to be great to be here. Uh, I think part of Coinbase's mission is really to scale its liquidity. At the end of the day, it comes down to liquidity, um, and because that's going to be able to to draw in more capital and and have the lower lower fees and and certainly access points. And derbit is is clearly a pathway towards that competitive advantage. Uh, first, it gives them more of a and an international footprint, that's something that Coinbase has been working hard on on delivering. And then additionally it enhances their derivatives, um, capabilities for sure. On top of 800, 800 billion of of futures volume, they now add a potential of, um, roughly a trillion dollars in options volume on top of that. So it's really helped them on the institutional side.\n\n02:25 Speaker A\n\nAnd and what does it signal to you more broadly about M&A specifically within digital currencies?\n\n02:35 Speaker B\n\nYeah, it's been interesting. There's been a lot of activity and we we hear of things uh, constantly. Um, I think we're entering a new era for the crypto industry. Um, it'll be really interesting to see if traditional finance and crypto native firms come together. Uh, and also just from the crypto native side, how these companies scale. Uh, I think there'll be a lot of competition, which I think will be good for the sector, but certainly a lot of opportunities. We do believe, and we've written extensively on this, that there will be a lot more public companies, uh, in uh, crypto native public companies to come out. And and in our dealings and speaking with a lot of them, is they don't necessarily need the money. What they really do is crave legitimacy. And they believe that Coinbase has had a bit of an unfair advantage, being a public company, having publicly disclosed financials and CEO and CFO attestation. So, uh, I think a lot of crypto native firms want to close that competitive gap versus Coinbase."
    },
    {
        "title": "Klarna Pivots Back To Humans After AI Experiment Fails",
        "description": "Fintech startup Klarna is now recruiting humans after its AI customer service agents underperformed. The buy-now-pay-later company, which eliminated its marketing contracts in 2023 and customer service team in 2024, now plans an \"Uber-type setup\" with remote …",
        "url": "https://slashdot.org/story/25/05/14/2339257/klarna-pivots-back-to-humans-after-ai-experiment-fails",
        "source": "Slashdot.org",
        "publishedAt": "2025-05-15T05:30:00Z",
        "full_text": "Want to read Slashdot from your mobile device? Point it at m.slashdot.org and keep reading!"
    },
    {
        "title": "Klarna's Losses Widen After More Consumers Fail To Repay Loans",
        "description": "Klarna's net loss more than doubled in the first quarter [non-paywalled link] as more consumers failed to repay loans from the Swedish \"buy now, pay later\" lender as concerns rose about the financial health of US consumers. Financial Times: The fintech, which…",
        "url": "https://news.slashdot.org/story/25/05/20/096258/klarnas-losses-widen-after-more-consumers-fail-to-repay-loans",
        "source": "Slashdot.org",
        "publishedAt": "2025-05-20T10:00:00Z",
        "full_text": "Klarna's net loss more than doubled in the first quarter non-paywalled link ] as more consumers failed to repay loans from the Swedish \"buy now, pay later\" lender as concerns rose about the financial health of US consumers. Financial Times:"
    },
    {
        "title": "Curve Pay Launches iPhone NFC Payments as Apple Pay Alternative",
        "description": "British fintech company Curve has launched contactless payments for iPhone users in the European Union, becoming the second third-party payment service after PayPal to take advantage of Apple's newly opened NFC interface (via iphone-ticker.de).\n\n\n\n\n\nThe Curve…",
        "url": "https://www.macrumors.com/2025/05/23/curve-pay-launches-iphone-nfc-payments/",
        "source": "MacRumors",
        "publishedAt": "2025-05-23T11:44:56Z",
        "full_text": "British fintech company Curve has launched contactless payments for iPhone users in the European Union, becoming the second third-party payment service after PayPal to take advantage of Apple's newly opened NFC interface (via iphone-ticker.de).\n\n\n\nThe Curve Pay app allows users to make tap-to-pay purchases without using Apple Pay or the Wallet app, following PayPal's debut of similar functionality in Germany earlier this month. The feature was made possible by Europe's Digital Markets Act, which forced Apple to open its NFC chip to third-party developers.\n\nUnlike traditional wallet apps, Curve Pay operates as an independent payment authority rather than simply passing through stored card data. Users can reassign purchases to different cards after completing transactions and link various payment sources including PayPal accounts.\n\nThe app also provides real-time spending analytics and automated cashback programs. Its \"staged wallet\" architecture also gives users more control over the payment process compared to conventional digital wallets.\n\nCurve claims more than six million users across its platform, which was previously available only on Android devices. The company joins PayPal in offering European iPhone users alternatives to Apple Pay, with German cooperative banks also planning to introduce their own NFC payment solution through their banking app this September.\n\nNFC access is available for banking and wallet apps in the European Economic Area, which includes the 27 European Union countries plus Iceland, Liechtenstein, and Norway."
    },
    {
        "title": "The CEO of $6 billion payments company Airwallex says he made 3 mistakes in the early days of the company",
        "description": "\"I hired the first 100 people in Airwallex by myself on LinkedIn,\" Jack Zhang said of his first mistake.",
        "url": "https://www.businessinsider.com/airwallex-ceo-leadership-mistakes-scaling-jack-zhang-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-27T08:27:49Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe CEO of Tencent and Sequoia-backed payments startup Airwallex said that if he had to start over, there are three things he would do differently.\n\nJack Zhang said his mistakes include not outsourcing to a good recruiter in the early days, expanding overseas too quickly, and not prioritizing company culture. The Airwallex cofounder and CEO spoke on an episode of the \"20VC\" podcast aired on Monday.\n\n\"I hired the first 100 people in Airwallex by myself on LinkedIn,\" Zhang said of his first mistake. \"Obviously, there's a lot of benefit of doing that, but I could have hired a good recruiter just to help me to do the outreach and then give them access to my LinkedIn password.\"\n\nZhang cofounded Airwallex with four friends in Melbourne in 2015. The Singapore-based fintech company provides cross-border payments and financial services through its banking network and protocols that allow different software components to communicate with each other.\n\nLast week, the company announced that it raised $300 million in a series F funding round at a valuation of $6.2 billion.\n\nZhang said that his second mistake was that Airwallex overinvested in international expansion without having a product-market fit. He said the company got lucky, but doing this carried a lot of risk.\n\nThe CEO said the last thing he would change would be investing in company culture early.\n\n\"In the early first four, five years, we hired a lot of people with a lot of great experience — they're from a bank, they're from Citibank, they've built a Swift network before,\" he said. \"They join, they're telling you, 'you guys know nothing, what you're going to do doesn't work.' None of those people worked.\"\n\nHe said that experience matters less than other characteristics.\n\n\"We should just have hired those curious, determined, optimistic people from early on,\" Zhang said. \"But we didn't, so we had to fire all of them,\" he added, speaking of his challenging early hires.\n\nZhang is among tech CEOs who have looked back on their companies' early days and said they waited too long before delegating.\n\nEarlier this month, Luis von Ahn, the cofounder and CEO of language-learning app Duolingo, said that he micromanaged 50 employees in the early days of the company. He said he only learned to spread the responsibility once it became \"impossible\" to manage that many people.\n\n\"At this point, I also have learned that most of my job is culture carrier, mascot, and just making some of the kind of tough philosophical decisions,\" von Ahn said in a talk at Stanford University.\n\n\"Two of my executive team are sitting here — head of people and head of finance. I am neither good at those things nor do I get energy from them, so they have all the freedom in the world,\" he said.\n\nMicrosoft's former CEO, Bill Gates, is also outspoken about delegation and how he learned that he could not be involved with every project or team member as the company grew.\n\n\"I had always been the taskmaster, the one who incessantly worried about losing our lead, and fearing that if we weren't careful, we'd be sunk,\" Gates wrote in his memoir."
    },
    {
        "title": "Bat VC launches $100 million fund to back US and Indian AI startups",
        "description": "Bat VC sees big opportunity in India's tech sector, and has launched a $100 million fund targeting early-stage AI startups in the US and India.",
        "url": "https://www.businessinsider.com/bat-vc-launches-fund-indian-us-ai-startups-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-13T12:18:25Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nA VC firm that plans to back buzzy early-stage AI startups across the US and India has just launched a second fund with a target close of $100 million.\n\nNew York-headquartered Bat VC, founded by a trio of Indian tech veterans from Yahoo, Twitter India, and Intuit, is currently raising its second fund. It aims to back early-stage startups predominantly in the AI, fintech, and enterprise sectors, cutting checks of $3 million to $5 million.\n\nThe VC firm has made a strategic decision to back startups across India and the US — two markets it sees teeming with potential for startups to bilaterally scale, particularly as the US and China remain in a trade war.\n\nBat VC's managing director and general partner, Aditya Mishra, said Fund 2 serves as a follow-on pot for the firm's first fund, a $8.2 million vehicle that is on track for a 29% internal rate of return and has two exits so far.\n\n\"We look at early-stage from the lens of whether startups have achieved product market fit,\" Mishra told Business Insider. \"You could have a very strong team, but you may be lacking the sales and the go-to-market skill set, or you may not have a good team technically, but you are pretty good at selling whatever you have.\"\n\nBat VC is still fundraising for the first close of its second fund and is in talks with over 10 limited partners, including institutional LPs, family offices, fund of funds, and high-net-worth individuals, Mishra told BI.\n\nA global trade shift is spurring more VC interest in India\n\nWhile US startups rake in the most VC funding globally, India is experiencing a startup boom. As of January, the country reported having over 159,000 recognized startups and credited them with creating about 1.7 million direct jobs since 2016, according to India's Ministry of Commerce and Industry.\n\nThe country is increasingly a hotbed for Big Tech operations. Apple produced $22 billion worth of iPhones in India in the 12 months preceding March as the tech giant pivots its manufacturing base away from China, while Meta is in talks to set up its first data center in India.\n\nThere's also a growing trend of reverse brain drain. Encouraged by India's growth and market size, Indian expats who moved to the US to work in Big Tech are leaving hefty paychecks behind to return home and build consumer and fintech startups.\n\nAlthough the trade war between the US and China is facing a 90-day reprieve, the uncertainty could make India a more attractive alternative choice for investors seeking tech talent and opportunities to scale their startups in software-savvy markets.\n\nAll of this has created fertile conditions for tech innovation in India, particularly in AI, said Ravi Metta, Bat VC's US head and general partner.\n\n\"Because of the AI resurgence, companies across the world are pushing more work into India,\" he said. \"What's going to happen because of that is that more and more people in India will start becoming entrepreneurs, building these global companies using AI.\"\n\nSupply chain constraints could also lead to more Big Tech companies setting up in India, and leaning on AI to carry out work in areas like logistics, Mishra told BI, adding that this could lead to more robotics and manufacturing innovation in the country.\n\nManish Maheshwari, Bat VC's India head and general partner, told BI that many US founders may want to access India, particularly for enterprise software, and compared it to the US-Israel corridor, but with the potential to be \"10 times bigger.\"\n\nAs the US seeks more economic ties to alternative manufacturing hubs in Asia, India's bilateral relationship with the US is \"going to be an order of magnitude higher,\" he added. \"So that is where India also has an advantage.\""
    },
    {
        "title": "Dutch startup ecosystem grows 26% but falls to 6th in Europe",
        "description": "The Dutch startup ecosystem has slipped to 10th place globally and sixth in Europe, according to the newly released Global Startup Ecosystem Index 2025.  The annual report, compiled by research platform StartupBlink, benchmarks the startup strength of over 1,…",
        "url": "https://thenextweb.com/news/dutch-startup-ecosystem-falls-in-europe",
        "source": "The Next Web",
        "publishedAt": "2025-05-19T22:00:19Z",
        "full_text": "The Dutch startup ecosystem has slipped to 10th place globally and sixth in Europe, according to the newly released Global Startup Ecosystem Index 2025.\n\nThe annual report, compiled by research platform StartupBlink, benchmarks the startup strength of over 1,400 cities and 110 countries worldwide.\n\nThe US took the top spot globally, with the UK coming in second. Among the European nations, Britain was followed by Sweden (sixth), Germany (seventh), and France (eighth). Switzerland claimed ninth place, pushing the Netherlands down one spot.\n\nHowever, it’s not all bad news for the Dutch startup ecosystem, which saw an above-average growth rate of over 26% this year.\n\nThe country’s top-performing sector was ecommerce and retail, where it ranks fifth globally and first in the EU. Prominent companies in this space include grocery delivery unicorn Picnic, designer brand marketplace Otrium, and fresh food platform Crisp.\n\nThe 💜 of EU tech The latest rumblings from the EU tech scene, a story from our wise ol' founder Boris, and some questionable AI art. It's free, every week, in your inbox. Sign up now!\n\nHowever, the Netherlands’ overall growth was outpaced in Europe by France, Sweden, and Switzerland — all of which grew by over 30% this year.\n\nAmsterdam holds steady\n\nOn the city scale, Amsterdam remains the undisputed engine of the Dutch tech scene. The capital rose two global spots to 26th and held firm at fifth in Europe — trailing only London, Paris, Berlin, and Stockholm. It performed best in fintech, where it now ranks 15th worldwide and third in the EU, with scaleups like neobank Bunq and payments platform Mollie playing a central role.\n\n“A key trend we observe in the Netherlands is Amsterdam’s rapid growth, with its startup ecosystem expanding by over 30% in 2025,” Eli David Rokah, CEO at StartupBlink, told TNW. “While the city remains fifth in Europe and fourth in the EU, this strong momentum is helping it close the gap with top-tier European ecosystems like Stockholm and Berlin.”\n\nOutside the capital, the national picture is more mixed.\n\nWhile Amsterdam remains the standout Dutch ecosystem globally, four more cities in the Netherlands entered the top 1000 this year (up from 20 the previous year ). That’s the highest-ever city count in this index.\n\nRotterdam is the big riser, overtaking Utrecht to claim the number four spot among Dutch cities. It also scored the highest growth rate in the country (over 50%) and climbed 30 positions globally in just two years.\n\nEindhoven, meanwhile, slipped two spots to 106th globally but posted a standout result in sustainability, ranking 10th worldwide.\n\nSupporting Dutch tech is a key mission of TNW Conference, which takes place on June 19-20 in Amsterdam. Tickets are now on sale — use the code TNWXMEDIA2025 at the checkout to get 30% off."
    },
    {
        "title": "Here are the 8 programming languages to know to land a tech job on Wall Street",
        "description": "Not all coding languages are made equal — some hold more weight in certain areas of finance than others.",
        "url": "https://www.businessinsider.com/top-programming-languages-work-wall-street-jobs",
        "source": "Business Insider",
        "publishedAt": "2025-05-26T08:48:01Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nBig Tech firms like Apple and Amazon have signaled a move away from the complicated coding language C++, but there's still a place for engineers who know it on Wall Street.\n\nApple created Swift to replace its use of C++, the company's primary coding language for its devices. Amazon recently awarded a Stony Brook University professor an approximate $100,000 research grant to continue his work to automate converting existing C++ code to Rust, a coding language created in 2006. Even the White House has joined the conversation around C++, urging software developers to move away from the language due to cybersecurity concerns in a report last year.\n\nBut the financial space is still \"one of the heavy users of C++ that's really doing cutting-edge stuff,\" one industry executive told Business Insider. High-frequency trading firms and exchanges rely on C++, a notoriously complicated language that can offer more control over the underlying hardware.\n\nCitadel Securities, for one, hired a C++ expert Herb Sutter from Microsoft to lead training initiatives on the language and is already embracing a new version of C++ that has yet to be released. Looking at current open technology positions, trading firms Virtu Financial and Hudson River Trading are among the firms also seeking out C++ experience.\n\n\n\nWhen asked how prospective hires could demonstrate their C++ skills in a separate interview, Citadel's Sutter said they should talk about what they're looking forward to most in the newer version, C++26, to show their curiosity.\n\n\"It's important to be able to demonstrate curiosity and knowledge about software advancements — and to show that you understand that there's more than one tool out there and that you know how to use them together,\" he said.\n\nIn today's machine-to-machine world, having some experience with programming languages is a must. Coding languages, like Python and Java, are how humans can communicate with computers by providing a set of instructions for a system to execute. As it turns out, not all programming languages are made equal and some are more relevant to certain corners of Wall Street than others.\n\nBusiness Insider has compiled a list of the most-used coding languages through conversations with recruiters, Wall Street tech execs, and industry insiders. We also analyzed job postings to learn about in-demand skill sets.\n\n\n\nHere are the programming languages to know:"
    },
    {
        "title": "A personal finance expert saw her friends leaving 'tens of thousands' on the table with money mistakes — but it wasn't their $5-a-day coffees",
        "description": "Young professionals make costly financial mistakes by storing savings in low-interest accounts says Piere CEO Yuval Shuminer.",
        "url": "https://www.businessinsider.com/piere-ceo-on-optimizing-savings-avoiding-financial-mistakes-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-06T11:00:49Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nYoung professionals are leaving thousands of dollars of their hard-earned money on the table, a personal finance expert says.\n\nBut, she said, their money mistakes have nothing to do with their daily purchases.\n\nAs a New Yorker, Yuval Shuminer, the founder and CEO of the fintech app Piere, was used to expensive coffees and brunches.\n\n\"It is an absurdly expensive city,\" Shuminer told Business Insider. \"As you go about day-to-day life, you start to rack up a lot of these expenses across coffee that costs $7, an avocado toast that costs $12.\"\n\nBut in 2022, when the economy started to turn, Shuminer saw some of her friends get laid off and look at their finances more critically.\n\n\"The conclusion that we came to is that we're taking so much brainpower to think about the $5 that we spend on coffee every day,\" Shuminer said. \"It is so constricting to our lives.\"\n\nYoung professionals do make a lot of financial missteps. But the biggest one is holding their savings — sometimes tens of thousands of dollars — in accounts with 0.02% interest when market rates for high-yield savings accounts were more like 4.5%, said Shuminer.\n\n\"That alone is $10,000 they're leaving on the table,\" Shuminer said.\n\nShuminer, who studied behavioral economics, launched Piere in December 2023 in response to what she saw. She thought traditional budgeting apps focused too much on constraining spending rather than automating financial optimization. She realized that so many people weren't aware of how much money they could easily put in their pockets while instead focusing on these $5 purchases that shape their lifestyle.\n\n\"Instead of working with all these tools that focus on constraining people's budgets and limiting the amount that you're spending on these fun things, the way that we built Pierre is to say, those things are fine,\" Shuminer said. \"But if you're leaving your money in savings without earning yield on it, or you're paying fees that you shouldn't be paying, those are the things that aren't OK.\"\n\nPiere's ethos is to make your money work for you in the background, Shuminer said.\n\nMost of Piere's users are lower or middle class, Shuminer said, who didn't necessarily learn early on how to manage money.\n\n\"Consumers are just so overwhelmed with the financial choices that they have to make that oftentimes they just don't do them,\" Shuminer said. \"Because of inertia, because of anxiety, because of the frictions that they need to overcome in order to make some of these decisions.\"\n\nShe said Piere does the hard work for them, keeping track of the financial marketplace, which changes daily.\n\n\"Every single day, something is changing,\" Shuminer said, such as a new savings account with a better rate.\n\n\"Money is a tool — you're not collecting money just to collect money,\" she added. \"You're collecting money for it to create more value in your life so that you can allocate it to the things that are going to make you happier or better off.\"\n\nShuminer said the biggest financial oversight she sees people in their 20s making is not realizing the impact that even small investments can make.\n\n\"$10 a month, $100 a month, has a lot of compounding effect,\" she said, which can turn into a healthy savings pot by age 40, and certainly by 70.\n\n\"It's like it's some hidden secret that I think a lot of people realize when it's a little bit too late,\" Shuminer said. \"Our goal is to help people.\""
    },
    {
        "title": "I spoke with the CFOs of Vercel, Mercury, and Cribl about doing business in uncertain times",
        "description": "BI sat down this week with the CFOs of Mercury, Vercel, and Cribl, who shared how they are faring amid market uncertainty and IPO jitters.",
        "url": "https://www.businessinsider.com/late-stage-cfos-about-doing-business-in-uncertain-times-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-26T16:00:01Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nWith a shaky IPO market, tariff uncertainty, and stock market jitters, these are not easy times to be the chief financial officer of a late-stage tech company.\n\nAgainst that precarious backdrop, I sat down last week with the CFOs of Mercury, Vercel, and Cribl at the San Francisco office of CRV, one of Silicon Valley's oldest venture firms and an early investor in all three startups.\n\n\"I'm expecting a lot more uncertainty,\" said Daniel Kang, CFO of Mercury, a fintech banking startup that recently doubled its valuation to $3.5 billion after raising $300 million in its latest funding round. \"There's a lot of impact from what's happening in DC.\"\n\nAll the turmoil means CFOs have to be more nimble, said Kang.\n\nMarten Abrahamsen, Vercel's CFO, was more upbeat. He does not expect a recession this year and predicts a stock market rally in the fall.\n\n\"I think a lot of this is going to be fueled by some of the investments we see in AI, and we're already seeing it for some of our products that weren't even here a year ago,\" said Abrahamsen. \"I'm very, very bullish on the remainder of this year and beyond.\"\n\nAfter President Donald Trump announced sweeping tariffs on imports from other countries on April 2, investors panicked and companies from the payments lender Klarna to the physical therapy startup Hinge Health halted their IPO plans.\n\nThe pause turned out to be short-lived.\n\nMarkets have rebounded after Trump rolled back the most severe tariffs and he said he would not fire Federal Reserve Chair Jerome Powell. Bankers are telling companies to go public while the window is open.\n\nThis week, Hinge Health shares jumped 17% in its market debut after eToro, an Israeli trading platform, made a successful public debut on the Nasdaq, opening 34% above its IPO price. (Klarna's IPO is still on hold after the company reported mounting losses.)\n\nAbrahamsen does not think companies should wait until a better market comes along to IPO; instead, they should focus on what they can control.\n\n\"There has been a fear of going public in Silicon Valley,\" he said. \"Great companies can go public even if there's not a hot market out there. If you're an outstanding business, there's always going to be an opportunity.\"\n\nAsked why so few companies are going public, the panelists said companies do not want to deal with the headaches of being a public company when there is so much private financing available. There is also little pressure to IPO from investors and employees, according to Zachary Johnson, CFO of Cribl, a data management solutions startup that raised $319 million last year at a $3.5 billion valuation.\n\n\"They understand that we're trying to build something that's going to be generational,\" said Johnson. \"When we think about how we want to build this company, it's really about focusing on that durability and sustainability of growth.\"\n\nJohnson is hopeful that advances in AI can make Cribl even more attractive to investors when it goes public. He recently tasked everyone on his executive team to come up with an AI initiative.\n\n\"There's some work to be done, but I'm optimistic that we can actually get some real returns on that by the end of this year,\" he said. \"We're still in the early innings of AI.\""
    },
    {
        "title": "Latin American e-commerce and fintech giant MercadoLibre reports Q1 revenue up 37% YoY to $5.9B, $494M in net income, and Argentina revenue up 125% YoY to $1.3B (Daniel Cancel/Bloomberg)",
        "description": "Daniel Cancel / Bloomberg:\nLatin American e-commerce and fintech giant MercadoLibre reports Q1 revenue up 37% YoY to $5.9B, $494M in net income, and Argentina revenue up 125% YoY to $1.3B  —  E-commerce and fintech giant MercadoLibre Inc. beat analysts' expec…",
        "url": "https://www.techmeme.com/250508/p2",
        "source": "Techmeme.com",
        "publishedAt": "2025-05-08T05:10:02Z",
        "full_text": "— After weeks of rumors and an apparent delay, Samsung has just announced a May 12 launch event for the Galaxy S25 Edge and has opened reservations for the device."
    },
    {
        "title": "Wall Street's New Bitcoin Monster: Cantor's $4B Bet Could Dethrone Michael Saylor",
        "description": "Backed by Tether and SoftBank, Twenty One Capital is coming for Strategy's crypto crown -- and it's not playing small.",
        "url": "https://finance.yahoo.com/news/wall-streets-bitcoin-monster-cantors-181700343.html",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-05-08T18:17:00Z",
        "full_text": "Cantor Fitzgerald is going all in on Bitcoin (BTC-USD). Backed by stablecoin giant Tether Holdings SA and SoftBank Group, the firm just launched Twenty One Capital a bold crypto venture designed to rival Strategy (NASDAQ:MSTR) (formerly MicroStrategy). It's not tiptoeing into the market either. The company is starting with a massive $4 billion in Bitcoin on its balance sheet, instantly making it the third-largest corporate Bitcoin treasury in the world. But unlike Strategy's early lone-wolf play, Twenty One is entering with institutional firepower and a business model that goes beyond buying and holding.\n\nAnd that model? It's ambitious. The company's prospectus outlines plans for native lending models, capital market instruments, and future innovations that will replace legacy financial tools with Bitcoin-aligned alternatives, along with Bitcoin-focused content and media. In short, Twenty One wants to be more than just another Bitcoin proxy. As Mark Palmer, senior analyst at Benchmark, put it: It does have the backing of some large and influential players within the crypto space, which is not only going to enable the company to tap into those firms' resources, but also to make a much bigger splash in the market than it would have otherwise. Cantor's existing connections including managing Tether's reserves and holding its convertible bond only add to its firepower.\n\nStill, the race won't be easy. Strategy remains the king of Bitcoin treasuries, holding roughly $55 billion and planning to raise another $84 billion through equity and debt to buy more. Michael Saylor isn't worried though. It's auspicious, he said at a recent New York conference. It's good for the entire industry because it's generating positive awareness of the opportunity and it's very legitimizing to see these companies making big investments. I hope there are 10 more. But the market may be cooling on copycats. Wilfred Daye, CSO of Mercurity Fintech, warns: The market can become more sensitized to MicroStrategy's strategy shareholders get tired, pointing to GameStop's stock plunge after it announced plans to take on debt to buy Bitcoin. Twenty One has capital, partners, and momentum. Now it just needs to prove it's not another echo of a trade that's already been priced in.\n\nThis article first appeared on GuruFocus.\n\n"
    },
    {
        "title": "Coinbase's dizzying week before S&P 500 debut: What happened?",
        "description": "Coinbase (COIN) started the week announcing its upcoming debut on the S&P 500 (^GSPC), but it quickly soured after news of a major cybersecurity breach and...",
        "url": "https://finance.yahoo.com/video/coinbases-dizzying-week-p-500-212323277.html",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-05-16T21:23:23Z",
        "full_text": "00:00 Speaker A\n\nWanna take a look here at shares of Coinbase this week, as it began with the platform reaching a major milestone, announcing its addition to the S&P 500. But then, things took a turn for the worst yesterday when the company disclosed a significant cyber security breach, confirmed an ongoing SEC investigation regarding its past user metrics. Joining us now to break it all down, the latest is what he calls coins, no good, very bad day. That would be Mark Palmer, Benchmark Company managing director, senior research analyst of Fintech and digital assets. Uh, Mark, it's good to see you. So there is a lot to break down here, Mark. All right, so they're added to the SPX. That's a big achievement. It's a big milestone, but then, Mark, we have this headline-making hack. Let's maybe start there with the hack. I mean, your takeaways from that, Mark. How concerned should investors be about that?\n\n01:34 Mark Palmer\n\nYes. Uh, well, first of all, thanks very much for having me on. You know, the situation with Coinbase, uh, is really something of a one-off. You know, what we're talking about are, uh, consultants that were hired by the company, uh, for, uh, customer service, uh, abroad. And, uh, the cyber hackers, uh, in this case, uh, got a hold of these people and bribed them to provide them with access to Coinbase's platform. Uh, at which point they were able to access, uh, a lot of different materials about customers' backgrounds, but importantly, none of the login information, none of the, the private keys associated, uh, with crypto, uh, and, um, you know, none of the, um, uh, access to customer wallets. So, as a consequence of this, um, you know, there were no, uh, actual, um, you know, big amounts of money that were lifted off the platform, as you typically will see, uh, with some of these hacking incidents. With that said, um, you know, this is, it's always a concern when an exchange has a breach. Um, but management moved quickly. Uh, they came out with all of the information about what had happened, um, as fully as they could, uh, and they had a remediation plan in place, uh, which, uh, would ultimately help to compensate any of those who are impacted by this, um, you know, to the tune of between $180 and $400 million. Uh, so it's a bizarre story, uh, but, uh, it really didn't have anything to do, uh, with the various, uh, cyber security, uh, protection measures, uh, that the company has in place. This was really, uh, more of the real world type of, uh, incident that we're talking about here."
    },
    {
        "title": "Mercury's High Risk, High Rewards Strategy Runs into Regulatory Reality",
        "description": "Mercury CEO Personally Sought Exception for OnlyFans; Evolve's Bank Holding Company Appears To Be Insolvent",
        "url": "https://fintechbusinessweekly.substack.com/p/mercurys-high-risk-high-rewards-strategy",
        "source": "Substack.com",
        "publishedAt": "2025-05-30T19:40:05Z",
        "full_text": "Hey all, Jason here.\n\nI hope my U.S.-based readers are enjoying a long Memorial Day weekend! Sadly, I do not get Monday off.\n\nFor those heading to Amsterdam for Money2020 Europe in a couple of weeks, I plan to be onsite at the event on Wednesday, as well as attending Pipe’s happy hour on Monday, the Oscilar/This Week in Fintech event Wednesday, and hopefully swing by Finch Capital’s event Wednesday as well. If you’ll be in town and want try to catch up, drop me a line!\n\nCongrats to my friends at Gilgamesh Ventures on the news that they’ve raised a new $20 million fund — keep up the good work!\n\nAnd, finally, if your email client clips this post due to length, you can read the full thing on web here.\n\n💰 Help Keep Fintech Business Weekly accessible to all: in an era where it feels more difficult than ever to parse hype from reality, I've made a conscious decision not to paywall Fintech Business Weekly. But doing the research and analysis to bring you well-informed, deeply-reported stories takes time -- and money (really, you don't want to see my PACER bill, let alone my lawyer's.) Looking to get in front of Fintech Business Weekly's 85,000+ readers and listeners? Get in touch about sponsorship options: jason@fintechbusinessweekly.com To help keep Fintech Business weekly accessible to all, please consider upgrading to a paid subscription if you haven't already!\n\nSubscribe or Upgrade to Paid\n\nEvolve's Bank Holding Company Appears To Be Insolvent\n\nEvolve’s bank holding company, Evolve Bancorp, Inc., appears to be insolvent, based on paperwork it filed with the Federal Reserve in mid-February 2025 for the period ending December 31, 2024.\n\nA bank holding company is a corporate entity that owns a controlling interest in one or more banks, but does not itself offer banking services.\n\nThere are a variety of reasons why it can be advantageous to own a bank through a bank holding company, including that holding companies can typically raise capital more easily than their bank subsidiaries. A holding company may provide greater flexibility in managing capital, including through dividend payments and share repurchases. Holding companies can also own non-bank financial entities, like insurance or brokerage firms.\n\nFor 2024, Evolve’s holding company’s operating income consisted solely of about $1.5 million in dividends upstreamed from its bank entity. The holding company’s operating expenses were primarily composed of about $2.9 million in interest expenses on its debt.\n\nAs of the end of 2024, apart from the underlying equity it holds in the bank entity, Evolve’s holding company has just $37,000 in cash and about $2.5 million in other assets.\n\nMeanwhile, the holding company owes nearly $51 million in long-term borrowings, in part from 10-year notes the holding company issued in 2021 and 2022. The fixed-to-float notes, which have a total par value of $31.5 million, have a five-year call option and reset to SOFR plus 3.32% five years after issuance.\n\nThe consent order Evolve Bank and the holding company entered into in June 2024 prohibits either from paying dividends without prior regulatory approval.\n\nThat means that the holding company’s only real source of income, dividends paid by its bank subsidiary, have to be signed off on by the Federal Reserve — though, in Q1 2025, Evolve swung to a loss, meaning it would be unlikely to pay dividends even absent the restriction.\n\nLooking at the bank holding company’s limited assets, other than the equity in the bank subsidiary, vs. the nearly $51 million in outstanding debt, it appears as though it is currently insolvent.\n\nBank holding companies can file for bankruptcy, but doing so is quite rare. The failure of a bank holding company is nearly always tied to the failure of a bank subsidiary. Bank holding companies pose unique challenges in the bankruptcy processes, as was recently seen when Silicon Valley Bank failed and its holding company went through a Chapter 11 process.\n\nFurther back, in 2011, Americawest Bancorp, the bank holding company for AmericaWest Bank, went through a strategic Chapter 11 bankruptcy as part of an idiosyncratic recapitalization transaction in the wake of the 2008 global financial crisis.\n\nA representative for Evolve didn’t respond to an inquiry about the holding company’s financial condition or if it planned a capital raise for the holding company.\n\nAny capital raise would likely be substantially dilutive to existing shareholders, which include Evolve founder and former chairman Scot Lenoir and members of his family.\n\nMercury’s High Risk, High Rewards Strategy Runs Into Regulatory Reality\n\nKey takeaways:\n\nMercury cofounder and CEO Immad Akhund often characterized compliance as an obstacle to get around, multiple sources say.\n\nMercury customer Flipper Devices’ Russia links caught FDIC’s attention during Choice Bank exam.\n\nMercury CEO Akhund personally sought an exception to onboard “creator” app OnlyFans, commonly used by adult entertainers.\n\nConversations about Goldman Sachs becoming a bank partner were derailed by Goldman’s insistence on handling account onboarding.\n\nMercury’s “First Principles Thinking” Approach to Banking\n\nMercury and its very online cofounder and CEO Immad Akhund, like many in Silicon Valley, embrace the framework of “first principles” thinking, numerous people who have worked with him and the company have told me.\n\nThe approach, popularized by investors like Berkshire Hathaway’s Charlie Munger and tech heroes that include Elon Musk, is a problem solving and reasoning technique in which one decomposes a problem into its basic, fundamental components, and then searches for a solution by addressing each of those individual components, from the ground up, setting aside “traditional wisdom.”\n\nWhile first principles thinking can be a powerful mental model for approaching complex, difficult-to-solve problems, it is arguably less well suited to challenges that may defy logical solutions — which, yes, does include aspects of the financial, banking, and payments systems, especially due the United State’s idiosyncratic and, often, byzantine approach to regulation.\n\nSilicon Valley’s first principles and, to deploy the oft-used cliche, move fast and break things approaches have run up against and prevailed over seemingly arbitrary regulatory constraints in the other industries: Uber and Airbnb built their businesses by thumbing their noses at local municipal regulators and, eventually, were generally successful at lobbying to have their business models legitimized.\n\nThe disrupt first, ask questions later approach has been less successful in fintech, as evidenced by the plethora of banks getting enforcement actions related to their fintech partnerships and the catastrophic collapse of Mercury’s one-time partner Synapse, which has left depositors out of pocket as much as $95 million and still searching for answers.\n\nCan You Eliminate “Friction” Without Increasing Risk?\n\nFor Mercury, the goal has been to use first principles thinking to solve pain points traditionally associated with business banking, especially for newly formed companies, startups, and immigrant founders and to offer a polished, differentiated UX lacking in traditional banks’ platforms.\n\nThe company has sought to eliminate as much friction has possible, from account opening to sending payments and user permissions management — mundane but time-consuming tasks that even the most profitable big banks have done little to improve on in decades.\n\nBut, in financial services, reducing friction can lead to increasing risk — something that appears to have been the case with Mercury, as evidenced by the large number of foreign accounts it courted but later would need to remediate, its willingness to move quickly to scoop up accounts leaving SVB after its failure, its blindness to or tolerance of higher risk accounts like Moscow-incubated Flipper Devices, and Mercury CEO Akhund’s effort to personally secure a policy exception for adult content creator app OnlyFans.\n\nMercury offers the allure of “free,” charging no monthly fee and imposing no minimum balance requirements, which is typically not the case for business accounts at established banks. Mercury also offers free domestic and international wires and competitive foreign exchange rates, potentially significant savings for some firms, especially those operating internationally and across different currencies.\n\nAnd, it certainly would appear, that Mercury has built a better mousetrap, as evidenced by its rapid growth. The company announced it had raised $300 million in new funding in March 2025, saying at the time that it has over 200,000 customers on its platform.\n\nThe company didn’t specify the total amount of those customers’ deposits, though when Mercury announced its Series B, in July 2021, it said its bank partners, Evolve and Choice, held more than $4 billion in customer funds.\n\nThat had grown to an aggregate of nearly $11 billion in deposits as of Q1 2023, according to a copy of a fundraising pitch deck obtained and reviewed by Fintech Business Weekly.\n\nMercury pitch deck dated April 2023\n\nBut, unlike in true software businesses, extremely rapid growth is often a red flag in banking and payments — the businesses Mercury is ultimately in, whether it describes itself that way or not.\n\nAnd some of Mercury’s swift increase in its customers and deposits may have come from a willingness, whether intentional or not, to serve companies other U.S. banks would not or could not.\n\nIn the course of reporting this story, Fintech Business Weekly reviewed hundreds of internal documents and spoke to more than two dozen current and former employees of Mercury, its former middleware platform Synapse, and its bank partners Evolve Bank & Trust, Choice Bank, and Column.\n\nSources were granted anonymity given the sensitive nature of the topics being discussed and out of fear of retaliation.\n\nMercury Viewed Compliance As An Obstacle To Be Circumvented, According To Those Who Worked With and For The Company\n\n“Immad couldn’t care less about risk and compliance,” a source who worked with the Mercury CEO told me.\n\nInstead, Akhund’s top priority was “the pursuit of ultimate customer experience, at the expense of any minimum of compliance or risk management,” the person said.\n\nAnother person familiar with Mercury’s approach to compliance describe it as akin to “a fraternity that’s about to get kicked off campus.”\n\nInternally, Akhund often described compliance as a barrier to be overcome, coaching staff that, if they experienced a “compliance barrier” that was preventing them from being successful, to challenge it until they were able to overcome or get around it, people familiar with his thinking said.\n\nPerhaps no part of the customer journey is more important than the start: opening an account. Mercury has long emphasized the “frictionless” nature of its account opening process — something that for companies, especially recently formed entities, is often anything but fast.\n\nIn fact, Mercury specifically marketed itself to newly formed companies, paying sites like LLC University and Firstbase, which guide foreign actors through the process of setting up a U.S. company entity, to refer those new created companies to Mercury.\n\nMercury, until early 2024, allowed companies to open accounts using a registered agent address or P.O. Box to demonstrate they had legitimate business operations in the United States — a requirement most all U.S. banks have for businesses to open accounts — even when the companies were actually based largely or entirely overseas.\n\nA “Check the Box” Approach to Compliance\n\nTo facilitate a low-friction onboarding process, historically, Mercury would do little beyond a “check the box” exercise of collecting relevant documentation, but would rarely if ever undertake customer due diligence or enhanced due diligence, people familiar with Mercury’s processes said. For much of its existence, Mercury historically has lacked a framework to evaluate and assign a customer risk rating, instead formulating and using a customer’s “sickness” score (sick as in slang for cool) to inform what level and priority of support to give them, people familiar Mercury’s processes said.\n\nThe sources also said that the collection of documentation of companies’ ultimate beneficial owners, the shareholders or officers who actually controlled the companies’ accounts, was uneven at best, with Mercury often only collecting documentation on a single UBO, even when a company had more than one ultimate beneficial owner.\n\nThe combination of Mercury’s prioritization of the “ultimate customer experience” and strategy of targeting newly formed companies, often with foreign owners, predictably drove a flood of potentially higher-risk accounts.\n\nMore Than Half of Accounts at Choice and Evolve Based Outside the U.S., Sources Said\n\nAt the peak, more than 50% of Mercury accounts and deposits held at Evolve and Choice were largely if not entirely based outside of the U.S. — and that Evolve and Choice weren’t even aware of this at the time, people familiar with the situation said.\n\nRepresentatives for Evolve and Choice Bank did not respond to questions about the provenance of accounts and deposits in the Mercury-linked account at their institutions.\n\nAn analysis of Mercury accounts at Evolve, based on data as of October 2022 that was released in the Russia-linked hack of the bank, revealed that more than 13,000 accounts, comprising nearly 20% of Mercury accounts at Evolve, used the same five registered agent addresses.\n\nA closer examination of those accounts revealed a material number that had obvious indicators, including phone numbers and IP address, associated with them that demonstrated links to higher-risk jurisdictions, like the United Arab Emirates, Pakistan, and Russia.\n\nAlthough Mercury accounts at Evolve listed addresses in Wyoming, Delaware, and California, they indicators they were actually based in Pakistan, the UAE, and Russia.\n\nAn analysis of those accounts with commercially available business identity and risk tools revealed possible sanctions hits for eight companies out of 136 that were screened. While two appeared to be likely false positives, nonetheless, the possible OFAC hits would require additional investigation to remediate.\n\nIt’s not clear whether or not Mercury screened and, as necessary, remediated any alerts prior to opening accounts for these companies.\n\nMercury’s Homegrown Transaction Monitoring System Raised Concerns\n\nThe emphasis on a frictionless experience went beyond onboarding and included the goal of making payments, including international transfers, as streamlined as possible. Transaction monitoring, people familiar with the company’s practices, seemed to be a barrier to that.\n\nMercury briefly engaged a popular industry vendor for transaction monitoring, but, sources familiar with the matter said, deactivated because it was generating too many alerts. The company ultimately embarked on a project to build its own transaction monitoring and other compliance-related tools, something that could allow the company to better control what potential issues were detected, logged, and available in a future audit, people with knowledge of the situations said.\n\nDespite the uneven approach to transaction monitoring, there were examples of outgoing wires for which Mercury, Synapse, or Evolve collected additional documentation.\n\nFintech Business Weekly obtained dozens of such records for Mercury accounts at Evolve, which appear to be supporting documentation for higher-risk international wire transfers, from a publicly accessible domain (eg non-encrypted, no login required) that was part of Synapse’s IT infrastructure.\n\nExamples of supporting documentation include wire transfer requests on Evolve forms that lack customer information, dubious looking invoices, and Mercury wire instructions that simply referenced users’ resumes or social media profiles.\n\nThis Evolve Bank & Trust outgoing wire transfer request from a Mercury account to Tinkoff Bank in Russia lacks basic customer information.\n\nThis invoice purports to be issued by Axis Consulting to C Touch IT consulting for $190,000 worth of digital marketing and website work. Yet there is no trace of “Axis Consulting” at the listed Albuquerque address, which is used by dozens of other companies, and there is no detectable internet presence for C Touch IT Consulting.\n\nThis Mercury form detailing the wire’s purpose provides only a link to the recipient’s social media profile.\n\nHow Mercury handled issuing and shipping cards tied to companies’ accounts also demonstrated its dedication to customer experience. Historically, Mercury would ship payment cards nearly anywhere — regardless of what address was actually listed on a given company’s Mercury account, people familiar with Mercury’s practices said.\n\nThe practice potentially could run afoul of U.S. and foreign anti-money laundering regulations, Mercury’s bank partners’ policies, and card network policies, as well as creating a significant fraud risk.\n\nMercury also memorably allowed a customer to conduct a card transaction in Cuba, a comprehensively sanctioned jurisdiction, as previously reported by The Information’s Michael Roddan.\n\nWhen the customer, an Argentina-based firm with an account at Mercury, attempted to use their Mercury card in Cuba, the transaction was blocked. The Mercury staffer who handled the issue, unfamiliar with sanctions and financial crime compliance, simply removed the rule blocking the transaction, people familiar with the matter told Fintech Business Weekly.\n\nBut once the situation was detected, rather than self-report the transaction to FinCEN, Mercury spent significant time and resources trying to develop a defensible legal opinion to justify not doing so, those with knowledge of the situation said. Mercury ultimately did not self-report the transaction.\n\nThe upshot of combining an emphasis on low friction with targeting newly formed offshore companies? Fraud and money laundering, numerous people with knowledge of the matter said.\n\nA source close to Mercury’s first bank partner, Evolve, said, “Mercury has facilitated billions of dollars of fraud and laundering by transnational actors.”\n\nThe person added that, “Once [Mercury] realized Evolve would be exiting over half of the customers and not looking the other way anymore, Evolve provided zero value to them.”\n\nReferring to Evolve’s founder Scot Lenoir, the cofounder and CEO of Mercury’s former middleware partner Sankaet Pathak, and Mercury cofounder and CEO Immad Akhund, the person said, “The trio of them were willingly blind to running a criminal laundering enterprise.”\n\nMercury Moved Quickly To Capitalize on SVB’s Failure\n\nMercury’s willingness to move quickly enabled it to benefit handsomely from the collapse of Silicon Valley Bank in March 2023.\n\nThis isn’t a secret — Mercury CEO Akhund has spoken about it extensively and content on the company’s site mentions it as well. For example, in this blog post, a startup founder impacted by SVB’s collapse who migrated to Mercury over that fraught weekend described the process as follows:\n\n“The timeline was literally: Sunday afternoon submission, [which took] no longer than ten minutes, and then by Sunday evening we were approved and ready to fund. I think we had our funds in there by Monday morning. So it was less than 24 hours from applying to [having an] account — and that’s with the backdrop of it being on a Sunday when everything was a bit hectic. For startups, speed can be way higher up the list [of priorities] than for legacy businesses — and we will always choose our products based on convenience and speed. So I think nailing that gives you an edge.”\n\nNot mentioned publicly was Mercury’s willingness to onboard Virgin Islands- and Cayman Islands-incorporated entities, popular with VCs and investors, despite lacking policies, procedures, or a defined workflow for doing so, people familiar with the situation said.\n\nThe decision to prioritize speed paid off, with Mercury onboarding 2,200 former SVB customers, who brought $1.5 billion in deposits with them, according to internal Mercury documents from the time.\n\nAccording to data cited in Mercury’s April 2023 pitch deck, Mercury was the second most popular choice for customers fleeing SVB, behind only the largest bank in the United States, JPMorgan Chase.\n\nWhy customers that had just experienced the catastrophic failure of SVB would choose to move their funds to Mercury, where they would be held by small, unsophisticated community banks, instead of a “too big to fail” bank, where their deposits implicitly would be fully backed, is an interesting question.\n\nIt’s true that Mercury, through its bank partners, offered sweep networks that could boost deposit insurance coverage, as well as Mercury’s treasury management offering.\n\nBut, industry experts told Fintech Business Weekly, there may also have been a self-sorting bias, in which riskier firms that would have been less likely to be approved at JPMorgan Chase or other too big to fail banks chose fintechs like Mercury and Brex instead.\n\nEarly Decisions Required Mercury To Remediate, Offboard Accounts\n\nMercury’s early decisions to emphasize frictionless experiences and courting firms that operated largely outside of the U.S. likely contributed to the issues Mercury’s partner banks faced with their respective regulators.\n\nChoice Bank, Evolve, and Patriot, which issues Mercury’s I/O credit card, were hit with enforcement actions in January 2024, June 2024, and February 2025, respectively.\n\nWhile consent orders, as a practice, do not list specific programs that may have contributed to the regulators taking action, Mercury was by far the largest program at Choice and Evolve, and the infamous Cuba transaction occurred on a Patriot-issued card, according to prior reporting.\n\nAll three orders focus on BSA/AML issues like the ones Mercury’s seemingly lackadaisical approach to onboarding and transaction monitoring could have given rise to.\n\nUltimately, the increased scrutiny on Mercury-opened accounts at Choice and Evolve led to the need to remediate accounts that only listed registered agent addresses, with Mercury abruptly offboarding customers in higher-risk jurisdictions that included Ukraine, Nigeria, Croatia, the Philippines, and even Mercury CEO Akhund’s home country of Pakistan.\n\nAkhund justified the move at the time by saying the operational overhead wasn’t worth it given the small size of the accounts, writing in a post on X, “[T]he number of customers in these countries is very small (<1% of Mercury deposits), but it was putting a lot of strain on our operational teams and all of our financial partners (partner banks, treasury, payments, etc). We’ve seen the regulatory environment become stricter recently, which has made us change our approach to certain situations.”\n\nIt’s not entirely clear that Akhund always went along with offboarding higher-risk countries willingly, however.\n\nSources with knowledge of the situation said that Mercury’s BSA Officer Sumeet Abichandani once had to wait until Akhund was on a sabbatical before offboarding certain high risk jurisdictions.\n\nMoscow-Incubated Flipper Devices Should Have Raised Red Flags\n\nThe concepts of risk ratings, due diligence, KYB, and transaction monitoring can all be a bit abstract.\n\nBut Mercury customers like Flipper Devices Inc. more concretely illustrate the risks of a low friction process designed to enable foreign actors to open U.S. bank accounts.\n\nFlipper Devices Inc. is, according to its website, based at 2803 Philadelphia Pike in Claymont, Delaware. That address, though, is home to a package shipping and business center, not Flipper Devices’ actual operating location.\n\nThat didn’t stop Flipper Devices from using that address to open accounts at Mercury, according to records released in Evolve hack and confirmed by sources familiar with the situation.\n\nThe real story behind Flipper Devices, including potential links to Russian actors under sanctions for suspected interference in the 2016 U.S. presidential election, is far from simple.\n\nA 2023 report from Swedish IT and information security research firm Simovits AB details the Moscow origins of the company, including numerous red flags that should have raised alarms when it applied to open an account with Mercury.\n\nFlipper Devices makes a hand-held diagnostic tool that can monitor, clone, and emulate RFID signals, radio protocols, and access control systems.\n\nWhile ostensibly for use by “white hat” security professionals to conduct audits or penetration testing, the device can also be used for a wide variety of nefarious purposes, such as cloning building keycards or garage door opener signals, assisting in penetrating wireless networks, or emulating the contactless chip in a credit or debit card, for example.\n\nAccording to the Simovits report, whose authors Fintech Business Weekly spoke with for this piece, the company and the tool it produces were originally born in the Neuron Hackspace in Moscow, Russia. The formed co-CEO of that hackspace, Pavel Zhovner, is also the CEO of Flipper Devices.\n\nThat same hackspace was also listed as the registered address for Esage Labs, a doing-business-as name used by two underlying entities. According to the Simovits report, Esage Labs worked in the “digital weapons” and security testing space and had demonstrable links to the Russian federal security service, the FSB, and the Ministry of Defense. Esage Labs, along with other Russian companies and individuals, were added to the OFAC SDN list, following Russia’s interference campaign in the 2016 election.\n\nZhovner, the former co-CEO of the hackspace and CEO of Flipper Devices, has a history of questionable cyber activity, including running a “Distributed Denial of Service” attack website, sabotaging Russian activist Alexi Navalny’s blog, and building a tool to circumvent Ukraine’s blocking of Russian IP addresses, the Simovits report says.\n\nAs of 2023, about 20 Flipper Device employees were based in Russia, based on their LinkedIn profiles at the time. By August of that year, many employees had updated their profiles to reflect being based in Tbilisi, Georgia, apart from the company’s management, who claimed to be based in Dubai.\n\nPresently, the company appears to have a physical presence in London, where it lists an office address near the Greenwich station on the Jubilee line.\n\nOf about 50 employees listed on LinkedIn, many list their location as London. Only one, a part-time advisor who appears to be originally from Russia, lists a location as being in the United States.\n\nThe Flipper Device itself hasn’t been without controversy. According to the Simovits report, shipments of the device to Israel, Germany, Brazil, and the United States have been flagged by customs and either refused entry and returned or destroyed.\n\nThe company has also had issues in the past with payment processors. In 2022, PayPal blocked the company’s account and withheld about $1.3 million in Flipper Device’s funds, without providing the company a clear explanation, according to the firm’s posts on X at the time.\n\nFlipper Device’s New York-based law firm, which boasts expertise in international and Russian law, sent PayPal a demand letter and was ultimately able to secure the release of the company’s $1.3 million.\n\nAn analysis of Flipper Device’s payment activity with Mercury, based on records obtained by Fintech Business Weekly, reveal a pretty anodyne transaction history that includes typical business expenses like services from Adobe, Dropbox, and Google, as well as nearly $2.8 million processed by Flipper Device’s payroll service, Deel.\n\nDeel, currently embroiled in a high-stakes Silicon Valley spy drama with arch rival Rippling, shares a common investor with both Mercury and Synapse: a16z.\n\nAs recently as January 2025, Deel’s website boasted that the company made it “hassle free” to hire and pay employees and contractors in Russia. Asked about this at the time, a Deel representative said those pages on its site were out of date and that they would be removed.\n\nThe Flipper account did catch the attention of regulators, with the FDIC asking Choice Bank about the account during its 2023 exam, people familiar with the situation said.\n\nIt wasn’t the device itself that examiners were worried about, those sources said, but rather the companies apparent links to Russia.\n\nMercury, Evolve, and Choice Bank did not respond to requests for comment about their relationship with Flipper Device Inc.\n\nMercury CEO Personally Sought Exception For Porn App Alleged To Facilitate Trafficking, CSAM\n\nMercury’s “risk on” approach wasn’t limited to a willingness to open accounts for companies that were really based outside of the U.S.\n\nThe company sought to onboard “creator” service OnlyFans, best known for hosting adult content creators, which was first reported by The Information in March 2024. That piece cited Evolve’s decision not to onboard the pornography app as a point of tension between fast-growing Mercury and its first bank partner.\n\nNow, Fintech Business Weekly can confirm, it was Mercury CEO Akhund who was the driving force behind the company’s effort to persuade Synapse and Evolve, or another of Synapse’s bank partners, to take OnlyFans’ business.\n\nInternal emails obtained by Fintech Business Weekly between Mercury’s Akhund and Synapse cofounder and CEO Pathak show Akhund acknowledging that the terms of service Mercury agreed to disallowed “adult entertainment,” but seeking an exception anyway — pointing to the commercial opportunity by saying that OnlyFans “are ready to move at least $100m over to Mercury.”\n\nPathak did his best, reaching out to Evolve founder Scot Lenoir, who, according to texts reviewed by Fintech Business Weekly, didn’t appear to be familiar with the nature of OnlyFans business. Pathak explained to Lenoir that OnlyFans was “like Instagram except creators get paid. Lots of creators are adult entertainment though.”\n\nWhen Lenoir asked, “What are the adult entertainers selling?”, Pathak responded that “they have nudes on it,” but also celebrities, giving the example of rapper Cardi B.\n\nLenoir ultimately demurred, suggesting Pathak check with another of Synapse’s bank partners instead.\n\nMercury’s Akhund followed up with Pathak on February 9, 2021, requesting an update, only to be told that OnlyFans was a no-go.\n\nBeing prevented from onboarding OnlyFans to Mercury may have been a blessing in disguise, however.\n\nWhile OnlyFans was less well known prior to the pandemic, there was already some reporting at the time Akhund advocated for onboarding the company that its service was alleged to facilitate sexual and human trafficking, child sexual abuse material, and money laundering.\n\nSince then, similar allegations about OnlyFans have only multiplied, including that self-proclaimed “mysogynist” influencer Andrew Tate and his brother used the service to traffic women and dodged paying taxes, and an extremely troubling seven part exposé by Reuters, among others.\n\nMercury’s Lax Practices May Have Sunk Effort To Land “Too Big To Fail” Bank Partner\n\nIf you’re a non-bank fintech like Mercury, your business literally lives or dies by your relationship with your regulated bank partners.\n\nWhile it’s unknown exactly to what extent Mercury may have contributed to the regulatory enforcement actions against Choice, Evolve, and Patriot, it would surely give any new potential bank partner pause.\n\nIn the wake of the collapse of SVB, there was, understandably, renewed attention to the limits of FDIC deposit insurance and a flight to safety in the form of too big to fail global systemically important banks (G-SIBS).\n\nRecognizing the change in sentiment post-SVB, Mercury sought a relationship with a G-SIB.\n\nBut conversations with Bank of America and JPMorgan Chase went nowhere, sources familiar with the conversations said.\n\nTalks with Goldman Sachs, trying to develop its own banking-as-a-service franchise as part of its nascent Platform Solutions business at the time, went a bit further. But, Goldman insisted it would need to handle customer onboarding processes, estimating new account opening would probably take “about a week,” people with knowledge of the matter said. Such a lengthy and high-friction process was a dealbreaker for Mercury, and the discussions petered out.\n\n“They’re Manipulative and Actively Lie to Partners”\n\nBut with its relationship with Evolve fraying and Choice under a consent order, Mercury still needed a new bank partner, both for redundancy and to power its continued growth.\n\nIn October 2024, Mercury officially announced its new partnership with “developer infrastructure” bank Column.\n\nColumn, launched by Plaid cofounder William Hockey, which officially launched in April 2022, is surely distinct from Evolve or Choice; it was purpose built from the ground up to support a partnership-driven banking business model.\n\nStill, that doesn’t mean there aren’t risks in its relationship with Mercury.\n\nA company’s culture, including how it views compliance, typically comes from the top — and Mercury’s CEO has a record of demonstrating what could be described as disdain for legal and regulatory constraints, those who have worked with Akhund said.\n\nOne compliance professional who has interacted with Mercury and Akhund warned, “He’s surrounded himself with a bunch of sycophants. They’re not going to do the thing that needs to be done because they think it’s stupid, or it’s not first principles thinking.”\n\nAn engineering staffer that has worked with the company expressed concerns about its honesty, saying, “The bigger issue is that they're manipulative and actively lie to partners.”\n\nAsked about the prospects for any new bank partners of Mercury, the engineer continued by saying, “Mercury will chew those partners up and spit them out as soon as it becomes slightly advantageous. Almost certainly. Depending on the size of the bank, they'll leave them holding the bag and consent orders as well.”\n\nThe compliance professional made an equally blunt assessment, saying, “I don’t know any other bank that would want to bank a company like Mercury.”\n\nRepresentatives for Mercury, Evolve Bank & Trust, and Choice Bank did not respond to requests for comment. A representative for Column declined to provide a comment for publication.\n\nOther Good Reads\n\nCFTC Rocked by Exits and Sanctions as Crypto Reform Awaits (Bloomberg)\n\nForcing Bank Deposits to Subsidize Stablecoins: the GENIUS Act (Adam Levitin/Credit Slips)\n\nThe Supreme Court Is Just Making Stuff Up About the Fed (Adam Levitin/Credit Slips)\n\nThe Chime Test (Fintech Takes)\n\nAbout Fintech Business Weekly\n\nLooking to work with me in any of the following areas? Email me."
    },
    {
        "title": "Gaurav Jain wrote the playbook for pre-seed investing. A decade later, he's running one of the industry's most prolific early-stage funds.",
        "description": "VC Gaurav Jain started Afore Capital specifically to invest in pre-seed funding rounds.",
        "url": "https://www.businessinsider.com/afore-capital-gaurav-jain-pre-seed-investing-reshape-vc-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-14T08:00:01Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nFor Gaurav Jain, there's no such thing as \"too early\" when it comes to making a VC investment.\n\nDuring the last decade, he's built a reputation as one of the most influential early-stage investors in venture capital: first at Founder Collective, and, since 2016, at Afore Capital, the fund he cofounded to make pre-seed investments at a time where rounds of at that size and dollar amount had a negative connotation in the industry.\n\nSince then, Afore has grown into one of the most active early-stage funds and has backed companies such as Modern Health, Neo, and Hightouch.\n\nJain said he's always been obsessed with finding the right founders who had great ideas but weren't far enough along to raise a seed round. That thesis eventually became Afore Capital, he said.\n\nJain ranked No. 2 on Business Insider's Seed 100 list for 2025, which was compiled using data from Termina.\n\n\"A lot of founders were telling us that we were too early, but you need money to get traction, and you need traction to get money,\" Jain told Business Insider. \"That became the genesis for us to start Afore Capital.\"\n\nA career at the early stage\n\nJain, who was born in India, started his career at Google in 2009. He was one of the earliest product managers at the company's Android division when the mobile platform had fewer than 1 million users. While he was there, he led the Android Nexus product line, a range of phones and tablets that later became Google Pixel.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nJain left Google in 2011 to attend Harvard Business School, with the goal of moving into the world of venture capital. He started working with Founder Collective, a seed-stage fund based in Boston, and joined the firm as principal when he graduated with his MBA in 2013. While at Founder Collective, Jain was directly involved in the firm's investments in Cruise, Socure, Firebase, Airtable, and Smyte.\n\nAt the same time, Jain said he was meeting with plenty of founders who seemed like they'd be great bets but weren't yet at the size or scale to raise a seed funding round. At the time, pre-seed rounds weren't as common, and they sometimes carried a negative perception with investors because they were so risky.\n\nJain, however, saw an opportunity in the market.\n\n\"There was this gap in the market, where all of these first-time founders had no celebrity and no meaningful traction,\" he said. \"I saw the problem firsthand, which is how we decided to create a fund dedicated to fixing it.\"\n\nCreating a market for pre-seed investing\n\nIn 2016, Jain teamed up with Anamitra Banerji, a partner at Foundation Capital who'd been Twitter's 25th employee and the company's first product manager.\n\nThe two cofounded Afore Capital, a fund specifically dedicated to investing in pre-seed startups. Afore currently has around $500 million in assets under management, and it closed its most recent fund, a $185 million Fund IV, in February. The firm writes checks of up to $2 million.\n\nAfore's portfolio includes Modern Health, a mental health benefits platform for employers that raised a $74 million Series D in 2021 and achieved unicorn status with a $1.17 billion valuation; the Canadian fintech Neo, which raised a 259 million in Canadian dollars Series D at the end of 2024; and the AI marketing platform Hightouch, which in Februrary raised $80 million at a $1.2 billion valuation.\n\nThe firm's recent exits include Highlight, a web-monitoring app for developers that was acquired by the software development platform LaunchDarkly in April, and the AI supply-chain startup Factor, which was acquired by the supply-chain logistics platform Cofactr in March.\n\nWhile Afore is technically a generalist firm — when it comes to backing pre-seed startups, Jain said it doesn't have the luxury of building out an evolved thesis on a specific market or sector — it tends to gravitate toward software investments, which, today, means making a lot of AI bets. Jain added that it's much more important to identify strong founders, whose ideas might change five times before achieving product-market fit.\n\n\"At the stage where we invest in, which is pre-traction and pre-revenue, what we are really investing in is the people,\" Jain said, adding that he looks for founders with a strong growth mindset who can iterate new ideas quickly and take setbacks in stride.\n\nTo that end, Afore has a program to support \"pre-idea\" founders while they search for the right spark to build a startup. If the idea hits, the firm will eventually invest at minimum $100,00 or lead its pre-seed funding round. There's also a college version of the program, in which students can iterate on a startup idea with Afore support instead of completing a traditional summer internship.\n\n\"At the pre-seed stage, it's crucial to give founders a safe space if things aren't working,\" Jain said. \"We're backing you, not one rigid idea. We invest the time it takes to get to product-market fit, and our commitment is that we'll be the most active, hands-on investors you'll ever have.\""
    },
    {
        "title": "Wealthsimple Acquires Plenty Team To Improve Family Finance",
        "description": "Wealthsimple acqui-hired Plenty, creating a fintech company that provides broader financial planning for couples and exemplifying a new phase in fintech mergers.",
        "url": "https://www.forbes.com/sites/geristengel/2025/05/30/wealthsimple-acquires-plenty-team-to-improve-family-finance/",
        "source": "Forbes",
        "publishedAt": "2025-05-30T11:00:00Z",
        "full_text": ""
    },
    {
        "title": "Diligent (YC S23) Is Hiring a Founding AI Engineer",
        "description": " About us\nAt Diligent, we are on a mission to help fintechs and banks automate and enhance due diligence operations with AI agents. Leading banks and payment companies use us to automate risk investigations they run when onboarding and monitoring business c…",
        "url": "https://www.ycombinator.com/companies/diligent/jobs/LAdzmYb-founding-ai-engineer",
        "source": "Hacker News",
        "publishedAt": "2025-05-27T07:00:41Z",
        "full_text": "👋 About us\n\nAt Diligent, we are on a mission to help fintechs and banks automate and enhance due diligence operations with AI agents. Leading banks and payment companies use us to automate risk investigations they run when onboarding and monitoring business customers in Europe, Middle East, USA and Asia.\n\nOur founders have built fraud and credit risk models protecting billions in transactions at Europe’s top fintechs, and we’re taking that experience to revolutionize how financial institutions verify the legitimacy of businesses. With deep expertise in AI-driven risk assessment, we turn unstructured data into powerful insights, helping our customers automate manual reviews, strengthen fraud detection, and improve the onboarding experience for legitimate businesses.\n\nWe already work with leading fintech unicorns and banks, are growing fast and we’re looking for ambitious problem-solvers who are excited about using AI to tackle financial crime at a global scale. If you're passionate about making a real impact in the fight against fraud, we’d love to have you on our team! 🚀\n\nMore on us here:\n\nLaunch YC: Diligent - GenAI assistant for fintech risk and compliance operations | Y Combinator\n\n💼 The role\n\nYou are part of the founding team. You’ll play a crucial role in shaping the future of our company - from hands-on engineering and product work, to high-level strategic decisions.\n\nAs a Founding AI Engineer you’ll work on building our core agent frameworks, innovating on how LLMs are used by enterprises in the financial services industry. You'll be testing, deploying, and scaling delightful AI experiences in addition to ensuring that our outputs are extremely high quality. This role is perfect for someone who is obsessed with language models and wants to spend their time becoming an expert in applied AI.\n\nWhat we expect\n\nWithin days:\n\nTake ownership of your first module and push improvements to production, making an immediate impact on our customers' workflows.\n\nStart building the product infrastructure for LLMs, giving Diligent agents the infrastructure, data sources and tools they need to automate workflows for financial compliance teams.\n\nWork directly with customers to solve their problems. We need someone who has high empathy and is excited by working side-by-side with risk teams to solve critical problems.\n\nWithin weeks:\n\nEvolve schemas and bring structure to non-deterministic outputs.\n\nLead feedback calls with customers on your modules and own the end customer outcomes.\n\nWork directly with the CEO, CTO, and other founding members and mature our engineering practice.\n\nWithin months:\n\nTackle technical and non-technical scaling problems that come with high growth.\n\nHire, onboard, and nurture future teammates.\n\nOur tech stack\n\nNodeJS\n\nPython\n\nTypescript\n\nReact\n\nAWS Serverless\n\n🤓 About you\n\nCurious — You have a deep passion for understanding and solving complex problems. You enjoy diving deep into customer challenges and finding innovative solutions.\n\n— You have a deep passion for understanding and solving complex problems. You enjoy diving deep into customer challenges and finding innovative solutions. Driven — Early-stage startups require dedication and hard work - this isn't a 9-5 role. We need committed people who are ready to put in the effort to build something extraordinary. You should be self-motivated and thrive on challenges.\n\n— Early-stage startups require dedication and hard work - this isn't a 9-5 role. We need committed people who are ready to put in the effort to build something extraordinary. You should be self-motivated and thrive on challenges. Pragmatic — Building something new requires multiple iterations and attempts. You understand that perfect is the enemy of good, and you're able to find practical solutions without overcomplicating things. You focus on getting things done and learning from each iteration.\n\n— Building something new requires multiple iterations and attempts. You understand that perfect is the enemy of good, and you're able to find practical solutions without overcomplicating things. You focus on getting things done and learning from each iteration. Humble — You know your strengths but also recognize there's always more to learn. You're confident in your abilities while remaining open to new perspectives and approaches.\n\n— You know your strengths but also recognize there's always more to learn. You're confident in your abilities while remaining open to new perspectives and approaches. Empathetic — You excel at understanding both customer and team needs. You actively listen, share feedback constructively, and create an environment where everyone feels heard. You're able to put yourself in others' shoes, whether they're team members or customers.\n\nBudget\n\nBase salary £ 80k-£120k\n\nEquity: 0,5 - 2,0%\n\n⏳ The interview process\n\nWe are seeking to make our interview as experiential as possible in order for both sides to get the most signal on what it would be like to work together."
    },
    {
        "title": "Tourism's perfect storm, Walmart and Costco's gas stations, and Musk leaves DOGE: Business news roundup",
        "description": "On a recent Finnair flight from Helsinki to Los Angeles, something felt off. The economy cabin — typically packed with tourists eager to explore California’s beaches and theme parks — was less than half full. A flight to Europe two months earlier had been pac…",
        "url": "https://qz.com/walmart-costco-gas-stations-elon-musk-trump-doge-1851783137",
        "source": "Quartz India",
        "publishedAt": "2025-05-31T11:00:00Z",
        "full_text": "President Donald Trump’s on-again, off-again tariffs have draped the economy in uncertainty.\n\nAdvertisement\n\nBecause of this, some companies have simply resorted to tossing earnings guidance and raising prices to absorb whatever comes the market’s way.\n\n“When a single tariff announcement can erase trillions in market value overnight, who can blame finance leaders for tossing their annual forecasts out the window?” Sunil Rajasekar, CEO of fintech platform Billtrust, tells Quartz.\n\nRead More"
    },
    {
        "title": "Healthcare Payments: Why Patients Struggle And What We Can Do About It",
        "description": "If fintech and providers partner up, we could help ensure that no patient delays care because of cost.",
        "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/05/13/healthcare-payments-why-patients-struggle-and-what-we-can-do-about-it/",
        "source": "Forbes",
        "publishedAt": "2025-05-13T13:15:00Z",
        "full_text": ""
    },
    {
        "title": "SoFi Vs. Block: Which Fintech Stock Is The Better Pick?",
        "description": "Currently, SOFI stock is priced higher at about 5 x trailing revenues, versus 1.3x for Block.",
        "url": "https://www.forbes.com/sites/greatspeculations/2025/05/09/sofi-vs-block-which-fintech-stock-is-the-better-pick/",
        "source": "Forbes",
        "publishedAt": "2025-05-09T09:30:41Z",
        "full_text": ""
    },
    {
        "title": "U.K. Fintech Starling Bank Says ‘Historic Weaknesses’ Caused Profit Drop",
        "description": "Starling Bank reported its fourth consecutive year of profitability and revenue growth on Wednesday, although the fintech’s “legacy matters” weighed heavily on its bottom line.",
        "url": "https://www.forbes.com/sites/robertolsen-1/2025/05/28/uk-fintech-starling-bank-says-historic-weaknesses-caused-profit-drop/",
        "source": "Forbes",
        "publishedAt": "2025-05-28T17:10:13Z",
        "full_text": ""
    },
    {
        "title": "3 Fintech Remote-First Teams Building Strong Cultures",
        "description": "Here are examples of Fintech remote-first teams building strong cultures despite the growing demands and pressure on returning to the office.",
        "url": "https://www.forbes.com/sites/nadiaedwards-dashti/2025/05/06/3-fintech-remote-first-teams-building-strong-cultures/",
        "source": "Forbes",
        "publishedAt": "2025-05-06T09:01:29Z",
        "full_text": ""
    },
    {
        "title": "Embedded Fintech Meets AI: Vertical SaaS Platforms To Vertical Agents",
        "description": "The convergence of embedded fintech, artificial intelligence, and vertical SaaS platforms is transforming software from passive tools into proactive business partners.",
        "url": "https://www.forbes.com/sites/davidmoon/2025/05/28/embedded-fintech-meets-ai-vertical-saas-platforms-to-vertical-agents/",
        "source": "Forbes",
        "publishedAt": "2025-05-28T18:36:12Z",
        "full_text": ""
    },
    {
        "title": "The Three Archetypes To Fintech Success In LatAM (& Emerging Markets)",
        "description": "How do latam fintech companies scale? How do they navigate a fragmented, highly regulated, and deeply local landscape? Three archetypes emerge.",
        "url": "https://www.forbes.com/sites/alexlazarow/2025/05/14/the-three-archetypes-to-fintech-success-in-latam--emerging-markets/",
        "source": "Forbes",
        "publishedAt": "2025-05-14T08:00:00Z",
        "full_text": ""
    },
    {
        "title": "Singapore-Based Fintech Unicorn Airwallex Raises $300 Million",
        "description": "Backed by the likes of Tencent, HongShan and DST Global, Airwallex has reached a valuation of $6.2 billion following its latest Series F funding round.",
        "url": "https://www.forbes.com/sites/catzxwang/2025/05/22/singapore-based-fintech-unicorn-airwallex-raises-300-million/",
        "source": "Forbes",
        "publishedAt": "2025-05-22T14:00:37Z",
        "full_text": ""
    },
    {
        "title": "Tabular (YC S24) Is Hiring",
        "description": "Do you want to work on an extremely ambitious project?\nAI will be the biggest revolution to accounting since the invention of double-entry bookkeeping in 1494. As the cost of intelligence trends towards zero, we will be able to handle accounting’s unstructure…",
        "url": "https://www.ycombinator.com/companies/tabular/jobs/7V7rXlS-founding-engineer",
        "source": "Hacker News",
        "publishedAt": "2025-05-07T07:00:04Z",
        "full_text": "Do you want to work on an extremely ambitious project?\n\nAI will be the biggest revolution to accounting since the invention of double-entry bookkeeping in 1494. As the cost of intelligence trends towards zero, we will be able to handle accounting’s unstructured data and language-based rules fully autonomously.\n\nThe consequence will be profound. Accounting is the source of truth on what happens in a business. It drives every investment, expansion and company survival. In the intelligence age, business owners with no financial expertise will get access to all the latent knowledge hidden in their books. Businesses will operate with a level of clarity, confidence, and speed that is almost unimaginable today.\n\nTabular is leading the charge. We are live in several of Germany’s most forward-thinking accounting firms, automating the books of Sequoia-backed startups, family-owned restaurants, and 30-person wood manufacturers.\n\nWe are looking for an intense founding engineer who wants to build at the frontier.\n\nRead more about our mission.\n\nWhy join Tabular?\n\nBuild at frontier - We believe that the current time window is a once in a lifetime opportunity. Technological shifts happen once, and then they don’t come again. There was only one brief point in time where it was possible to found Amazon, Uber or Facebook. This is that moment for autonomous accounting.\n\n- We believe that the current time window is a once in a lifetime opportunity. Technological shifts happen once, and then they don’t come again. There was only one brief point in time where it was possible to found Amazon, Uber or Facebook. This is that moment for autonomous accounting. Small team, massive leverage - We believe that 10-person teams of highly capable people can outperform a 100-person org. We value intense focus, high agency and being all-in.\n\n- We believe that 10-person teams of highly capable people can outperform a 100-person org. We value intense focus, high agency and being all-in. Join at the ground floor - We are a 5-person team and laying the foundations to start hyperscaling. There is a lot more responsibility than we have people.\n\n- We are a 5-person team and laying the foundations to start hyperscaling. There is a lot more responsibility than we have people. Super difficult problems - ****We are aggressively pushing what’s possible with AI / LLMs and building a general ledger from scratch. There are no limitations to your learning curve.\n\n- ****We are aggressively pushing what’s possible with AI / LLMs and building a general ledger from scratch. There are no limitations to your learning curve. Forge the core architecture – You won’t just ship features, you’ll build the foundations of our autonomous-accounting engine. You’ll choose the stack, set the engineering bar, and bake in patterns that every future hire will follow.\n\n– You won’t just ship features, you’ll build the foundations of our autonomous-accounting engine. You’ll choose the stack, set the engineering bar, and bake in patterns that every future hire will follow. In-person culture - We’re working in-person in our office at Berlin Hackescher Markt.\n\n- We’re working in-person in our office at Berlin Hackescher Markt. Product-driven team - We are building in an extremely tech and product-driven market. Every person in the founding team has a tech or product background.\n\n- We are building in an extremely tech and product-driven market. Every person in the founding team has a tech or product background. Compensation - We aim to pay competitively for cash compensation and well above market for equity compensation, because all of us are all-in, and we want you to be too.\n\n- We aim to pay competitively for cash compensation and well above market for equity compensation, because all of us are all-in, and we want you to be too. World class investors - We’ve raised a $4.7M Seed with Y Combinator, LocalGlobe (Robinhood, Wise, Figma), and Rerail (fund of best fintech founders in Europe), along with some of the most influential accounting firm leaders in Germany.\n\nWhat you will work on"
    },
    {
        "title": "Why Banks May Not Be Your Small Business’s Best Bet For Finance",
        "description": "Looking for funding for business growth? As the private credit market expands, maybe a challenger bank or fintech lender is now the best option for your business",
        "url": "https://www.forbes.com/sites/davidprosser/2025/05/08/why-banks-may-not-be-your-small-businesss-best-bet-for-finance/",
        "source": "Forbes",
        "publishedAt": "2025-05-08T12:53:17Z",
        "full_text": ""
    },
    {
        "title": "Follow The Money: Why Fintech Continues To Be A Magnet For VC Cash",
        "description": "Although no longer the number one destination, investment in fintech remains strong. What are the opportunities for startups in a mature market?",
        "url": "https://www.forbes.com/sites/trevorclawson/2025/05/13/follow-the-money-why-fintech-continues-to-be-a-magnet-for-vc-cash/",
        "source": "Forbes",
        "publishedAt": "2025-05-13T21:12:14Z",
        "full_text": ""
    },
    {
        "title": "Here's Where Fintechs Are Turning For Funding",
        "description": "As the fintech VC funding landscape in the UK continues to look uncertain amid wider economic uncertainty, some companies are turning to alternatives to secure the cap...",
        "url": "https://www.forbes.com/sites/sarahkocianski/2025/05/19/heres-where-fintechs-are-turning-for-funding/",
        "source": "Forbes",
        "publishedAt": "2025-05-19T07:58:27Z",
        "full_text": ""
    },
    {
        "title": "Green Fintech’s Data Dividend: How APIs, ESG-Linked Trade And “Kilowatt Tokens” Turn Sustainability Data Into Cash Flow",
        "description": "Green fintech is monetising sustainability data: carbon-tracking APIs, ESG-linked trade finance and blockchain kilowatt tokens slash costs and unlock new revenue.",
        "url": "https://www.forbes.com/sites/zennonkapron/2025/05/29/green-fintechs-data-dividend-how-apis-esg-linked-trade-and-kilowatt-tokens-turn-sustainability-data-into-cash-flow/",
        "source": "Forbes",
        "publishedAt": "2025-05-30T02:38:00Z",
        "full_text": ""
    },
    {
        "title": "UX Over Underwriting: Why Fintechs Need To Focus On The End User",
        "description": "The future of fintech is not just faster back-end processing, AI-powered decisions or cloud-native compliance. It's user experience.",
        "url": "https://www.forbes.com/councils/forbesbusinesscouncil/2025/05/08/ux-over-underwriting-why-fintechs-need-to-focus-on-the-end-user/",
        "source": "Forbes",
        "publishedAt": "2025-05-08T13:30:00Z",
        "full_text": ""
    },
    {
        "title": "How FIS CEO Stephanie Ferris Led A $24 Billion Fintech Deal",
        "description": "In April, FIS announced a $24.25 billion deal to sell Worldpay to Global Payments—marking one of the biggest fintech transactions of the year.",
        "url": "https://www.forbes.com/sites/nicolecasperson/2025/05/08/how-fis-ceo-stephanie-ferris-led-a-24-billion-fintech-deal/",
        "source": "Forbes",
        "publishedAt": "2025-05-09T00:42:58Z",
        "full_text": ""
    },
    {
        "title": "Chime’s IPO Is A Milestone For Fintech, But Has The Real Test Just Begun?",
        "description": "Chime proves inclusive fintech can work, but delivering true financial resilience for all Americans will require deeper innovation and a broader business model",
        "url": "https://www.forbes.com/sites/vikasraj/2025/05/21/chimes-ipo-is-a-milestone-for-fintech-but-has-the-real-test-just-begun/",
        "source": "Forbes",
        "publishedAt": "2025-05-21T16:03:31Z",
        "full_text": ""
    },
    {
        "title": "Rise Of Small Business In Emerging Markets Is Powering A Fintech Revolution",
        "description": "Emerging market SMBs are driving fintech innovation with tailored tools for cash flow, onboarding, and growth—finally closing the gap in financial services.",
        "url": "https://www.forbes.com/sites/ilonalimonta-volkova/2025/05/18/rise-of-small-business-in-emerging-markets-is-powering-a-fintech-revolution/",
        "source": "Forbes",
        "publishedAt": "2025-05-18T23:11:00Z",
        "full_text": ""
    },
    {
        "title": "Fintech Funding’s Sudden Thaw: What A Cluster Of Nine-Figure Rounds Tells Us About A Q3 IPO Re-Boot",
        "description": "A cluster of nine-figure fundraising rounds could signal the thaw in fintech IPO markets. Discover what the rounds tell us about the future of the market.",
        "url": "https://www.forbes.com/sites/zennonkapron/2025/05/28/fintech-fundings-sudden-thaw-what-a-cluster-of-nine-figure-rounds-tells-us-about-a-q3-ipo-re-boot/",
        "source": "Forbes",
        "publishedAt": "2025-05-28T16:09:00Z",
        "full_text": ""
    },
    {
        "title": "Employer.com scoops up another fintech in purchase of MainStreet.com",
        "description": "Employer.com has acquired MainStreet.com for an undisclosed amount, the latest fintech startup to get snapped up by the workforce management company.\nIn a post on X, Employer.com Chairman and co-founder Jesse Tinsley said the two companies were “merging force…",
        "url": "https://biztoc.com/x/f20c398629dd3cd6",
        "source": "Biztoc.com",
        "publishedAt": "2025-05-06T01:32:52Z",
        "full_text": "Ukraine launched one of the largest drone assaults deep inside Russia, targeting 40+ strategic bombers and air bases, escalating the conflict just before peace talks.\n\nMarket Summary Markets reacted sharply to U.S. tariff hikes, with Asian equities mostly lower while oil prices surged on OPEC+ production decisions. The CE 100 Index climbed 1.7% led by AI stocks, while Dow futures slipped amid tariff worries. Investors remain cautious ahead of mixed economic data and Fed rate cut signals.\n\nFigure of the Day 50% - U.S. steel tariff hike announced by President Trump, doubling previous rates.\n\nNawrocki Clinches Polish Presidency Amid EU Tensions Polish Election Too Close to Call as Runoff Nears Polish presidential election results fuel political tension in Europe, with right-wing Nawrocki narrowly winning and potential impacts on EU relations.\n\nBullish CE 100 Index Rallies 1.7% as AI Stocks Lead Market Recovery Investor enthusiasm for artificial intelligence drives a 1.7% gain in the CE 100 Index, signaling renewed confidence in tech innovation amid trade uncertainties. More on pymnts.com\n\nBearish Trump’s Steel Tariff Hike Sparks Global Market Turmoil Doubling U.S. steel tariffs to 50% rattles Asia-Pacific markets, triggers commodity price jumps, and fuels trade tensions worldwide. More on breakingthenews.net\n\nFBI Probes Targeted Terror Attack in Boulder, Colorado Multiple Injured in Targeted Colorado Attack; Suspect Held Political unrest and terror attacks shake the US, with a targeted terror attack in Boulder, Colorado drawing FBI and White House attention.\n\nRegulatory Impact The Trump administration announces a doubling of steel and aluminum tariffs to 50%, maintains assertive trade policies amid ongoing U.S.-China tensions, and signals regulatory tightening on international tech and defense sectors.\n\nChina Blasts US for Breaking Geneva Trade Deal China Vows Forceful Measures Over US Trade Violations US-China trade tensions persist as China accuses the US of violating trade agreements, escalating diplomatic friction over tech and tariffs.\n\nQuote Inflation fears are alarmist; the U.S. will never default on its debt.\n\n— Treasury Secretary Scott Bessent\n\nTreasury’s Bessent Insists US Will Never Default Bessent Challenges Inflation Alarmism, Defends Trade Tariffs Treasury Secretary Scott Bessent reassures markets claiming US will never default amid ongoing debt ceiling negotiations and tariff disputes.\n\nPoland Swings Right as Nationalist Nawrocki Wins Presidency Poland Exit Polls Show Trump-Backed Candidate Narrowly Ahead European political shifts mark the rise of nationalist leadership in Poland and concerns over future directions within the EU.\n\nUber Exec Details AI Tools Powering Workplace Productivity Anthropic AI Startup Hits Reported $3 Billion Revenue Milestone Tech industry advances AI at work and consumer level, with big names experimenting while debates over AI ethics and productivity continue."
    },
    {
        "title": "The Seed 40: The best women early-stage investors of 2025",
        "description": "Business Insider's Seed 40 list celebrates the top women early-stage investors who provide crucial support to budding startups.",
        "url": "https://www.businessinsider.com/seed-40-best-women-early-stage-vc-investors-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-05-13T09:00:02Z",
        "full_text": "Early-stage investors take some of the biggest — and boldest — swings in venture capital.\n\nOur Seed 40 list, in its fifth year, spotlights the women who have done exactly that: find breakout talent early, and work alongside these founders to shape the future of tech. This year's honorees have placed bets across some of 2025's hottest verticals, from AI to health tech.\n\nPerhaps it's no surprise that these investors are drawn to founders with similar characteristics. Mathilde Collin, one of the new members on this year's Seed 40 and Seed 100, told Business Insider she seeks out \"a delicate balance between humility, self-awareness, and self-confidence.\" \"Enough self-confidence to inspire people to be on the journey with them, enough humility to get people to help them, enough self-awareness to work on themselves,\" she added.\n\nThis list is compiled using data analysis supplied by Termina, a software platform spun out of Tribe Capital. Read the full methodology behind the list .\n\n1. Laura Rippy\n\nLaura Rippy\n\nManaging partner and board member, Alumni Ventures\n\nNotable investments: Daydream, Rent App, Barnwell Bio, Atomic Supply, TRM Labs, Believer.gg,\n\nCity: Boston\n\nRippy says that when the world is chaotic, startups are the most nimble, which is why she's excited for this year.\n\n\"The pattern of 2025 so far is highly talented teams tackling big opportunities,\" she told BI.\n\nBased in Boston, Rippy has built a large network of school-related founders and investors. She runs two school-centric funds, Green D at Dartmouth College and Yard Ventures at Harvard, and she's also the managing partner of Alumni Ventures, one of the most active VC firms in the world. Alumni brings VC investing to individual investors' portfolios and manages more than 650,000 members.\n\nPrior to joining Alumni Ventures in 2017, Rippy spent 14 years at the private family office Ripplecreek Partners.\n\n2. Shruti Gandhi\n\nShruti Gandhi, Courtesy of Array Ventures\n\nFounder and general partner, Array Ventures\n\nNotable investments: Capsule, Eventual Computing, Mozart Data, Placer.ai, Rad AI, Runway.team\n\nCity: San Francisco\n\nGandhi's track record shows she gets results for limited partners. In under a decade, the solo capitalist has returned her first $7 million fund at a fivefold multiple, with more companies still waiting to exit. A stream of acquisitions has sped along those distributions, including Simility, a fraud-detection company which sold to PayPal in 2018, just two years after Gandhi invested.\n\nAs a one-time startup founder, Gandhi decided to raise a fund in 2016 because she saw a need for more investors who rolled up their sleeves at the seed stage. Her fund, Array Ventures, helps technical founders close early sales and develop their go-to-market sales strategy.\n\n3. Anne Dwane\n\nAnne Dwane Anne Dwane\n\nCofounder and partner, Village Global\n\nNotable investments: Commontools, P-1 AI, AirGarage, Cherry, Pave, Grow Therapy\n\nCity: San Francisco\n\nFor a career investor like Dwane, AI has represented a generational shift, which is creating an exciting time to evaluate startups and founders for new investment opportunities.\n\n\"The last year has been like no other,\" she told BI. \"AI's impact is just beginning to show up in legacy industries, where the gap between what's possible and what exists remains wide.\"\n\nDwane added that the industry is also experiencing a revolution when it comes to software development, which she said will allow more people to build companies.\n\nAcross Village Global's three funds, Dwane's deals have a cumulative holding value of more than $16 billion. Before Village Global, Dwane cofounded the veteran-focused news site Military.com and later served as the CEO of Zinch, a university-recruitment startup acquired by the edtech company Chegg in 2011.\n\n4. Meltem Demirors\n\nMeltem Demirors of Crucible Capital Meltem Demirors\n\nGeneral partner, Crucible Capital\n\nNotable investments: Double Zero, CentralAxis, Ostium\n\nCity: New York\n\nDemirors has had a busy year launching her new firm, Crucible Capital, which invests in energy, compute, and crypto startups. Crucible ended 2024 with $36 million in committed capital from a $50 million target fund and is now oversubscribed, Demirors told BI. The firm also recently made its third investing hire.\n\nFor Demirors, Crucible Capital is the natural extension of her long career as an investor outside the traditional venture capital space. Rather than spinning out of a VC fund, she built investment firms and asset managers in crypto while she was angel investing. Prior to launching Crucible, Demirors was the chief strategy officer at the digital-asset investment company CoinShares.\n\nAt Crucible, her LPs are mostly builders, operators, and investors, rather than institutional investors or funds of funds.\n\n\"I feel like Crucible is a bit of an anomaly and it can be challenging considering how clubby venture can be sometimes,\" she said.\n\n5. Mathilde Collin\n\nMathilde Collin of Front Mathilde Collin, Courtesy of Front\n\nCofounder and executive chairperson, Front\n\nNotable Investments: Retool, Mercury, Vanta, Copilot, Meter, Browser Use\n\nCity: San Francisco\n\nColllin cofounded Front, a customer service platform startup, in 2013 after working as a project manager at another startup. She served as Front's CEO until October and is now its executive chairperson. Collin also angel invests in a variety of companies, which include the fintech banking startup Mercury and the tool-building platform Retool.\n\nIn founders, Collin looks for \"a delicate balance between humility, self awareness and self confidence,\" she told BI. \"Enough self confidence to inspire people to be on the journey with them, enough humility to get people to help them, enough self awareness to work on themselves.\"\n\n6. Ann DeWitt\n\nAnn DeWitt of Engine Ventures Ann DeWitt\n\nGeneral partner, Engine Ventures\n\nNotable investments: Cellino, Bexorg, Matrisome Bio, Terragia, Anthology, Kano Therapeutics, Source Bio\n\nCity: Boston\n\nDeWitt has spent her career helping companies build new transformative biotechnologies. She began in VC at the Massachusetts life sciences firm Flagship Pioneering, then moved to Sanofi, where she guided the pharma giant's investments.\n\nShe joined The Engine, an MIT spinout, in 2018, two years after its launch. First as The Engine's chief operating officer, then as a general partner, she supported the startup incubator and accelerator's work with \"tough tech\" companies, offering an array of resources from lab space to capital for startups building in areas like climate and human health.\n\nIn 2023, DeWitt stayed on the investing side of the business when The Engine split its startup support operations from its venture arm. She highlighted Engine Ventures' investment in Cellino, which announced in February plans to open a stem cell manufacturing facility on-site at Massachusetts General Hospital in partnership with the top health system Mass General Brigham's Gene and Cell Therapy Institute.\n\n7. Caterina Fake\n\nCourtesy\n\nFounder, Yes VC\n\nNotable investments: Career Karma, Outschool, Public Goods, Jow, Running Tide\n\nCity: San Francisco\n\nFake is a serial entrepreneur, cofounding the photo-sharing service Flickr, which was acquired by Yahoo in 2005. She makes investments through Yes VC, her firm that invests in climate, AI, health and longevity, energy, and defense companies. She's backed Etsy, Cloudera, Oura, and Adept.\n\nShe was also named to the VC firm Trac's list of \"SuperForecasters,\" or people the firm considers \"extraordinary\" pre-seed and seed VCs. Fake has said that this ability to spot future unicorn companies, \"plus strong networks and access, is an absolute requirement for angels and VCs.\"\n\n8. Trish Costello\n\nTrish Costello\n\nFounder and CEO, Portfolia\n\nNotable investments: YourChoice, Bone Health Technologies, Canela Media, Eden GeoPower, Prime Roots, Lighthouse Pharma\n\nCity: San Mateo, California\n\nCostello founded the venture fund Portfolia in 2014. The fund taps women investors to lead venture capital deals in areas such as women's health, sustainability, active aging and longevity, and startups led by founders of color. Before that, Costello was part of the entrepreneurial ecosystem for more than two decades with her work as the cofounder of the Kauffman Fellows program, an education and leadership program for venture capitalists.\n\nCostello told BI that while many venture firms slowed their investing pace last year because of market conditions, Portfolia closed 27 investments, adding to its more than 100 investments in the past five years. \"Over the past year, we determined that the smartest trend was to stay consistent and disciplined and keep putting our money to work,\" she said.\n\n9. Julia Hartz\n\nStefan Wieland\n\nCofounder and CEO, Eventbrite\n\nNotable investments: Doppler, Mmhmm, Nooks, Oliver Space, Socket\n\nCity: San Francisco\n\nHartz is the animating spirit behind Eventbrite's mission to create a closer world through live experiences. She's also an ardent supporter of early-stage companies.\n\nHer angel investing portfolio includes Socket, a startup focused on helping companies secure open-source software, and Nooks, which is developing a fully autonomous sales assistant.\n\nBefore Eventbrite, Hartz helped develop television shows for MTV Networks and FX Networks.\n\n10. Kirsten Green\n\nForerunner Ventures\n\nFounder and managing partner, Forerunner\n\nNotable investments: Chime, Faire, Hims & Hers, Daydream, Balance\n\nCity: San Francisco\n\nFor a seasoned consumer investor like Green, a visionary founder is only part of the equation — when she's evaluating a potential startup investment, she's also looking for which business models are going to make for knockout consumer experiences.\n\n\"The strongest businesses don't just have a great product or compelling branding — they are structurally designed to scale in a way that enhances the customer journey, accelerates inevitable behavior shifts, and creates self-reinforcing business advantages over time,\" Green told BI.\n\nGreen founded Forerunner in 2012 and has spent more than a decade investing in early-stage consumer companies such as the fintech Chime, the vision juggernaut Warby Parker, and the healthtech company Hims & Hers.\n\n11. Varsha Rao\n\nVarsha Rao\n\nCEO, Zeal AI\n\nNotable investments: Athelas, Grow Therapy, Sanas AI, New Lantern, Observo AI, Candid Health\n\nCity: San Francisco\n\nRao's Zeal AI, an AI-powered restaurant scheduling platform that launched in November, is her latest venture in a storied career at consumer-focused companies. She first founded and co-led the e-commerce beauty site Eve.com, which Idealab acquired in early 2000 for $110 million. She's held leadership roles at Airbnb, Gap's Old Navy, and LivingSocial, which was acquired by its rival Groupon. Before Zeal, she was the CEO of the reproductive health platform Nurx, which merged with the telehealth company Thirty Madison in 2022.\n\nShe's also an executive partner at the healthcare-focused VC firm Flare Capital Partners, primarily advising new and existing investments. She's using her experiences as a founder and an investor to keep Zeal AI lean and focused on driving meaningful consumer growth, even amid market volatility. \"Now is a really awesome time to build if you can manage your burn because there is going to be less competition,\" she said.\n\n12. Aileen Lee\n\nCowboy Ventures\n\nFounder and managing partner, Cowboy Ventures\n\nNotable investments: Branch, Dollar Shave Club, Drata, Ironclad, Guild, Mutiny Software\n\nCity: Palo Alto, California\n\nIt's been over a decade since Lee coined the term \"unicorn,\" the once-rare feat for startups worth over $1 billion. She left Kleiner Perkins in 2012 to start her own firm, Cowboy Ventures, to invest in pre-seed to later-stage startups. Since then, a few of Lee's notable exits include Dollar Shave Club, which sold to Unilever for $1 billion in 2019, and Trendyol, which Alibaba acquired for almost $750 million in 2018.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nLee told BI that she loves meeting founders who are \"learning animals\" and have a keen desire to build relationships, absorb information, and grow quickly.\n\n\"We don't require product market fit or even a fully built product to want to invest in a team. We look for a unique insight into an underestimated category, and also pedigree, or a vision, for a way better solution to an existing huge problem,\" she said.\n\n13. Ling Wong\n\nFounder, CEO, and general partner, Highbury Group\n\nNotable Investments: Anacor Pharmaceuticals, Visterra, Slack, Guardant Health, Singular Genomics, ScienceIO\n\nCity: Seattle\n\nWong founded Highbury Group in 2013. She invests in science-driven startups, though she has backed some major SaaS players, such as Slack, as well.\n\nHer technical background helps her assess some of the most technical startups. Wong got her masters and a doctorate in applied sciences, bioengineering, entrepreneurship, and global health from Harvard University and bachelor's degrees in chemical engineering and biology from the Massachusetts Institute of Technology.\n\n14. Sara Deshpande\n\nSara Deshpande\n\nGeneral partner, Maven Ventures\n\nNotable investments: Hello Heart, Daybreak Health, Medeloop, Wildtype, Carrot Fertility, Gondola AI\n\nCity: San Francisco\n\nDeshpande has been building Maven Ventures alongside its CEO, Jim Scheinman, since 2014. At Maven, she makes seed investments in companies capitalizing on emerging consumer trends, from areas like fertility care (Carrot Fertility) to sustainable seafood (Wildtype). She said she's known for her \"tough love\" approach with founders. \"I try to be the most honest voice they can have about the risks and opportunities related to the company they're pursuing,\" she said.\n\nDeshpande is also a board observer at Daybreak Health and Medeloop. Beyond her day job at Maven, she helps teach a course at Stanford Graduate School of Business called Startup Garage, where students devise and stress-test new business ideas. In fact, she invested in Medeloop after its founder got the idea for the AI-powered medical research platform based on Deshpande's advice during the course.\n\n15. Gale Wilkinson\n\nGale Wilkinson\n\nManaging partner, Vitalize Venture Capital\n\nNotable investments: Elevate K-12, Groundfloor, Placer.ai, Upwage, Upwards, Statusphere\n\nCity: Chicago and Nashville, Tennessee\n\nWilkinson invests in companies working to change how we work. That focus paid off big time during the pandemic as companies moved dramatically toward digital channels. To date, she's invested in over 100 companies and deployed more than $70 million in capital.\n\nOne of Wilkinson's portfolio crown jewels is Placer.ai, a startup that turns location data into market research for companies. Last year it crossed $100 million in annualized revenue.\n\n16. Elizabeth Weil\n\nElizabeth Weil\n\nFounder and managing partner, Scribble Ventures\n\nNotable Investments: Whatnot, Stoke Space, Omni, Certn, Lemi, Streamline AI\n\nCity: San Francisco\n\nA former Twitter exec and partner at Andreessen Horowitz, Weil cofounded Scribble Ventures in 2020. But she's been investing for well over a decade, making over 100 angel investments across all stages, including in Slack, SpaceX, Figma, Coinbase, Superplastic, Gusto, Tipalti, Envoy, Daily, and Carta. At Scribble, Weil invests in pre-seed and seed rounds and will write initial checks of up to $1.5 million.\n\nThe rocket developer Stoke Space, one of Scribble's early investments, is preparing its initial launch plans at Cape Canaveral in Florida after being awarded the launchpad space by the US Space Force. The startup also just announced a $260 million Series C round in January, with the launch site to be ready by the end of the year. \"We dig in with our founders on product, hiring, and go-to-market because these are the two most precarious — and pivotal — elements of early-stage success,\" Weil said.\n\n17. Juliana Garaizar\n\nJuliana Garaizar\n\nVenture partner, Porfolia and ClimaTech Global Ventures\n\nNotable Investments: Cemvita Factory, Syzygy Plasmonics, Canela Media, Kauel, Suma Capital, Portfolia\n\nCity: Houston\n\nGaraizar invests with ClimaTech Global Ventures, a firm that invests in early-stage, cross-border startups using AI in the climate tech space. She's also a partner at Portfolia, a firm based in San Mateo, California. Previously, Garaizar was the chief development and investment officer at Greentown Labs, a climatetech startup incubator. One of her investments, Cemvita Factory, is a biotechnology startup that converts carbon dioxide into compounds to make products like oil.\n\nWhen asked about the future of her portfolio, Garaizar was enthusiastic about its opportunities for overseas expansion: \"I am very excited about the international expansion of my portfolio companies such as Cemvita Factory in Brazil, Canela Media in Latin America and Spain, and Kauel in Europe,\" Garaizar told BI.\n\n18. Rudina Seseri\n\nRudina Seseri\n\nFounder and managing partner, Glasswing Ventures\n\nNotable investments: Basetwo, Reprise, Ship Angel, Telmai, Verusen\n\nCity: Boston\n\nSeseri and her firm, Glasswing Ventures, know how to cut through the hype and find companies designed with artificial intelligence at its core, not as an afterthought. She leads the firm's investments in startups harnessing this tech to drive measurable value and enterprise growth.\n\nShe also sits on boards including Basetwo, a low-code platform for manufacturing engineers, and Reprise, an Iconiq Growth-backed startup that helps companies create software demos.\n\nSeseri spent her early career at Credit Suisse and Microsoft, where she was a senior manager in corporate development and led several successful acquisitions.\n\n19. Enke Bashllari\n\nEnke Bashllari\n\nFounder and managing director, Arkitekt Ventures\n\nNotable investments: Mural Health, CertifyOS, Paradromics, Nanite, Cofertility, Handspring Health\n\nCity: New York\n\nBashllari launched Arkitekt Ventures in 2017 to back early-stage startups advancing human health. A neuroscientist by training, she's invested in dozens of startups across healthcare and biotech, from the egg donation startup Cofertility to the gene delivery company Nanite to the brain implant maker Paradromics. She's an advisor for Harvard Business School's dual MBA and Master of Science life sciences program, having received multiple degrees herself — an MBA from Harvard and a Ph.D. from Columbia University.\n\nShe said evaluating founder-market fit is particularly critical in life sciences investments. \"These legacy industries have deeply entrenched structures and complexities — it's crucial for founders to truly understand the nuances of the space, the market dynamics, and stakeholder incentives to successfully build and scale their company,\" she said.\n\n20. Lan Xuezhao\n\nLan Xuezhao\n\nFounder and managing partner, Basis Set\n\nNotable investments: Quince, Sakana, Workstream, Ergeon, Rasa\n\nCity: San Francisco\n\nXuezhao studied the human mind for her doctorate in psychology at the University of Michigan. Little did she know that studying psychology would be useful for investing in AI, which is programmed to mimic how a human brain works.\n\nXuezhao is something of a sage when it comes to AI investing. When she started her firm, Basis Set Ventures, in 2017, few other venture capitalists focused on the field. She's among the early investors in startups including Quince, Sakana and Workstream. Before getting into venture capital, Xuezhao built out the corporate development strategy team at Dropbox, using her years of experience at McKinsey helping tech companies with their growth strategies.\n\n21. Ann Miura-Ko\n\nFloodgate\n\nCofounding partner, Floodgate\n\nNotable investments: SmarterDx, Roo, Hebbia, Nooks, Thinkful, Studio, Emotive\n\nCity: Menlo Park, California\n\nMiura-Ko, who has a Ph.D. from Stanford and is a lecturer there, has been dubbed \"one of the most powerful women in startups.\" As the cofounding partner of the seed-stage VC firm Floodgate, Miura-Ko and the firm made early bets on Lyft, Twitter, Twitch, and Okta. Her passion for technology started when she was a child, inspired by her father's work as a rocket scientist at NASA, and continued during her studies at Yale, where she took part in robotics competitions around the world.\n\nHer recent early investments are gaining traction. In the past year, the AI document search startup Hebbia has raised $130 million in a funding round led by A16z. As for what Miura-Ko is interested in investing in, she told BI: \"We're excited about founders that are willing to look beyond immediate efficiency gains and instead envision entirely new ways of working, collaborating, and creating value through AI.\"\n\n22. Jenny Lefcourt\n\nFreestyle\n\nGeneral partner, Freestyle\n\nNotable investments: Discord, BetterUp, Crexi, Artera, Narvar\n\nCity: San Francisco\n\nLefcourt is a two-time founder (WeddingChannel.com and Bella Pictures) and a partner at Freestyle, an early-stage venture firm that's sector agnostic and leads seed rounds with funding between $2 million and $4 million.\n\nAs one of the few women to ascend to the highest ranks of venture capital, she cofounded All Raise, a nonprofit dedicated to increasing diversity in tech.\n\nIn the past year, she invested in Payman, which enables AI agents to move money safely, and Keebler Health, which specializes in AI-driven solutions for healthcare providers.\n\n\"Given how quickly AI is evolving, I look for founders who are constantly learning and can react fast to harness AI for maximum impact,\" Lefcourt told BI.\n\n23. Yun-Fang Juan\n\nYun-Fang Juan\n\nGeneral partner, Brighter Capital\n\nNotable investments: Creatify, Little Otter, Expo, Chowdeck, Reddit\n\nCity: Cupertino, California\n\nJuan was one of the first 150 employees at Facebook, where she co-created Facebook Ads. She then worked at several startups, including Khan Academy, before she took the ultimate entrepreneurial plunge and founded Fundastic, which looked to provide small businesses with information on funding options.\n\nJuan previously told BI that even though Nav bought her company in 2015, the windfall wasn't massive, and she considered it a failure. But she said she gained valuable perspective from the experience that had helped her guide other startup founders as an investor.\n\nJuan said she really admired what the AI startup Perplexity was doing and wished she were an investor. \"I am basically looking for founders who are like the Perplexity team, and I will just give them the money and have them figure things out,\" she said.\n\n24. April Underwood\n\nApril Underwood\n\nManaging director and cofounder, Adverb Ventures\n\nNotable investments: Particle, Untold, Shotsy\n\nLocation: San Francisco\n\nUnderwood is the embodiment of a builder VC, having held product, partnership, and engineering roles at Slack, Twitter, Google, and Intel. While at Twitter, Underwood started investing in startups through #Angels and personally backed companies like Color, Cue Health, and Carta. She also sits on the boards of Zillow Group and Eventbrite.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nIn 2023, Underwood teamed up with her fellow Twitter alum Jessica Verrilli to form Adverb Ventures, a $75 million fund focused on early-stage investments. One of Adverb's recent investments, Shotsy, a GLP-1 companion app, breezed past $1 million in subscription revenue in under nine months on the market, Underwood said. As for what she looks for in a founder, Underwood said: \"Founders who roll up their sleeves and just start building before waiting for permission get me excited.\"\n\n25. Leah Solivan\n\nLeah Solivan\n\nGeneral partner, Fuel Capital\n\nNotable investments: Pacaso, Upwards, Collaborative Robotics, MiSalud\n\nCity: San Francisco\n\nSolivan founded TaskRabbit in 2008 and was CEO of the online marketplace for freelance laborers for nearly eight years before it was acquired by Ikea in 2017. That year, she joined Fuel Capital, where she has helped fund Pacaso, a vacation coownership company, and Upwards, formerly known as Weecare, one of the largest childcare networks in the US.\n\n\"I look for founders who are obsessed with solving a specific problem because he or she has a personal connection to it,\" Solivan told BI. \"We call it founder-market fit.\"\n\n26. Emily Kirsch\n\nEmily Kirsch\n\nFounder and CEO, Powerhouse\n\nNotable Investments: Amperon, Pearl Street Technologies, Terabase, Presto, ThinkLabs, Tyba\n\nCity: Oakland, California\n\nKirsch has been interested in climate policy for nearly two decades. She began her career working for the Ella Baker Center for Human Rights, where she worked with local California businesses on the state's Energy and Climate Action Plan. In 2018, she founded Powerhouse Ventures, which works with global corporations such as Google and The Rockefeller Foundation to back climate-focused, seed-stage startups working on decarbonization efforts.\n\nIn 2019, she was elected a Young Global Leader by the World Economic Forum and began serving on the advisory board for the New York State Energy Research and Development Authority, which supports the development of clean tech innovation and programming in New York.\n\nWhen assessing founders, Kirsch opts for those with strong technical prowess and a differentiated approach to a major bottleneck. Her biggest win so far in 2025 has been the energy SaaS company Enverus' acquisition of the automation interconnection solutions company Pearl Street Technologies, Kirsh told BI. \"Their CEO David embodies exactly the kind of founder we love to back — understated, brilliant, and deeply technical.\"\n\n27. Noramay Cadena\n\nNoramay Cadena\n\nManaging partner, Supply Change Capital\n\nNotable Investments: FoodReady, Cargologik, Hyfé, Michroma, Canela Media, Terrantic\n\nCity: Los Angeles\n\nCadena is an engineer turned investor. She studied engineering at the Massachusetts Institute of Technology and began her career at Boeing, eventually leading a team that coordinated support for 400 mechanics on one of the first 787 airplanes. At Supply Change Capital, Cadena invests in environment, health, and diversity-focused startups, according to its website.\n\n\"This is a critical time to invest in technology across the food supply chain as a driver for health, consumer preference and efficiency,\" Cadena told BI. \"Food safety, nutrition, and cost of goods are top of mind for all stakeholders and Supply Change Capital invests in infrastructure technologies to improve the flow of data and goods.\"\n\n28. Alice Zhang\n\nAlice Zhang\n\nCofounder and CEO, Verge Genomics\n\nNotable investments: Osmind, Asher Bio, Arpeggio, Encellin, Multiply Labs\n\nCity: San Francisco\n\nZhang has spent the past decade building the biotech startup Verge Genomics to use AI for better, faster drug discovery. Since then, Verge has raised $180 million from top firms including BlackRock, Merck Global Health Innovation Fund, and Y Combinator. The startup also notched a deal with the pharma giant Eli Lilly in 2021 to develop drugs for the neurodegenerative disease amyotrophic lateral sclerosis, or ALS.\n\nAs an angel investor, she's backed the immunotherapy-focused biotech startup Asher Bio, which raised a $55 million Series C in April 2024, and the biopharma robotics startup Multiply Labs, which notched an $85 million contract with the Sam Altman-backed Retro Biosciences in May 2024.\n\n29. Lu Zhang\n\nLu Zhang\n\nFounder and managing partner, Fusion Fund\n\nNotable Investments: Otter.ai, Proscia, Subtle Medical, You.com, Vectara, Lepton AI\n\nCity: Palo Alto, California\n\nZhang's Fusion Fund, which invests in healthcare and enterprise AI startups, celebrated its 10th anniversary this year and closed a $190 million fund, roughly $40 million oversubscribed, bringing its total assets under management to more than $500 million. \"It's a key milestone that reflects our decadelong commitment to backing technical founders building transformational companies,\" Zhang told BI.\n\nZhang sold her healthcare startup, Acetone, which made medical devices for testing type 2 diabetes, and founded Fusion Fund by the age of 25. In 10 years, Fusion Fund has invested in at least five unicorns, such as the food tech startup GrubMarket and the DNA analysis company Element Biosciences, as well as cutting-edge AI startups including You.com and Otter.ai.\n\n30. Linda Xie\n\nLinda Xie\n\nCofounder, Scalar Capital\n\nNotable investments: Farcaster, dYdX, StarkWare, Zora, Sardine, Pulley\n\nXie invests in crypto companies alongside working her day job as the developer ecosystem lead at Farcaster. One of Xie's early bets, Sardine, recently raised $50 million in Series B funding. Xie highlighted her in-depth experience in the crypto industry as helping her as an investor.\n\n\"I've been working in crypto full time for 11 years, so have seen a lot and found that I'm often able to help founders most as a sounding board, share what else I'm seeing out there, and help make connections to others in the ecosystem,\" Xie said.\n\n31. Jana Messerschmidt\n\nCourtesy of Jana Messerschmidt\n\nFounding partner, #ANGELS\n\nNotable investments: Vanta, Anchorage, Roam, Lovevery, Daydream, Ashby\n\nCity: San Francisco\n\nBefore becoming a venture capitalist, Messerschmidt worked in tech at companies including Netflix and Twitter, now X, where she spent six years as its vice president of global business development and platform. A few years after leaving Twitter, she joined Lightspeed Venture Partners as a partner.\n\nIn 2015, she cofounded #ANGELS, a venture capital firm founded by former female tech execs that works to close the gender gap among investors and founders.\n\n32. Julie McDermott\n\nJulie McDermott\n\nStartup investor and advisor\n\nNotable investments: Hazel AI, Queen of Raw, Kernal Biologics, Orda, TomoCredit, Conekta\n\nCity: New York\n\nAfter a decadelong career on Wall Street as a bond trader, McDermott decided to turn her attention to the tech startup world. She's since become known as an advocate for female founders and an active angel investor. She was an early backer of Maven, a women's digital-healthcare company last valued at $1.7 billion in 2023. (McDermott sold her stake in 2020.)\n\nMcDermott has focused on other investments in sustainability, biotech, and fintech, such as the startups Conekta and Eggschain. Later this year, she plans to turn more attention to ocean tech startups, which she sees as a \"huge opportunity.\"\n\n\"I often look for companies that are moving the needle in an impactful way for society,\" she told BI.\n\n33. Caroline Casson\n\nCaroline Casson\n\nSeed investor\n\nNotable investments: AllVoices, Elevate K-12, Lunch, Placer.ai, WorkMade, Zingtree\n\nCity: Madison, Wisconsin\n\nCasson bets on founders with big ideas about how the workforce can work better. Her portfolio includes WorkMade, a fintech helping freelancers keep track of their earnings and pay taxes, and Elevate K-12, an edtech company working to address the nationwide teacher shortage.\n\nCasson cut her teeth as an investor at GE Ventures, where she helped incubate and operate a startup in the drone space. Then she went to IrishAngels, an angel network of Notre Dame-affiliated investors, before settling in at the seed-stage venture fund, Vitalize Venture Capital.\n\nShe recently left Vitalize after over six years to pursue a new, unannounced opportunity.\n\n34. Serena Williams\n\nSerena Williams of Serena Ventures Serena Ventures\n\nManaging partner, Serena Ventures\n\nNotable investments: Chatdesk, Daily Harvest, Esusu, MasterClass, Rebel\n\nCity: Jupiter, Florida\n\nWhen Williams took a step back from tennis in 2022, she jumped into investing with both feet. The tennis champ raised a massive $111 million fund, a testament to her relationships and competitive edge. Williams invests in consumer brands and software companies that positively impact \"the everyday lives of everyday people,\" she said during an event late last year.\n\nHer firm stands apart from traditional investors because it focuses on underestimated founders. According to a spokesperson, around half of the portfolio companies were founded by women.\n\n35. Cyan Banister\n\nFounders Fund\n\nCofounder and partner, Long Journey Ventures\n\nNotable investments: AtoB, Roadster, Forge, IRL, ClassPass\n\nCity: San Francisco\n\nBanister has been seed investing for more than a decade and has backed SpaceX, Uber Technologies, and DeepMind. She was previously a partner at Founders Fund and worked at AngelList. She recently raised a $181 million fund with Arielle Zuckerberg for their firm, Long Journey.\n\nBanister told Bloomberg that Long Journey aims to \"look for those magically weird people and to find them before it becomes consensus.\" \"There's always a pocket of dreamers and weirdos. You just have to know where to look,\" Banister said.\n\n36. Maria Salamanca\n\nMaria Salamanca\n\nPartner, Ulu Ventures\n\nNotable investments: Parfait, Career Karma, Maximus, Pine Park Health, KaiPod\n\nCity: San Francisco\n\nBefore joining Ulu Ventures in 2022, Salamanca was a partner at Unshackled Ventures, where she focused on seed investing in teams with immigrant founders. From 2015 to 2022, Salamanca helped make more than 75 seed investments at Unshackled. She was also an early team member at FWD.us, an immigration lobbying group founded by Mark Zuckerberg, Bill Gates, and other tech leaders.\n\nWhen asked what she looks for in a startup before she invests, Salamanca said she assesses how they will use time, not money. \"I look for speed of execution, relentless prioritization, and the ability to define the toughest problems that must be solved to de-risk and unlock the next phase of the company,\" Salamanca told BI.\n\n37. Holly Liu\n\nHolly Liu\n\nCofounder and managing partner, PKO Investments\n\nNotable investments: Crypto Art House, Jadu, Lootex, NZXT, Playhouse, Quidd\n\nCity: San Francisco\n\nLiu founded the mobile game company Kabam in 2006, and she grew the startup for more than a decade until it was acquired for $1 billion in 2017 by South Korea's NetMarble Games.\n\nSince 2021, Liu has been running PKO Investments, the VC fund she cofounded that focuses on early-stage startups at the intersection of tech and entertainment in sectors including the metaverse, Web3, crypto, the creator economy, gaming, and social media. So far her fund has raised more than $27 million from over 370 investors, and written checks to 33 startups, including Roboto Games, Lovo, and Pixels.\n\n38. Karin Klein\n\nKarin Klein\n\nFounding partner, Bloomberg Beta\n\nNotable investments: Anagram, Atolio, Bluefish, Campus, MelodyArc, Shield AI\n\nCity: New York\n\nKlein is the founding partner of Bloomberg Beta, the venture arm of Bloomberg. Before helping to launch the firm, she led several initiatives at Bloomberg.\n\nShe previously worked at SoftBank, leading the division that reviewed new investments and VC firms MC Group and Knowledge Universe.\n\nBloomberg Beta has been at the forefront of AI, investing in the space long before it was in vogue. She continues to be excited about this area. \"As a firm that has been investing in the future of work since 2013 and AI since 2014, it's rewarding to see new opportunities continue to emerge that make work better,\" Klein told BI.\n\nShe highlighted startups such as Bluefish, which helps brands navigate the new world of LLMs, Folio, which enables employers to hire job-ready students, and Synaptic, which uses AI agents to optimize Salesforce integrations.\n\n39. Nisha Dua\n\nNisha Dua of BBG Ventures Nisha Dua\n\nCofounder and managing partner, BBG Ventures\n\nNotable investments: Spring Health, SuperCircle, Starface, Millie, HopSkipDrive, Nara Organics\n\nCity: New York\n\nDua tried on many hats throughout her career before settling on venture capital. She spent six years as an M&A lawyer at the Australian law firm Blake Dawson before moving to Bain & Co. as a management consultant, and then to the internet provider AOL, where she managed its pop culture website Cambio.\n\nAt AOL, Dua created Built by Girls, a software platform that connected young women with tech professionals. Then, backed by AOL, she cofounded BBG Ventures, using that acronym to invest in companies with one or more female founders.\n\nBBG Ventures spun out of AOL in late 2018. The firm now invests at the pre-seed and seed stages in often overlooked founders tackling areas like healthcare, education, and financial security. Spring Health, which Dua first backed in 2018, raised a $100 million Series E round at a $3.3 billion valuation in July.\n\n40. Hayley Barna\n\nHayley Barna\n\nPartner, First Round\n\nNotable investments: Mirror, Caper, Alma, Studs, Arbor, Brellium\n\nLocation: New York\n\nAfter a stint in management consulting at Bain, Barna cofounded the subscription company Birchbox in 2010. She moved over to the investing side in 2016 to join First Round Capital to lead its New York office, where she has focused on commerce, supply chain, climate, and healthcare.\n\n\"Right now, I'm most excited about a wave of seed-stage companies (still in stealth) applying AI to transform healthcare operations and patient experience,\" Barna told BI. \"These founders are tackling real-world pain points with potential for outsized impact on cost and quality of care.\"\n\nInteractive development by Annie Fu and Randy Yeip."
    },
    {
        "title": "SavvyMoney broadens fintech offerings with CreditSnap acquisition",
        "description": "SavvyMoney calls the deal a “significant milestone” as it endeavours to develop a digital-first unified platform.",
        "url": "https://www.retailbankerinternational.com/news/savvymoney-acquires-creditsnap/",
        "source": "Retailbankerinternational.com",
        "publishedAt": "2025-05-13T13:32:22Z",
        "full_text": "SavvyMoney is a credit score services provider. Credit: Thx4Stock team/Shutterstock.\n\nSavvyMoney, a provider of credit score services, has acquired fintech firm CreditSnap for an undisclosed amount.\n\nCreditSnap’s integrations support digital loan, deposit, and account onboarding solutions tailored for banks and credit unions.\n\nSavvyMoney calls the deal a “significant milestone” as it endeavours to develop a digital-first unified platform.\n\nBy incorporating CreditSnap’s technology, SavvyMoney intends to enhance its partnerships with existing loan origination systems and account opening frameworks.\n\nFinancial institutions will now have the opportunity to provide a comprehensive experience by combining SavvyMoney’s “demand-generation” features with CreditSnap’s adaptable integration methods, the credit score solutions provider said in a statement.\n\nThis collaboration seeks to enhance the overall consumer experience in financial services.\n\nGlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence\n\nSavvyMoney president and CEO JB Orecchia said: “This is a pivotal moment in SavvyMoney’s journey.\n\n“Our financial institution partners are looking for ways to grow without adding operational burden.\n\n“By combining SavvyMoney’s ability to drive high-intent demand with CreditSnap’s flexible integration solution, we’re delivering a comprehensive digital experience for both lending and deposit growth—one that works with, not against, their existing systems.”\n\nCreditSnap’s technology is said to have already assisted banks and credit unions in modernising their digital origination processes.\n\nThe integrated platform is designed to align “seamlessly” with current lending and deposit systems.\n\nThis enables financial institutions to enhance their consumer experience without necessitating a complete revamp of existing infrastructures.\n\nCreditSnap CEO Deepak Polamarasetty said: “We built CreditSnap to help financial institutions deliver the digital experiences today’s customers expect by leveraging current integrations along with proprietary technology.\n\n“Joining SavvyMoney allows us to offer a true end-to-end integrated solution that meets the needs of our partners and their solution providers at scale.”"
    },
    {
        "title": "US fintech firm Chime files for IPO",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_060748c0-1c0f-4c85-939e-ae6cb3131686",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-05-14T13:34:29Z",
        "full_text": ""
    },
    {
        "title": "Cybersecurity in Finance: Proven Ways to Protect Your Digital Assets",
        "description": "The financial industry forms one of the most prone to cybercrime activities because of its dynamic nature. It can be a startup like fintech, a big bank or even a normal person using an online banking service. As finances are moving more towards automation, th…",
        "url": "https://www.noupe.com/business-online/cybersecurity-in-finance.html",
        "source": "Noupe.com",
        "publishedAt": "2025-05-16T12:03:35Z",
        "full_text": "The financial industry forms one of the most prone to cybercrime activities because of its dynamic nature. It can be a startup like fintech, a big bank or even a normal person using an online banking service. As finances are moving more towards automation, the requirements for cybersecurity technologies increase and are no longer optional.\n\nIt is not about securing data alone; Cybersecurity within finance also covers the trust aspect, risk management, and protection on the financial infrastructure of people and businesses.\n\nThe Role of Cybersecurity in Digital Finance\n\nThe fast pace at which the financial services world is advancing due to digitization: online banking, e-wallets, cryptocurrency, and robo-advising makes it easier to control finances. Great progress comes with great responsibility.\n\nWhy cybersecurity matters in finance:\n\nData protection : Financial institutions handle sensitive customer data such as personal identity, income, transaction history, and credit card details.\n\n: Financial institutions handle sensitive customer data such as personal identity, income, transaction history, and credit card details. Customer trust : A single breach can shake public confidence and result in massive reputational damage.\n\n: A single breach can shake public confidence and result in massive reputational damage. Regulatory compliance: Global regulations like GDPR, PCI-DSS, and RBI cybersecurity guidelines enforce strict data protection standards.\n\nThe average cost of a data breach in the finance sector is $4.88 million according to an IBM report. This value exceeds the global average for different industries. Hence, investment in cybersecurity becomes essential to protect financial institutions.\n\nKey Challenges in Financial Cybersecurity\n\nEven with cyberspace created and expanding technology, financial institutions are having access issues on how to best protect digital assets. Here are some challenges that concern these institutions:\n\n1. Legacy Systems\n\nNumerous traditional banks still haven’t upgraded their IT infrastructures due to the costs still being too high to bear and it not being able to support modern cyberattacks. Because these systems are increasingly difficult to patch and upgrade with newer security tools, cyber vulnerabilities remain unprotected.\n\n2. Insider Threats\n\nEmployees, vendors, contractors, and other third-party associates having sensitive data can be a problem, either at their intention or their negligence. According to Verizon's 2025 Data Breach Investigation Report, insider threats make up more than 30 percent of all data breaches.\n\n3. Third-Party Risks\n\nIn most cases, financial companies partner with external companies that provide different services, including customer support, cloud storage, or payment processing. If such third-party clients do not have proper security measures, they become the weakest link to your chains.\n\n\n\nIncorporating a robust Third-Party Risk Management program is vital to identify and mitigate potential vulnerabilities introduced by these partnerships. By continuously monitoring and assessing third-party security practices, financial companies can ensure that their external partners uphold the same level of security measures, thereby strengthening their overall cybersecurity posture.\n\n4. Lack of Cybersecurity Awareness\n\nOne of the biggest reasons sensitive data security systems are breached is due to human error. Mishandled phishing emails, uninspired weak passwords, and careless data manipulation can result in losses that are hard to quantify.\n\n5. Gaps in Business Communication\n\nEffective business communication is critical when responding to cyber threats, especially across departments and external partners. Miscommunication or delayed information sharing can slow down incident response and worsen the impact of a breach.\n\nEvolving Cybersecurity Threats in Finance\n\nCybercriminals are constantly changing their strategies, and businesses in the finance sector need to keep up. Some of the more recent threats we face today are as follows:\n\nRansomware Attacks\n\nHackers demand an organization to pay a ransom using cryptocurrency to unlock their data. Reports indicate that by 2023, 72.7% of financial institutions globally said that they had been victims of a ransomware attack.\n\nPhishing Scams\n\nEmails and messages that pretend to be from legitimate organizations and try to access sensitive data from employees or clients is, unfortunately, one of the oldest tricks in the book and is very common. Phishing still remains the most widely used attack vector.\n\nAPI Vulnerabilities\n\nAs open banking rises in popularity, APIs have come to the forefront. In the quest to capture more business, private financial information is being shared through unsecured APIs, which can be hacked easily.\n\nDeepfake Fraud\n\nWe are seeing corporate impersonation through AI-simulated deepfakes of the executives’ audio and video. These identity based social engineering attacks are becoming more prevalent every day.\n\nCrypto-Related Threats\n\nWith the increasing popularity of cryptocurrencies comes another set of security threats including wallet hacks, breaches of crypto exchange, and cryptojacking.\n\nFraud Prevention: A Key Component of Financial Security\n\nFraud prevention is an aspect of cyber security, and vice-versa. Detection, and more importantly, prevention of fraudulent activity is vital for ensuring economic stability and increasing consumer confidence.\n\nAdvanced Threat Detection Tools\n\nFinancial institutions are taking advantage of AI and machine learning features to monitor for suspicious actions in real time. These instruments evaluate user activity and report suspicious behavior before it could pose a danger.\n\nExample: The system can block access if someone who usually logs into a customer account in New York attempts to log in from Russia.\n\nMulti-Factor Authentication (MFA)\n\nSecurity features like fingerprint scans and OTP verification provide a greater level of security and significantly limit unauthorized access. For automated cyberattacks, Microsoft claims that MFA can block 99.9% of them.\n\nReal-Time Fraud Monitoring\n\nNow banks give the option to receive SMS/email notifications for each transaction done, making it easier for customers to be on the lookout for strange spending patterns and take action promptly.\n\nEncryption and Tokenization\n\nWhen a hacker intercepts information, it can’t be read because data encryption makes it impossible. Sensitive information in digital payment systems is transformed into non-sensitive versions through tokenization.\n\nCybersecurity Training for Staff\n\nRegular training allows employees to identify phishing emails, social engineering threats, and many others. Employees are your first line of defense if they are well informed.\n\nThe Future of Cybersecurity in Finance\n\nWith technology evolving at lightning speed, the future of cybersecurity in finance will be shaped by AI, blockchain, and next-gen encryption. Let's take a look at what's coming next.\n\nZero Trust Architecture\n\nThe Zero Trust model never trusts, instead it always verifies users and devices in their network. This is a change from trust and then verify, to always verify.\n\nQuantum-Resistant Encryption\n\nCurrent encryption methods could be broken by quantum computing. To mitigate possible risks in the future, financial companies are looking into algorithms resistant to quantum computing.\n\nBlockchain for Secure Transactions\n\nSmart contracts along with the distributed ledger technology have the potential to curb transaction fraud and provide verification. This is made possible with blockchain's high level of security due to its decentralized nature.\n\nBiometric Security\n\nThe use of fingerprints, retinas and faces is becoming prevalent in banking applications. Biometrics provide a touch of individuality to the system’s security.\n\nAI-Powered Security Systems\n\nWithout a doubt, AI helps in the detection of fraud, and at the same time, it also assists in predicting risks by analyzing behavioral patterns.\n\nConclusion\n\nWith the rapid transformation in digital finances, it is clear that cybersecurity is no longer a technical challenge, but a business one. This requires the attention of all, including legacy banks and modern fintech companies, to adopt new state of the art security systems, train employees, and increase their knowledge on the constantly evolving threats.\n\nBy applying robust and abundant technology along with policy and security awareness, financial institutions can feel secure in protecting their digital assets while ensuring their customers' trust remains intact.\n\nSurely, the future of finance is computerized. In that future, trust is measured by the currency of cybersecurity.\n\nFeatured Image by Markus Spiske on Unsplash"
    },
    {
        "title": "What SXSW 2025 Revealed About The Future Of Fintech And Finance",
        "description": "The next era of financial services will be dominated by financial institutions that treat fintechs as beneficial partners, not dangerous disruptors.",
        "url": "https://www.forbes.com/councils/forbesagencycouncil/2025/05/29/what-sxsw-2025-revealed-about-the-future-of-fintech-and-finance/",
        "source": "Forbes",
        "publishedAt": "2025-05-29T11:00:00Z",
        "full_text": ""
    },
    {
        "title": "The 30 Under 30 Asia Fintech Founders And Investors Breaking Down Barriers",
        "description": "From micro-investment apps to startup accelerators and early-stage VC funds, this year’s Finance & Venture Capital listees are reshaping their industries.",
        "url": "https://www.forbes.com/sites/catzxwang/2025/05/14/the-30-under-30-asia-fintech-founders-and-investors-breaking-down-barriers/",
        "source": "Forbes",
        "publishedAt": "2025-05-14T21:25:26Z",
        "full_text": ""
    },
    {
        "title": "Indian Fintech Billionaire Harshil Mathur Races To Stay Ahead Of Payments Giants",
        "description": "Razorpay cofounder Harshil Mathur (Class of 2021) found an early niche in India’s online payments market–Now competitors are hot on his heels.",
        "url": "https://www.forbes.com/sites/anuraghunathan/2025/05/14/indian-fintech-billionaire-harshil-mathur-races-to-stay-ahead-of-payments-giants/",
        "source": "Forbes",
        "publishedAt": "2025-05-14T21:26:11Z",
        "full_text": ""
    },
    {
        "title": "Airwallex Bucks The Fintech Winter: Inside The $6.2 Billion Bet On Cross-Border Payments",
        "description": "Airwallex and other cross-border payment fintechs have seemingly bucked the funding collapse in the financial industry. Discover what's behind their success.",
        "url": "https://www.forbes.com/sites/zennonkapron/2025/05/25/airwallex-bucks-the-fintech-winter-inside-the-62-billion-bet-on-cross-border-payments/",
        "source": "Forbes",
        "publishedAt": "2025-05-26T01:43:00Z",
        "full_text": ""
    },
    {
        "title": "Willis unveils new insurance product for fintech companies",
        "description": "The solution has been jointly developed over the past 12 months by Willis' fintech leaders in the UK and the US.",
        "url": "https://www.lifeinsuranceinternational.com/news/willis-insurance-product-fintech-firms/",
        "source": "Lifeinsuranceinternational.com",
        "publishedAt": "2025-05-13T11:41:29Z",
        "full_text": "The policy limits start at GBP/USD/EUR one million for policyholders. Credit: T. Schneider/Shutterstock.\n\nWillis, a WTW business, has launched FinTech Plus, an insurance solution designed specifically for fintech companies facing challenges related to scale, complexity and regulatory changes.\n\nThe solution has been jointly developed over the past 12 months by Willis’ fintech leaders in the UK and the US.\n\nIt is supported by a select group of Lloyd’s syndicates and London-based insurers recognised for their expertise in the sector.\n\nFinTech Plus provides a coverage package that includes directors and officers liability, employment practices liability, professional liability, crime, and cyber event loss and business interruption.\n\nThe professional liability coverage encompasses financial institutions professional indemnity and technology errors and omissions.\n\nThe coverage does not extend to regulatory fines and penalties unless permitted by law, stated WTW.\n\nGlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence\n\nSpecifically for UK and EEA policyholders, FinTech Plus offers reinstatement for account information service providers and payment initiation service providers in accordance with the Payment Services Regulation 2017 (PSD2).\n\nThe policy limits start at GBP/USD/EUR one million for policyholders.\n\nWillis North America fintech industry leader Anthony Rapa said: “FinTech Plus is a testament to our forward-looking approach in FinTech risk management and the strength of our transatlantic collaboration.\n\n“By uniting expertise from both sides of the Atlantic and working with agile, specialist insurers, FinTech Plus is a solution that allows FinTech leaders to innovate fearlessly, with protection designed for how they actually operate.\n\n“Built for C-suite executives, founders and risk professionals – FinTech Plus delivers clarity, confidence and a smarter way to approach risk.”"
    },
    {
        "title": "MAI Capital taps iCapital to power alternatives platform",
        "description": "Cleveland-based wealth management firm MAI Capital Management partners with fintech iCapital to streamline and scale its custom alternative investment...",
        "url": "https://www.privatebankerinternational.com/news/mai-capital-taps-icapital-to-power-alternatives-platform/",
        "source": "Privatebankerinternational.com",
        "publishedAt": "2025-05-06T11:14:14Z",
        "full_text": "MAI Capital taps iCapital to power alternatives platform. Source: Shutterstock\n\nMAI Capital Management, a registered investment advisory firm headquartered in Cleveland, has partnered with global fintech platform iCapital, aimed at scaling its custom alternatives investment platform.\n\nThe collaboration is designed to improve operational efficiency and enhance portfolio management capabilities for MAI’s advisers and high-net-worth clients.\n\nMAI has over five decades of expertise serving high-net-worth (HNW) and ultra-high-net-worth (UHNW) clients, including sports, entertainers, and families, providing comprehensive services such as financial planning, investment management, estate planning, tax strategy, and charity.\n\nA growing part of its offering is the firm’s private markets platform, which includes investments in real assets, private equity, venture capital, hedge funds, and private credit.\n\nThe collaboration makes use of iCapital’s whole technological infrastructure to assist MAI in handling the increasing complexity of alternative investments. Moreover, the platform from iCapital will be incorporated into MAI’s current systems to assist fund finance operations, handle documents, reconcile data, and expedite fund administration.\n\nKurt Nye, MAI’s chief investment officer and managing partner stated: “We took great care in selecting a technology partner to support and scale our alternatives business and felt a natural fit with the team at iCapital. Our focus is to build and manage bespoke portfolios built to preserve and create wealth across generations. With the support of iCapital, our team can now spend more time focusing on our diversified portfolios, balancing risk and deepening client relationships, instead of being bogged down by the operational intensity of alternative investments.”\n\nGlobalData Strategic Intelligence US Tariffs are shifting - will you react or anticipate? Don’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis. By GlobalData Learn more about Strategic Intelligence\n\nIn addition to workflow automation, the integration will allow MAI’s in-house investment professionals to build custom portfolios and conduct due diligence more efficiently. As part of the agreement, iCapital will also take over the management of a set of existing funds currently overseen by MAI.\n\nSteve Houston, managing director and co-head of iCapital Solutions expressed: “We are honoured that the MAI Capital Management team entrusted iCapital to help streamline its workflows and administrative needs within alternatives. As private market allocations become an increasingly important component of diversified investment portfolios, we share a common goal with MAI to help advisers scale without losing sight of what matters, helping their clients achieve better financial outcomes.”\n\nThe move reflects a broader industry trend of employing modern technologies to manage more complicated financial products. It also emphasises the crucial role digital platforms play in assisting registered independent advisers in providing sophisticated private market solutions while preserving a high-touch client experience.\n\nBy partnering with iCapital, MAI intends to provide its advisers with not only administrative help, but also access to a full array of training tools, allowing them to better serve clients as demand for private market exposure grows."
    },
    {
        "title": "The Smartest Fintech Stocks to Buy With $1,000 Right Now",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_979a4ac0-f8a8-4b61-9492-2ec1c2274f56",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-05-18T09:30:00Z",
        "full_text": ""
    },
    {
        "title": "FinTech IPO Index Gains 4.4% as Toast and dLocal Get a Boost on Earnings",
        "description": "Moving into mid-May, the FinTech IPO Index’s 4.4% increase was powered by a string of earnings reports, with digital payments growth seen across Latin America and swelling transaction volumes for buy now, pay later providers and B2B platforms. \nAs PYMNTS repo…",
        "url": "https://biztoc.com/x/8705b98afa4ef3f1",
        "source": "Biztoc.com",
        "publishedAt": "2025-05-16T08:25:39Z",
        "full_text": "Ukraine launched one of the largest drone assaults deep inside Russia, targeting 40+ strategic bombers and air bases, escalating the conflict just before peace talks.\n\nMarket Summary Markets reacted sharply to U.S. tariff hikes, with Asian equities mostly lower while oil prices surged on OPEC+ production decisions. The CE 100 Index climbed 1.7% led by AI stocks, while Dow futures slipped amid tariff worries. Investors remain cautious ahead of mixed economic data and Fed rate cut signals.\n\nFigure of the Day 50% - U.S. steel tariff hike announced by President Trump, doubling previous rates.\n\nNawrocki Clinches Polish Presidency Amid EU Tensions Polish Election Too Close to Call as Runoff Nears Polish presidential election results fuel political tension in Europe, with right-wing Nawrocki narrowly winning and potential impacts on EU relations.\n\nBullish CE 100 Index Rallies 1.7% as AI Stocks Lead Market Recovery Investor enthusiasm for artificial intelligence drives a 1.7% gain in the CE 100 Index, signaling renewed confidence in tech innovation amid trade uncertainties. More on pymnts.com\n\nBearish Trump’s Steel Tariff Hike Sparks Global Market Turmoil Doubling U.S. steel tariffs to 50% rattles Asia-Pacific markets, triggers commodity price jumps, and fuels trade tensions worldwide. More on breakingthenews.net\n\nFBI Probes Targeted Terror Attack in Boulder, Colorado Multiple Injured in Targeted Colorado Attack; Suspect Held Political unrest and terror attacks shake the US, with a targeted terror attack in Boulder, Colorado drawing FBI and White House attention.\n\nRegulatory Impact The Trump administration announces a doubling of steel and aluminum tariffs to 50%, maintains assertive trade policies amid ongoing U.S.-China tensions, and signals regulatory tightening on international tech and defense sectors.\n\nChina Blasts US for Breaking Geneva Trade Deal China Vows Forceful Measures Over US Trade Violations US-China trade tensions persist as China accuses the US of violating trade agreements, escalating diplomatic friction over tech and tariffs.\n\nQuote Inflation fears are alarmist; the U.S. will never default on its debt.\n\n— Treasury Secretary Scott Bessent\n\nTreasury’s Bessent Insists US Will Never Default Bessent Challenges Inflation Alarmism, Defends Trade Tariffs Treasury Secretary Scott Bessent reassures markets claiming US will never default amid ongoing debt ceiling negotiations and tariff disputes.\n\nPoland Swings Right as Nationalist Nawrocki Wins Presidency Poland Exit Polls Show Trump-Backed Candidate Narrowly Ahead European political shifts mark the rise of nationalist leadership in Poland and concerns over future directions within the EU.\n\nUber Exec Details AI Tools Powering Workplace Productivity Anthropic AI Startup Hits Reported $3 Billion Revenue Milestone Tech industry advances AI at work and consumer level, with big names experimenting while debates over AI ethics and productivity continue."
    }
]