[
    {
        "id": "1kdkz18",
        "title": "Is Fintech overcrowded now?",
        "subreddit": "fintech",
        "score": 19,
        "created_utc": "2025-05-03T04:52:57+00:00",
        "url": "https://www.reddit.com/r/fintech/comments/1kdkz18/is_fintech_overcrowded_now/",
        "permalink": "https://reddit.com/r/fintech/comments/1kdkz18/is_fintech_overcrowded_now/",
        "selftext": "There are many firms which offer the same products like 100s of payment type companies, payment service providers, Neobanks which offer exactly the same products with difference in customer interfaces in most cases\n\nIs there still space to innovate or better to not invest into this space?\n\nThe industry ia still growing in term aid investments but not in terms of innovation, agree?"
    },
    {
        "id": "xjmgm0",
        "title": "Why does it seem like people here avoid Fintech roles?",
        "subreddit": "cscareerquestions",
        "score": 507,
        "created_utc": "2022-09-20T22:19:08+00:00",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/xjmgm0/why_does_it_seem_like_people_here_avoid_fintech/",
        "permalink": "https://reddit.com/r/cscareerquestions/comments/xjmgm0/why_does_it_seem_like_people_here_avoid_fintech/",
        "selftext": "I have an interview for a manager role with a leading fintech company tomorrow. The role is finance, but i work in tech and enjoy using this subreddit also. \n\nIt seems like people in this forum largely shy away from fintech roles. Why is that?\n\nCare to share your experience at a fintech company? Anyone enjoy working for a fintech?"
    },
    {
        "id": "1ksh0j1",
        "title": "My Job Switch Journey - Fintech to FAANG",
        "subreddit": "leetcode",
        "score": 642,
        "created_utc": "2025-05-22T03:27:15+00:00",
        "url": "https://www.reddit.com/r/leetcode/comments/1ksh0j1/my_job_switch_journey_fintech_to_faang/",
        "permalink": "https://reddit.com/r/leetcode/comments/1ksh0j1/my_job_switch_journey_fintech_to_faang/",
        "selftext": "*Might not be the right sub, but posting here because this might help someone. This post has become lengthy. If you want to read the leetcode post I made,* [*here it is.*](https://leetcode.com/discuss/post/6768482/my-job-switch-journey-4-yoe-sde-2-backen-kcsh/)\n\nHi all,\n\nI recently concluded my job switch journey.\n\n**About me:** 3y 7m yoe as a backend engineer at a fintech company in India\n\n**Application Stats**\n\n        Stage                                Count\n        -----------------------------------  -----\n        Applied                              65\n        Heard back                           15\n        Ghosted after OA                     3\n        Interviews                           10\n        Ghosted after interviews             4\n        Converted to offer                   2\n        Dropped off from interview pipeline  4\n\nI didn't particularly target FAANG companies. I applied to all kinds: Amazon, Google, Meta (BLR), Microsoft, Motive, Neotap, Target, Databricks, Zeta, etc to name a few.\n\n**LC stats:**  \n36E + 501M + 79H = 616.  \nNote: I genuinely don't think you would need to solve this many, btw.\n\n**Timeline:**\n\n    Dec '24: Started grinding LC vigorously. This was one of my best months tbh. \n    Jan '25: Started applying \n    Feb '25 end to mid Mar '25: Interviews \n    End of Mar '25: Signed OL\n\n**Prep Strategy**\n\n**DSA:** I started with the Neetcode 250 list. In the beginning, 1 simple easy question took around 15 minutes for me because my DSA out of touch after almost 3 years. After that, I practiced topic by topic by sorting them frequency wise. This helped me build confidence.\n\nLC Premium subscription is worth it if you are interviewing for companies like Amazon, Microsoft, LinkedIn, etc.\n\n**LLD:** [This repo](https://github.com/ashishps1/awesome-low-level-design) is all you need. Learn and study design patterns ([this is a good start](https://refactoring.guru/design-patterns)), and start implementing problems one by one from that repo.\n\n**HLD:** I started with [this course](https://www.designgurus.io/course/grokking-system-design-fundamentals) from design gurus to learn the fundamentals. I moved on to read Alex Xu (both volumes) and Hello Interview blogs. Yes, Hello Interview premium subscription is worth the money. I practiced drawing diagrams on pen and paper then moved on to excalidraw.\n\nFor SDE-2 this is enough imo. If you are interviewing for L5+ roles I would suggest reading DDIA, going through [this playlist](https://youtube.com/playlist?list=PLjTveVh7FakJOoY6GPZGWHHl4shhDT8iV&si=IrLdTccM_zBbu6hO) from Jordan Has No Life (great content btw).\n\n# Interview Experiences\n\n**Salesforce - SMTS & Uber - SDE 2:** Ghosted after OA\n\n**Motive - SSE:** Recruiter sent an email asking about onsites availability, but never heard back from her after multiple follow-ups. Their interview process is 1 DSA, 1 HLD, and 1 HM rounds.\n\n**Digital Ocean - SSE:** Cleared OA, DSA, HLD. Got very \"egoistic\" vibes from the interviewer for the HLD round. He interrupted me in b/w multiple times, was not listening to what I was saying. After this round, I wasn't keen to interview with them again, so I dropped off.\n\n**Meesho - SDE 2:** This was one of the companies I interviewed for but wasn't that excited to join because of the work culture. Gave DSA and LLD rounds.\n\n[**Onlinesales.ai**](http://Onlinesales.ai) **- SDE 2:** Like Meesho, these were my \"practice\" interviews. Cleared all their rounds and rejected their offer.\n\n**Jupiter - SDE 2 & Groww - SDE 2:** I heard back from these companies after I received an offer from LinkedIn, so I was upfront with them about the compensation. They were not ready to match it so I didn't interview with them.\n\n**Cred & Neotap - SDE 2:** My first ever LLD round. Failed horribly but it was a good lesson. Was ghosted after that.\n\n[**Observe.ai**](http://Observe.ai) **- SDE 2:** Cleared OA, 2 LLD rounds. Dropped off from the interview pipeline. Their interview process is OA, 2 LLD, 2 HM rounds.\n\n**Google - L4:** Cleared Phone screen. Dropped off from the interview pipeline.\n\nPhone screen happend in early March and onsites were scheduled to happen in mid May. So by that time, my DSA was rusty again.\n\nI know it sounds very stupid, but for me, preparing for Google onsites felt like memorizing solutions from LC discuss section and this is not how I want to prepare for Google. I made a decision to interview with them later, if given a chance -- with much better problem solving skills.\n\n**Hackerrank - SDE 2:** Rejected after HM round. [Experience](https://leetcode.com/discuss/post/6556472/hackerrank-sde-2-backend-interview-exper-6rek/)\n\n**Gojek - SWE:** Received verbal communication about the offer, but was rejected later. [Experience](https://leetcode.com/discuss/post/6536214/gojek-goto-group-sde-2-interview-experie-934r/)\n\n**Coinbase - IC4:** Rejected after onsites. [Experience](https://leetcode.com/discuss/post/6746894/coinbase-ic4-interview-experience-india-eo0b7/)\n\n**LinkedIn - SWE:** Received an offer. [Experience](https://leetcode.com/discuss/post/6549646/linkedin-swe-applications-interview-expe-l8p4/)\n\n**Amazon - SDE 2:** Received an offer. [Experience](https://leetcode.com/discuss/post/6745223/amazon-sde-2-interview-experience-india-1nma0/)\n\nLooking back, I would have made below changes in my job switch journey:\n\n1. Start interview prep much sooner, even if not vigorously, maybe at least 3 problems a day.\n2. Craft a simple, concise (and impactful) message to cold message/email recruiters. I took referrals for only Microsoft and Wayfair and recevied rejects from both of them. Rest all, I applied on careers site or LinkedIn.\n3. Instead of depending solely on leetcode (even though this is enough) for problem solving, do [cses.fi](http://cses.fi) set or atcoder problems to keep my skills sharp.\n4. Read chapters on data replication, partitioning, consistency, batch & stream processing from DDIA.\n5. Learn about the internals of distributed systems.\n\nI have no regrets whatsoever. I still have some time before I join, so I most likely work on the above points.\n\nHappy interviewing, you guys! Good luck!\n\nCheers\\~"
    },
    {
        "id": "1igggjk",
        "title": "I want to work in fintech but do not know how to get started",
        "subreddit": "fintech",
        "score": 8,
        "created_utc": "2025-02-03T04:04:15+00:00",
        "url": "https://www.reddit.com/r/fintech/comments/1igggjk/i_want_to_work_in_fintech_but_do_not_know_how_to/",
        "permalink": "https://reddit.com/r/fintech/comments/1igggjk/i_want_to_work_in_fintech_but_do_not_know_how_to/",
        "selftext": "I am 20F, finance student in 3rd year. Im minoring in public policy and music. I want to work in fintech, but Idk how to go about it. Any advice appreciated."
    },
    {
        "id": "1j1q8t7",
        "title": "Will Fintech be relevant and irreplaceable?",
        "subreddit": "askSingapore",
        "score": 0,
        "created_utc": "2025-03-02T12:56:25+00:00",
        "url": "https://www.reddit.com/r/askSingapore/comments/1j1q8t7/will_fintech_be_relevant_and_irreplaceable/",
        "permalink": "https://reddit.com/r/askSingapore/comments/1j1q8t7/will_fintech_be_relevant_and_irreplaceable/",
        "selftext": "Hi! I have been thinking of a long time and I need some advices. With AI, I am afraid that Fintech will be replaced in the near future. Looking at so many tech jobs reductions, it is really scary. I am afraid that I will not be able to get a job in the future..\n\nI understand that data analysts and data engineering will be the most impacted. What about DevOps and Software engineers?\n\nWith that in mind, should I still change my university degree from (Robotics) Engineering to Fintech? \n\nPlease advise a very troubled university student.\n\nThank you!"
    },
    {
        "id": "1irkg2w",
        "title": "Is Fintech a Good Industry for PMs?",
        "subreddit": "ProductManagement",
        "score": 36,
        "created_utc": "2025-02-17T13:59:49+00:00",
        "url": "https://www.reddit.com/r/ProductManagement/comments/1irkg2w/is_fintech_a_good_industry_for_pms/",
        "permalink": "https://reddit.com/r/ProductManagement/comments/1irkg2w/is_fintech_a_good_industry_for_pms/",
        "selftext": "Hi folks,\n\nI’ve been a Senior PO in a credit team at a fintech company for 7 months (previously in e-commerce). I’m struggling with the way Product operates here and wonder if this is common in fintech.\n\nHow Product Works Here:\n1. Business team owns product strategy & KPIs: They have 5 people whereas PO has 1.5 so that they have the resource to do market research, competitor, analyze data and discover user need. Almost product ideas come from them. They set the priority for roadmap\n2. Team structure: Business, growth, and risk are under the president, whereas product is under head of product. PO works with cell team members but not our PM. My direct manager (PM) and product director are managing more people rather than the product success, strategy. I cannot learn anything from them\n3. The team reports bi-weekly to the president including BU (P&L, revenue, KPI, and partner lender project), Growth (MAU, retention and all activities to growth), and product (features and timelines). This make me feel like product team reports output and other teams report outcomes\n4. This way is what the president wants to run and he trusts BU, not product team\nAll these things make the product team feel like we just execute the idea/feature from BU team, not really own our products. We always emerge ourselves in the deadline, pushed by other team to release feature\n5. They did not share some data and risk rule to Product. They want to product just execute the idea from them. Some key data and risk rules are not shared with the Product team.\n\nMy Concerns:\n1. Is this structure normal in fintech? Do PMs always have less ownership here?\n2. Can PMs drive product strategy in fintech, or is this industry too BU-driven?\n3. Does this setup help or hurt career growth for a PM?\n\nWould love to hear from fintech PMs—how does your company operate?"
    },
    {
        "id": "1ge1ttu",
        "title": "What career paths exist in fintech?",
        "subreddit": "fintech",
        "score": 17,
        "created_utc": "2024-10-28T13:18:54+00:00",
        "url": "https://www.reddit.com/r/fintech/comments/1ge1ttu/what_career_paths_exist_in_fintech/",
        "permalink": "https://reddit.com/r/fintech/comments/1ge1ttu/what_career_paths_exist_in_fintech/",
        "selftext": "I have a passion for finance and programming so naturally I am drawn towards fintech as a possible career path, however I was wondering what actual career paths/roles exist in fintech?\n\nEven though I hear the word “fintech” thrown around a lot I’m not sure what positions people are referring to when talking about fintech. Are these just swe/web dev positions at financial firms or is fintech just financial analyst positions or is it something else completely?"
    },
    {
        "id": "1gyw3b9",
        "title": "What are my chances on getting in to Fintech ",
        "subreddit": "SIT_Singapore",
        "score": 1,
        "created_utc": "2024-11-24T17:17:16+00:00",
        "url": "https://www.reddit.com/r/SIT_Singapore/comments/1gyw3b9/what_are_my_chances_on_getting_in_to_fintech/",
        "permalink": "https://reddit.com/r/SIT_Singapore/comments/1gyw3b9/what_are_my_chances_on_getting_in_to_fintech/",
        "selftext": "I am currently in my final year, last semester of poly and i am wondering my chances in getting into fintech degree course.. \n\nContext: My CGPA now is 3.2 , with internship it should go up to 3.3. I am from a design course so the switch in career is really different but i definitely know that i do not want to have a career in the creative industry thus the switch.\n\nI was wondering during the interview, will they ask for me to share things like portfolio etc , what do i have to prepare in advance to increase my chances in getting in?\n\nAny advice would be greatly appreciated :)"
    },
    {
        "id": "zvzfh4",
        "title": "Best path for Fintech career",
        "subreddit": "FinancialCareers",
        "score": 17,
        "created_utc": "2022-12-26T22:54:33+00:00",
        "url": "https://www.reddit.com/r/FinancialCareers/comments/zvzfh4/best_path_for_fintech_career/",
        "permalink": "https://reddit.com/r/FinancialCareers/comments/zvzfh4/best_path_for_fintech_career/",
        "selftext": "I am currently pursuing a finance degree at a non target university and am wondering what would be a good entry level Fintech job. \n\nAlso, list any certifications that could make it easier to get one of the higher paying/more competitive positions.\n\nThanks"
    },
    {
        "id": "tcjchu",
        "title": "For those in fintech, what made you interested in this field?",
        "subreddit": "cscareerquestions",
        "score": 11,
        "created_utc": "2022-03-12T15:59:07+00:00",
        "url": "https://www.reddit.com/r/cscareerquestions/comments/tcjchu/for_those_in_fintech_what_made_you_interested_in/",
        "permalink": "https://reddit.com/r/cscareerquestions/comments/tcjchu/for_those_in_fintech_what_made_you_interested_in/",
        "selftext": "In a few days I'm going to be asked the inevitable, \"why <insert large fintech company here>\" and I don't know how I should answer it. The honest answer is that I'm a broke new grad and I want a high paying job."
    }
]