[
    {
        "id": "1kgzysd",
        "title": "What just happened to google out of nowhere?",
        "subreddit": "stocks",
        "score": 1287,
        "created_utc": "2025-05-07T15:19:01+00:00",
        "url": "https://www.reddit.com/r/stocks/comments/1kgzysd/what_just_happened_to_google_out_of_nowhere/",
        "permalink": "https://reddit.com/r/stocks/comments/1kgzysd/what_just_happened_to_google_out_of_nowhere/",
        "selftext": "Google dropped in a couple of minutes 5% and is down even more at the time of this post. What just happened? Didnt they just realase a possitive quarter that gained them 2%? What is going on in this market? Someone please update me on this."
    },
    {
        "id": "1kh0ig6",
        "title": "Apple says searches in Google browser fell for the first time in April",
        "subreddit": "wallstreetbets",
        "score": 4292,
        "created_utc": "2025-05-07T15:41:00+00:00",
        "url": "https://www.cnbc.com/video/2025/05/07/apple-says-searches-in-google-browser-fell-for-the-first-time-in-april.html",
        "permalink": "https://reddit.com/r/wallstreetbets/comments/1kh0ig6/apple_says_searches_in_google_browser_fell_for/",
        "selftext": "It's calls for Google. Confirmed. "
    },
    {
        "id": "1kh2nqq",
        "title": "$2m GOOGL YOLO",
        "subreddit": "wallstreetbets",
        "score": 2825,
        "created_utc": "2025-05-07T17:06:57+00:00",
        "url": "https://www.reddit.com/r/wallstreetbets/comments/1kh2nqq/2m_googl_yolo/",
        "permalink": "https://reddit.com/r/wallstreetbets/comments/1kh2nqq/2m_googl_yolo/",
        "selftext": "https://preview.redd.it/vodb6lui5eze1.png?width=915&format=png&auto=webp&s=b811ca72a6416f1987c63523ab4c5831d9d82c13\n\nPosted this as a comment on someone else's post and decided to get some internet points along the way.\n\nGot in between $149-$152 this afternoon. Looking for $153 - $155 EOW.\n\nBe kind, this is hard earned money I'm gambling in my mom's IRA\n\n**UPDATE 5/8/2025:**\n\nhttps://preview.redd.it/0u2jroq0snze1.png?width=902&format=png&auto=webp&s=c1c55c45b210857943e3f646a989aa61eb1efd95\n\nI sold 250 contracts of GOOGL $155 8/15/2025 @ $11.80 today\n\nhttps://preview.redd.it/tpijfue4snze1.png?width=1062&format=png&auto=webp&s=206622b2fd602bd4f8fb145557a878d0ac6820fe"
    },
    {
        "id": "1kh2185",
        "title": "GOOGLE stock presents buying opportunity imo.",
        "subreddit": "investing",
        "score": 513,
        "created_utc": "2025-05-07T16:42:10+00:00",
        "url": "https://www.reddit.com/r/investing/comments/1kh2185/google_stock_presents_buying_opportunity_imo/",
        "permalink": "https://reddit.com/r/investing/comments/1kh2185/google_stock_presents_buying_opportunity_imo/",
        "selftext": "Does anyone else think that the Google sell off today of 9% is really warranted on the news that apple is considering adding AI to Safari? I believe that these AI LLM’s are heading towards commoditization, so what real differentiating factor will Apples introduction of AI into safari really have in disrupting Google? Idk but I’m buying shares here."
    },
    {
        "id": "1k84w88",
        "title": "Google stock is cheap because investors have misunderstood Google Search’s business model",
        "subreddit": "stocks",
        "score": 1144,
        "created_utc": "2025-04-26T04:46:11+00:00",
        "url": "https://www.reddit.com/r/stocks/comments/1k84w88/google_stock_is_cheap_because_investors_have/",
        "permalink": "https://reddit.com/r/stocks/comments/1k84w88/google_stock_is_cheap_because_investors_have/",
        "selftext": "No, Google is not aiming to be the Search Engine for Everything and Anything. That role is slowly getting replaced by AI. Google is trying to be the search engine for everything to do with shopping. Basically, if you want to book a hotel, buy a car, find rental places, you go to Google. If you want to know how big bang started, Google doesn’t give a fuck. If you want to know if that restaurant is good, Google shows you a bunch of reviews. Google Search is a shopping search engine. \n\nDon’t believe me? Try ordinary searches like when did Julius Caesar conquered Gaul or how birds make chirping noises. You will notice zero ads. Now try searching anything with commercial intent, boom, ads, and that’s what advertisers want. Google ads are also somewhat useful to consumers who are looking for certain products. \n\nIn other words, ChatGPT can replace Google Search in terms of Wikipedia knowledge or complex subjects like learning physics. But ChatGPT is not going to replace Google Search’s role as the world’s shopping discovery platform. Basically anything you want to buy, or any product you want to research on, you go to Google. This is why Google Search is still so profitable and why Bing Search who doesn’t have all these data can never compete against it. Do you think people are searching knowledge stuff like Reddit geeks? Nope, people are searching for things to buy. \n\nFor those who claim Google Search is dying because you can’t find answers to your physics or coding questions, you have completely misunderstood Google Search’s role in this world. Google has transitioned to this role a long long time ago and they know adding more commercial ads will make Google Search’s knowledge based searches less useful. \n\nMoreover, Google is also adding AI Overview which makes people who want to search non commercial topics have a much easier time finding what they want. (AI overview is pushed to 1.5 billion users, and Google’s advertising revenue has not seen a dent. This is proof knowledge based searches don’t make Google money.)\n\nGoogle will be adding AI search where you can actually talk to it in Google Search soon. That will certainly keep the knowledge crowd to continue using Google. So even if Google doesn’t care about non commercial searches, it is still doing a lot to maintain its share in knowledge based searches. \n\nTLDR: Google is not a knowledge search engine. It is a shopping search engine and it excels at being one. People use Google as a shopping search engine much more than getting knowledge from it. "
    },
    {
        "id": "1k21mg3",
        "title": "Google's bad year just got worse",
        "subreddit": "wallstreetbets",
        "score": 1634,
        "created_utc": "2025-04-18T10:25:07+00:00",
        "url": "https://finance.yahoo.com/news/googles-bad-year-just-got-worse-morning-brief-100008988.html",
        "permalink": "https://reddit.com/r/wallstreetbets/comments/1k21mg3/googles_bad_year_just_got_worse/",
        "selftext": ""
    },
    {
        "id": "1ff7qbk",
        "title": "Google is not google anymore - culture has become shit",
        "subreddit": "developersIndia",
        "score": 805,
        "created_utc": "2024-09-12T17:07:50+00:00",
        "url": "https://www.reddit.com/r/developersIndia/comments/1ff7qbk/google_is_not_google_anymore_culture_has_become/",
        "permalink": "https://reddit.com/r/developersIndia/comments/1ff7qbk/google_is_not_google_anymore_culture_has_become/",
        "selftext": "I am currently working in Google. This is my second FAANG company. I thought that after coming to Google life will be very good. \n\nBut? The truth is the opposite.\nI been working for more than 12 hours daily or more than that, but still, the expectations are not met. \nMy Manager is keeps telling that there is not enough impact. \n\nThoughts ? \n\nL4 "
    },
    {
        "id": "1gq5ywz",
        "title": "I CLEARED GOOGLE!!!",
        "subreddit": "leetcode",
        "score": 1428,
        "created_utc": "2024-11-13T05:39:09+00:00",
        "url": "https://www.reddit.com/r/leetcode/comments/1gq5ywz/i_cleared_google/",
        "permalink": "https://reddit.com/r/leetcode/comments/1gq5ywz/i_cleared_google/",
        "selftext": "For L3 Early Career, US.\n\nI honestly thought I had failed after finishing the VO. Was holding onto a bit of hope but wasn't optimistic at all. Really surprised and super happy to learn today that I passed HC!!! I've been ghosted by Google for 3 years before this not even getting the OA.\n\nTech 1 - NH/LNH, couldn't even get the brute force solution (LC Med)  \nTech 2 - H, solved optimally w/ verbal solution for followup (LC Med)  \nTech 3 - H/SH, solved optimally w/ dry run & all edge cases (LC Hard)  \nBehavioral - H\n\nI DID IT! so happy rn"
    },
    {
        "id": "1kh7odt",
        "title": "Google Earth updated their images of Gaza to last December",
        "subreddit": "MapPorn",
        "score": 94273,
        "created_utc": "2025-05-07T20:28:10+00:00",
        "url": "https://www.reddit.com/gallery/1kh7odt",
        "permalink": "https://reddit.com/r/MapPorn/comments/1kh7odt/google_earth_updated_their_images_of_gaza_to_last/",
        "selftext": "A few months ago in January, I posted on this sub when Google updated the images to early November 2023. The damage was extensive, but I was definitely cherry-picking the worst areas. Now there are images available from 13 months later, and the scale of destruction is almost incomprehensible. Entire villages have been wiped off the map. In the Netzarim Corridor, there are entire square miles without a single standing building. Just vast networks of damaged roads which lead only to dunes of rubble. It’s more than destruction, it’s utter razing. \n\nThe majority of these are from northern Gaza (Jabalia, Beit Lahia, Beit Hanoun, Gaza City) and the Netzarim Corridor, except for the village of Khuza’a which is in the southeast where the Gazan border juts out. I included a more zoomed out version of the photo of Mughraqa since the damage in the Netzarim Corridor was particularly extensive. In the south, images are only available from June 2024 which is before the large scale demolitions in Rafah began. "
    },
    {
        "id": "1kip919",
        "title": "Mexico sues Google over changing Gulf of Mexico’s name for US users",
        "subreddit": "worldnews",
        "score": 55538,
        "created_utc": "2025-05-09T18:11:36+00:00",
        "url": "https://www.theguardian.com/world/2025/may/09/mexico-google-lawsuit-gulf-of-mexico",
        "permalink": "https://reddit.com/r/worldnews/comments/1kip919/mexico_sues_google_over_changing_gulf_of_mexicos/",
        "selftext": ""
    }
]