[
    {
        "title": "Google loses adtech monopoly case",
        "description": "The US Department of Justice has won its antitrust case against Google, which accused the company of operating a monopoly in the advertising technology industry. In a ruling on Thursday, US District Judge Leonie Brinkema says Google’s anticompetitive practice…",
        "url": "https://www.theverge.com/news/650665/google-loses-ad-tech-antitrust-monopoly-lawsuit",
        "source": "The Verge",
        "publishedAt": "2025-04-17T15:03:39Z",
        "full_text": "The US Department of Justice has won its antitrust case against Google, which accused the company of operating a monopoly in the advertising technology industry. The ruling, which marks Google’s most recent antitrust loss following its Search case, says the tech giant’s anticompetitive practices in two key markets “substantially harmed” publishers and users on the web.\n\n“Plaintiffs have proven that Google has willfully engaged in a series of anticompetitive acts to acquire and maintain monopoly power in the publisher ad server and ad exchange markets for open-web display advertising,” US District Judge Leonie Brinkema writes. “For over a decade, Google has tied its publisher ad server and ad exchange together through contractual policies and technological integration, which enabled the company to establish and protect its monopoly power in these two markets.”\n\nJudge Brinkema found Google “liable under Sections 1 and 2 of the Sherman Act” due to its practices in the ad tech tool and exchange spaces, but dismissed the argument that Google had operated a monopoly in ad networks.\n\n“We won half of this case and we will appeal the other half,” Lee-Anne Mulholland, Google’s vice president of regulatory affairs, said in a statement to The Verge. “The Court found that our advertiser tools and our acquisitions, such as DoubleClick, don’t harm competition. We disagree with the Court’s decision regarding our publisher tools. Publishers have many options and they choose Google because our ad tech tools are simple, affordable and effective.”\n\nSimilar to Judge Amit Mehta’s ruling in Google’s Search case, Judge Brinkema also warned Google over its failure to preserve internal communications, citing an internal messaging app that “deleted records of chats between employees.” She adds that while this “may well be sanctionable,” the court didn’t need to sanction the company in this case as it was able to make its decision using testimony and admitted evidence.\n\nOver the course of three weeks, the DOJ argued that Google illegally monopolized three separate markets in the ad tech space: that for publisher ad tools, advertiser ad networks, and the ad exchanges that facilitate transactions. They also argued that Google illegally tied together their publisher ad server and ad exchange in violation of antitrust law. The upshot, according to the government, is that Google collects monopoly profits at the expense of publishers and advertisers, who have a worse experience with no real alternatives.\n\nGoogle, on the other hand, argued that the government’s whole view of the market was contrived and not based in reality. Google’s tools help publishers and advertisers make money, and the fact that it has tools in different parts of the market just helps them work well together to consumers’ benefit, they said. Google has legitimate business reasons for its behavior and the government simply wants to dictate how it can do business, they argued.\n\nThe decision comes as Google and the DOJ are getting ready to meet in another federal court across the river in DC for the remedies phase of the search trial. In that case, the DOJ under the Biden administration proposed breaking up Google by spinning out its Chrome browser and forcing it to syndicate its search results."
    },
    {
        "title": "Google is going to let kids use its Gemini AI",
        "description": "Google is notifying parents using its Family Link parental controls via email that their kids will soon be able to access Gemini AI Apps on their monitored Android devices, The New York Times reports. The company says kids will be able to use Gemini to do thi…",
        "url": "https://www.theverge.com/news/660678/google-gemini-ai-children-under-13-family-link-chatbot-access",
        "source": "The Verge",
        "publishedAt": "2025-05-03T00:03:07Z",
        "full_text": "is a news writer fond of the electric vehicle lifestyle and things that plug in via USB-C. He spent over 15 years in IT support before joining The Verge.\n\nGoogle is notifying parents using its Family Link parental controls via email that their kids will soon be able to access Gemini AI Apps on their monitored Android devices, The New York Times reports.\n\nThe company says kids will be able to use Gemini to do things like help them with homework or read them stories. Like its Workplace for Education accounts, Google says children’s data will not be used to train AI. Still, in the email, Google warns parents that “Gemini can make mistakes,” and kids “may encounter content you don’t want them to see.”\n\nIn the case of Gemini, Google’s emailed advice says parents should talk to their kids and explain that the AI isn’t human and not to share sensitive information with the chatbot.\n\nKids under 13 will be able to enable and access Gemini all on their own under Google Family Link, which is designed for parents to keep tabs on their kids’ device usage, set limits, and protect them from harmful content. Google spokesperson Karl Ryan confirmed in an email to The Verge that parents can turn off access via Family Link, and that “they will get an additional notification when the young person accesses Gemini for the first time.”"
    },
    {
        "title": "Google announces a special Android event ahead of I/O",
        "description": "Google just announced that it will host a separate event ahead of I/O to discuss updates coming to Android. The Android Show: I/O Edition will land on YouTube and the Android website on May 13th at 10AM PT / 1PM ET and will feature Android ecosystem president…",
        "url": "https://www.theverge.com/news/656589/google-android-event-io-2025",
        "source": "The Verge",
        "publishedAt": "2025-04-25T20:28:40Z",
        "full_text": "is a deputy editor with 18 years of experience writing and editing product reviews, gadgets and business news. Previously, he was a deputy editor covering technology companies at CNBC.\n\nGoogle just announced that it will host a separate event ahead of I/O to discuss updates coming to Android. The Android Show: I/O Edition will land on YouTube and the Android website on May 13th at 10AM PT / 1PM ET and will feature Android ecosystem president Sameer Samat. That’s a full week ahead of Google I/O, which kicks off on May 20th.\n\nIt’s not terribly surprising, given that the company has spent less time talking about Android at I/O. And it’s probably a big hint that we’re going to hear a lot more about Gemini and Google’s other AI efforts throughout the developer conference. Maybe we’ll even get an update on its Project Astra.\n\n“We’ll be sharing news now to get you ready for I/O where we’ll have even more special announcements and surprises in store,” Samat said. The company noted that Android will still have a presence at I/O in keynotes and developer technical sessions.\n\nWhile Android was once the highlight of Google I/O — back when the company unveiled new statues for the new dessert flavor name picked for the next-generation of Android — that’s changed in the past few years. Last year, Google talked about redesigning Search around AI, and how Gemini would integrate across Android phones and services like Docs, Gmail, Calendar."
    },
    {
        "title": "Firefox could be doomed without Google search deal, says executive",
        "description": "Firefox could be put out of business should a court implement all the Justice Department’s proposals to restrict Google’s search monopoly, an executive for the browser owner Mozilla testified Friday. “It’s very frightening,” Mozilla CFO Eric Muhlheim said. Th…",
        "url": "https://www.theverge.com/news/660548/firefox-google-search-revenue-share-doj-antitrust-remedies",
        "source": "The Verge",
        "publishedAt": "2025-05-02T20:01:56Z",
        "full_text": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nFirefox could be put out of business should a court implement all the Justice Department’s proposals to restrict Google’s search monopoly, an executive for the browser owner Mozilla testified Friday. “It’s very frightening,” Mozilla CFO Eric Muhlheim said.\n\nThe DOJ wants to bar Google from paying to be the default search engine in third-party browsers including Firefox, among a long list of other proposals including a forced sale of Google’s own Chrome browser and requiring it to syndicate search results to rivals. The court has already ruled that Google has an illegal monopoly in search, partly thanks to exclusionary deals that make it the default engine on browsers and phones, depriving rivals of places to distribute their search engines and scale up. But while Firefox — whose CFO is testifying as Google presents its defense — competes directly with Chrome, it warns that losing the lucrative default payments from Google could threaten its existence.\n\nFirefox makes up about 90 percent of Mozilla’s revenue, according to Muhlheim, the finance chief for the organization’s for-profit arm — which in turn helps fund the nonprofit Mozilla Foundation. About 85 percent of that revenue comes from its deal with Google, he added.\n\nLosing that revenue all at once would mean Mozilla would have to make “significant cuts across the company,” Muhlheim testified, and warned of a “downward spiral” that could happen if the company had to scale back product engineering investments in Firefox, making it less attractive to users. That kind of spiral, he said, could “put Firefox out of business.” That could also mean less money for nonprofit efforts like open source web tools and an assessment of how AI can help fight climate change.\n\nMozilla would have to make “significant cuts across the company”\n\nIronically, Muhlheim seemed to suggest that could cement the very market dominance the court seeks to remedy. Firefox’s underlying Gecko browser engine is “the only browser engine that is held not by Big Tech but by a nonprofit,” he said. The other two are Google’s open source Chromium and Apple’s WebKit. Mozilla developed Gecko to stave off a fear that Microsoft would control all the protocols on the internet, Muhlheim testified, and creating Gecko helped ensure different browsers would be interoperable, so access to the web wouldn’t be controlled by one company. (Unlike numerous other companies featured in the Google trial, Firefox hasn’t expressed an interest in buying Chrome.)\n\nReplacing the revenue from Google is not as easy as making a deal with another search engine provider or a non-exclusive deal with Google, Muhlheim says. Mozilla has talked with Microsoft about the possibility of Bing taking over the default spot, but Muhlheim warns that without Google being able to bid on the contract, the revenue share Mozilla would be able to negotiate would likely fall. On top of that, Mozilla has found that Bing doesn’t monetize traffic as efficiently as Google does today.\n\nIn a December 2024 presentation to Mozilla’s board that was shown in court, the company warned that losing Google’s payments posed a ​​“significant threat to viability for Mozilla with limited ability to mitigate.” From 2021 to 2022, the company ran a study to see what would happen if it quietly switched Firefox users’ default search engines from Google to Bing, and found that users who switched to Bing generated less revenue for Mozilla — a finding Muhlheim said demonstrates what might happen if all of its users were switched over to Bing.\n\nMozilla has also previously tried to switch all users’ default search engines, and it didn’t go well. Between 2014 and 2017, the company made Yahoo the default on its browser, and found that people disliked the experience so much that they switched to another browser altogether.\n\n“We would be really struggling to stay alive”\n\nIf the DOJ’s other proposals work as it hopes, they would theoretically create many more quality search engines that could compete for Firefox’s default positioning, and take over the revenue share Google currently pays it. But Muhlheim says that would likely take such a long time that Mozilla would have to make significant cost cuts and strategy changes all while “waiting on a hypothetical future in which that happened.“ In the meantime, he said, “we would be really struggling to stay alive.”\n\nOn cross-examination by the DOJ, Muhlheim conceded that it would be preferable not to rely on one customer for the vast majority of its revenue, regardless of the court’s ruling in this case. And, he agreed, another browser company, Opera, has already managed to make more money from browser ads than it does from search deals. But while that may be a potential pathway to diversifying Firefox’s revenue, he added, scaling up such a business at Firefox may look different, in part because of the privacy-preserving approach it takes to products.\n\nMozilla has supported choice screens for browsers on phones and desktops, the DOJ noted, something it would directly benefit from. But it does not support a choice screen for users to select a default search engine in a browser. Muhlheim said Firefox regularly reminds users they have multiple search options — “there are a thousand different search points” in the browser, he testified. “Choice is a core value for us, but context matters,” he added on cross-examination. “The best way to get to choice is not always a choice screen.”\n\nJudge Amit Mehta asked Muhlheim if he’d agree that it would benefit Mozilla if at least one other company that matched Google’s quality and ability to monetize searches existed. “If we were suddenly in that world,” Muhlheim said, “that would be a world that would be better for Mozilla.”"
    },
    {
        "title": "Google confirms it’s close to getting Gemini support on iPhones",
        "description": "Google is close to striking a deal with Apple to integrate Gemini into the iPhone. During the search monopoly trial on Wednesday, Google CEO Sundar Pichai confirmed the company expects to strike a Gemini deal with Apple by the middle of this year and suggeste…",
        "url": "https://www.theverge.com/news/658770/google-gemini-apple-iphone-deal-ai",
        "source": "The Verge",
        "publishedAt": "2025-04-30T15:52:11Z",
        "full_text": "Google is close to striking a deal with Apple to integrate Gemini into the iPhone. During the search monopoly trial on Wednesday, Google CEO Sundar Pichai confirmed the company expects to strike a Gemini deal with Apple by the middle of this year and suggested it would roll out by the end of 2025.\n\nThe integration would presumably allow Siri to call on Gemini to answer more complex questions, similar to the integration that Apple launched with OpenAI’s ChatGPT. Apple senior vice president Craig Federighi hinted at plans to build Gemini into its Apple Intelligence feature last June, when the AI service was first announced. “We want to enable users ultimately to choose the models they want, maybe Google Gemini in the future,” Federighi said at the time.\n\nToday’s update came in response to questions asked by Department of Justice lawyer Veronica Onyema. Pichai answered “Correct” when asked about these plans. He also said he had met with Apple CEO Tim Cook to discuss AI development. “He [Cook] was trying to understand our plans for how we’re evolving AI technologies, our roadmap, and as part of that, we talked about the Gemini app distribution as well,” Pichai said. He added that he was told by Cook that more third-party AI models would ship on Apple Intelligence later this year.\n\nThere are other signs that this integration is on the way. In February, MacRumors contributor Aaron Perris found references to “Google” as an Apple Intelligence model choice in an iOS 18.4 beta. With Apple’s ChatGPT integration, Siri automatically asks for permission to use the third-party AI model to answer more complex questions. ChatGPT can also analyze photos and generate images based on text."
    },
    {
        "title": "Google is paying Samsung an ‘enormous sum’ to preinstall Gemini",
        "description": "Testimony this week from Google’s antitrust trial shows that Google gives Samsung an “enormous sum of money” each month to preinstall the Gemini AI app on Samsung devices, reports Bloomberg. Now that Judge Amit Mehta has ruled Google’s search engine is an ill…",
        "url": "https://www.theverge.com/news/652746/google-samsung-gemini-default-placement-antitrust-trial",
        "source": "The Verge",
        "publishedAt": "2025-04-22T16:23:53Z",
        "full_text": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nTestimony this week from Google’s antitrust trial shows that Google gives Samsung an “enormous sum of money” each month to preinstall the Gemini AI app on Samsung devices, reports Bloomberg. Now that Judge Amit Mehta has ruled Google’s search engine is an illegal monopoly, its lawyers are sparring with the DOJ over how severe a potential penalty should be.\n\nPeter Fitzgerald, Google’s vice president of platforms and device partnerships, testified on Monday that Google’s payments to Samsung started in January. That’s after Google was found to have violated antitrust law, partially due to similar arrangements with Apple, Samsung, and other companies for search. When Samsung launched the Galaxy S25 series in January, it also added Gemini as the default AI assistant when long-pressing the power button, with its own Bixby assistant taking a back seat.\n\nThe Information reports that today Fitzgerald testified that other companies had pitched Samsung on deals to preinstall their AI assistant apps, including Perplexity and Microsoft. But a DOJ lawyer pointed out that Google’s letters attempting to amend its deal with phone makers, which the company presented at the hearing, were only sent last week, just ahead of the trial. Also, internal slides presented today apparently showed that Google “was considering more restrictive distribution agreements that would have required partners to preinstall Gemini alongside Search and Chrome,” The Information writes.\n\nAccording to Bloomberg, Fitzgerald said the Gemini deal is a two-year agreement that, along with fixed monthly payments, sees Google giving Samsung a percentage of its subscription revenue for the Gemini app. Department of Justice (DOJ) lawyer David Dahlquist called the fixed monthly payment an “enormous sum,” Bloomberg says. Exactly how enormous isn’t known.\n\nIf the DOJ has its way, the results of these hearings could mean Google is forbidden from striking default placement deals in the future, would sell Chrome, and would be forced to license the vast majority of the data that powers Google Search. Google has argued that it should only have to give up the default placement deals.\n\nCorrection April 26th: This story previously said Samsung receives a percentage of ads revenue from the Gemini app, as originally reported by Bloomberg. We’ve updated the story to reflect that Google shares Gemini subscription revenue instead."
    },
    {
        "title": "Google is killing software support for early Nest Thermostats",
        "description": "Google has just announced that it’s ending software updates for the first-generation Nest Learning Thermostat, released in 2011, and the second-gen model that came a year later. This decision also affects the European Nest Learning Thermostat from 2014. “You …",
        "url": "https://www.theverge.com/news/656332/google-ending-support-nest-thermostats",
        "source": "The Verge",
        "publishedAt": "2025-04-25T17:05:32Z",
        "full_text": "is a senior reviewer who has worked at The Verge since its founding in 2011. His coverage areas include audio (Sonos, Apple, Bose, Sony, etc.), home theater, smartphones, photography, and more.\n\nGoogle has just announced that it’s ending software updates for the first-generation Nest Learning Thermostat, released in 2011, and the second-gen model that came a year later. This decision also affects the European Nest Learning Thermostat from 2014. “You will no longer be able to control them remotely from your phone or with\n\nGoogle Assistant, but can still adjust the temperature and modify schedules directly on the thermostat,“ the company wrote in a Friday blog post.\n\nThe cutoff date for software updates and general support within the Google Home and Nest apps is October 25th.\n\nNo more controlling these “smart” thermostats from a phone.\n\nIn other significant news, Google is flatly stating that it has no plans to release additional Nest thermostats in Europe. “Heating systems in Europe are unique and have a variety of hardware and software requirements that make it challenging to build for the diverse set of homes,“ the company said. “The Nest Learning Thermostat (3rd gen, 2015) and Nest Thermostat E (2018) will continue to be sold in Europe while current supplies last.”\n\nLosing the ability to control these smart thermostats from a phone will inevitably frustrate customers who’ve had Nest hardware in their home for many years now. Google’s not breaking their core functionality, but a lot of the appeal and convenience will disappear as software support winds down. The early Nest Learning Thermostats can at least be used locally without Wi-Fi, which isn’t true of newer models. There’s one bright spot for owners of recent Nest Thermostats: Google says owners “will be able to create and adjust schedules” from the Google Home app later this year for the first time.\n\nStill, this type of phase-out is a very real fear tied to smart home devices as companies put screens into more and more appliances. Is 14 years a reasonable lifespan for the these gadgets before their smarts fade away? There’s no indication that Google plans to open source the hardware.\n\nIn a clear attempt to ease customer anger, Google is offering a $130 discount on the fourth-gen Nest Learning Thermostat in the US, $160 off the same device in Canada, and 50 percent savings on the Tado Smart Thermostat X in Europe since the Nest lineup will soon be gone."
    },
    {
        "title": "Google is putting AI Mode right in Search",
        "description": "Google is preparing to publicly unleash its AI Mode search engine tool for the first time. The company announced today that “a small percentage” of people in the US will start seeing an AI Mode tab in Google Search “in the coming weeks,” allowing users to tes…",
        "url": "https://www.theverge.com/news/659448/google-ai-mode-search-public-test-us",
        "source": "The Verge",
        "publishedAt": "2025-05-01T13:25:21Z",
        "full_text": "Google is preparing to publicly unleash its AI Mode search engine tool for the first time. The company announced today that “a small percentage” of people in the US will start seeing an AI Mode tab in Google Search “in the coming weeks,” allowing users to test the search-centric chatbot outside of Google’s experimental Labs environment.\n\nIn contrast to traditional search platforms that provide a wall of URL results based on the enquiry or descriptions a user has entered, Google’s AI Mode will answer questions with an AI-generated response based on information within Google’s search index. This also differs from the AI Overviews already available in Google Search, which sandwich an AI-generated summary of information between the search box and web results.\n\nAI Mode will be located under its own dedicated tab that will appear first in the Search tab lineup, to the left of the “All,” “Images,” “Videos,” and “Shopping” tabs. It’s Google’s answer to large language model-based search engines like Perplexity and OpenAI’s ChatGPT search features. These search-specific AI models are better at accessing the web and real-time data than regular chatbots like Gemini, which should help them to provide more relevant and up-to-date responses.\n\nIf you’re already familiar with chatbot UI then AI Mode won’t take much to get used to. GIF: Google\n\nGoogle is also scrapping the waitlist for Labs users in the US to test AI Mode, allowing more people to opt in to try the Search feature before it becomes widely available.\n\nAI Mode itself has also been updated with some new capabilities, including a feature that will save past searches to a new left-side panel, allowing users to quickly revisit topics or ask follow-up queries without starting a new conversation. Visual, clickable cards for products and places are also now starting to appear in AI Mode, providing information like opening hours, reviews, and ratings for businesses, and images, inventory, shipping details, and real-time prices for shoppable products.\n\nCorrection, May 1st: Deleted a line saying that users need a Google One AI Premium subscription to access AI Mode in Labs. This restriction has been removed."
    },
    {
        "title": "Google must stop favoring Search and Chrome on Android in Japan",
        "description": "Japan’s Fair Trade Commission (JFTC)  has ordered Google to stop making deals that give preference to Google Search and Chrome on Android devices. Nikkei Asia says that it’s the first time the regulator has issued a cease and desist order to a major tech comp…",
        "url": "https://www.theverge.com/news/648996/google-antitrust-japan-order-google-search-android-chrome",
        "source": "The Verge",
        "publishedAt": "2025-04-15T16:44:41Z",
        "full_text": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nJapan’s Fair Trade Commission (JFTC) has ordered Google to stop making deals that give preference to Google Search and Chrome on Android devices. Nikkei Asia says that it’s the first time the regulator has issued a cease and desist order to a major tech company.\n\nThe regulator found that Google had asked at least six different Android phone makers for such deals since July 2020, according to Nikkei. The article says the deals included Google sharing revenue with “five business partners”, with the condition that Chrome and Google Search services be “placed on the initial screen” and that other companies’ similar services not be installed at all.\n\nAs part of its punishment, Nikkei reports that Google will have to relax parts of its deals related to advertising revenue distribution so phone makers have more options. The company will need to get an independent third party to report on its compliance with the JFTC’s order for five years.\n\nGoogle spokesperson Danielle Cohen emailed this statement to The Verge:\n\nWe’re disappointed by the JFTC’s findings, as our agreements with Japanese partners are pro-competitive and have undeniably boosted their ability to invest in product innovations which deliver more choice for consumers. We will review the order thoroughly to determine our next steps.\n\nJapan passed legislation last year that shared similarities to the EU’s Digital Markets Act, including preventing self-preferencing moves like the ones Google is now being ordered to stop. Google is currently awaiting an antitrust punishment decision in the US that could result in the company getting broken up.\n\nUpdate April 15th: Added a statement from Google spokesperson Danielle Cohen."
    },
    {
        "title": "Google Is Once Again Deemed a Monopoly, This Time in Ad Tech",
        "description": "The future of Google's advertising business is at stake after a federal judge found the company illegally monopolized parts of it.",
        "url": "https://www.wired.com/story/judge-rules-google-ad-business-monopoly/",
        "source": "Wired",
        "publishedAt": "2025-04-17T18:07:22Z",
        "full_text": "A federal judge ruled today that Google is a monopolist in some parts of the online advertising market, marking the second case in a year where the company was found to have violated US antitrust law. Last August, a federal judge ruled that Google was maintaining an illegal monopoly in search.\n\nJudge Leonie Brinkema of the US District Court for the Eastern District of Virginia determined that Google illegally monopolized parts of its advertising technology business to dominate the programmatic ad market, a major source of revenue for the company. Google generated nearly $30.4 billion in worldwide revenue last year from placing ads on other apps and websites. Now, a substantial portion of those sales are threatened by penalties that may follow Brinkema’s ruling. A best-case scenario for US consumers is a browsing experience filled with fewer ads and paywalls and more content choices.\n\n“In addition to depriving rivals of the ability to compete, [Google’s] exclusionary conduct substantially harmed Google’s publisher customers, the competitive process, and, ultimately, consumers of information on the open web,” Brinkema wrote.\n\nGoogle was found to have violated Section 2 of the Sherman Act, the cornerstone antitrust law in the US, “by willfully acquiring and maintaining monopoly power in the open-web display publisher ad server market and the open-web display ad exchange market, and has unlawfully tied its publisher ad server (DFP) and ad exchange (AdX).” In other words, the way that Google tied parts of its ad tech together was deemed unlawful.\n\nOnline ads end up in front of consumers after passing through a chain of systems linking publishers to advertisers. Google has long been viewed as a dominant provider of tools at nearly every step in this process, which critics argue enables the company to give preferential treatment to its own systems and box out competitors. Some of Google’s offerings came through acquisitions, like the purchase of DoubleClick in 2007.\n\nBut Brinkema rejected the Justice Department’s allegation that Google illegally monopolized the market for some tools used by advertisers to buy ads, claiming the government’s definition of the market was too narrow and ill-defined. As a result, Google was not determined to be a monopolist as it relates to ad-buying tools, but it was deemed to be one in the market for publisher tools to sell advertising space.\n\nThe company is leaning into the fact that not all of the plaintiff’s claims stand up in court. Google’s vice president of regulatory affairs, Lee-Anne Mulholland, put out a statement on X stating that Google won “half the case” and that the company plans to appeal the other half.\n\n“The Court found that our advertiser tools and our acquisitions, such as DoubleClick, don’t harm competition. We disagree with the Court’s decision regarding our publisher tools. Publishers have many options and they choose Google because our ad tech tools are simple, affordable and effective,” Mulholland said.\n\nThe ad tech suit was first filed in January 2023 by the Department of Justice and eight states, which alleged that Google had illegally squashed competition in the advertising market by acting as a powerful middleman in the ad business and taking a large cut of advertising revenue in the process. Google has argued that there’s plenty of competition in the online advertising market. The case went to trial last September, and closing arguments were delivered in November.\n\nThe Department of Justice did not immediately respond to a request for comment on the ruling. Jonathan Kanter, an attorney who oversaw the trial while at the department, wrote on X that Thursday’s ruling “is a huge victory for antitrust enforcement, the media industry, and the free and open internet.”\n\nLast August, a district judge for the District of Columbia, Amit Mehta, ruled that Google has maintained an illegal monopoly both in general search and general search text ads. The Justice Department has proposed that Google should be ordered to “promptly and fully divest” its Chrome web browser, and also stop paying partners, such as Apple, for preferential treatment on its iPhones. Google is fighting the proposals, and a trial for Mehta to reach a final remedy is scheduled to begin on Monday.\n\nBrinkema has asked Google and the Justice Department to now propose a schedule for determining remedies in the ad tech case. The company could be ordered to sell off its ad tools for publishers as a result of this process."
    },
    {
        "title": "Google Is Operating an Ad Tech Monopoly, Judge Rules",
        "description": "It's the second time Google has gotten hit with the monopoly label.",
        "url": "https://gizmodo.com/google-is-operating-an-ad-tech-monopoly-judge-rules-2000590754",
        "source": "Gizmodo.com",
        "publishedAt": "2025-04-17T17:55:42Z",
        "full_text": ""
    },
    {
        "title": "Perplexity wants to buy Chrome if Google has to sell it",
        "description": "Perplexity Chief Business Officer Dmitry Shevelenko said he didn't want to testify in a trial about how to resolve Google's search monopoly because he feared retribution from Google. But after being subpoenaed to appear in court, he seized the moment to pitch…",
        "url": "https://www.theverge.com/policy/654835/perplexity-google-antitrust-trial-remedies-chrome",
        "source": "The Verge",
        "publishedAt": "2025-04-23T21:38:56Z",
        "full_text": "Perplexity Chief Business Officer Dmitry Shevelenko said he didn’t want to testify in a trial about how to resolve Google’s search monopoly because he feared retribution from Google. But after being subpoenaed to appear in court, he seized the moment to pitch a business opportunity for his AI company: buying Chrome.\n\nIf Judge Amit Mehta sees things the way the Justice Department does, he could force Google to spin out its popular web browser — including the free open source Chromium browser that many other web browsers are built on. Google says this remedy is playing with fire, and could result in a new Chromium owner charging for the product or failing to keep it running in an adequate way, causing ripple effects across the browser industry.\n\nBut Perplexity would be happy to take on the project, Shevelenko testified. When an attorney asked if Perplexity believes anyone besides Google could run a browser at the scale of Chrome without diminishing its quality or charging for it, Shevelenko responded, “I think we could do it.”\n\nIt’s not the first time the AI upstart has put its name in the ring to take over a major technology platform under siege by the US government. The less than three-year-old company also thinks it could buy TikTok, which is facing an ever-extending ban in the US over national security concerns based on its ownership by China-based ByteDance.\n\nAlthough Shevelenko wasn’t a voluntary witness — he was called by the DOJ to demonstrate how Google’s search monopoly affects new generative AI companies — he seemed prepared to lay out his grievances against Google. He described the “jungle gym” of Android settings a user needs to navigate to set Perplexity as their default AI assistant, and admitted he even had to call on a colleague to help him do it (Shevelenko also admitted he’s a long-time iPhone user). Even once Perplexity’s assistant is set as the default over Google’s on an Android phone, he testified, it still doesn’t have the same standing as Google’s, since a user needs to press a button to activate it, rather than using a wake word like “Hey Google.”\n\nCompanies under contract with Google essentially have a “gun to [their] head”\n\nDuring the DOJ’s questioning, Shevelenko walked through an anonymized list of phone makers that Perplexity has spoken with about a deal to make it a preloaded search engine or default assistant in the US, but failed to strike a bargain with. In talks with one company whose name was hidden from the public, Shevelenko said the discussion kept “hitting a wall because they were fearful of losing Google revenue share or Google agreements.” As it stands, Shevelenko testified, companies under contract with Google essentially have a “gun to [their] head” because Google can turn off significant revenue share if they do something Google dislikes.\n\nMehta found in the first phase of the case that Google used exclusionary agreements with phone and browser companies to lock up distribution channels, and many of those agreements prevent the companies from making certain kinds of deals that could displace Google’s status on their products.\n\nShevelenko said another unnamed company — which, based on public reporting appeared to be Motorola — agreed to preload Perplexity on its devices, but would not make it the default assistant “despite both parties wanting it to be.” He testified that Perplexity and the phone-maker “tried every creative workaround” to evade Google’s restrictions, but even though the company thought Perplexity’s assistant would be “great for their users,” they just couldn’t find a way to “get out of their Google obligations” and dislodge it as the default.\n\nShevelenko credited the judge’s monopoly ruling as the reason it could enter these talks at all. The fact that Google is “under pressure,” he said, is why wireless carriers, phone manufacturers, and browser makers are comfortable even discussing the possibility of a deal. But despite his opportunistic pitch, Shevelenko seemed ambivalent of Google being actually forced to sell Chrome. Ahead of his testimony, he shared a post from the Perplexity team on LinkedIn that argues Google should not “be broken up.” His company seems more concerned with ending Google’s search distribution agreements. And in court, Shevelenko warned it would be concerning to see a company like OpenAI buy Chrome (as one of its executives testified Tuesday it would be open to) and discontinue Chromium’s open source model or fail to adequately support the product. “There’s all the self-serving incentive to be here today and shout about how evil Google is, and I think we want to be reasonable,” he said. Google, he continued, builds good products that others are able to iterate on. “We wouldn’t want a remedy that cripples Google’s ability to keep doing that.”"
    },
    {
        "title": "Google extends the Pixel 7A’s repair program for battery swelling issues",
        "description": "Google announced an extended repair program for the Pixel 7A that promises free repairs for devices that suffer from “unexpected battery swelling” issues, 9to5Google reports. The program covers symptoms that directly indicate an expanding battery, including b…",
        "url": "https://www.theverge.com/news/655371/google-pixel-7a-extended-repair-program-battery-swelling",
        "source": "The Verge",
        "publishedAt": "2025-04-24T13:21:36Z",
        "full_text": "is a news writer fond of the electric vehicle lifestyle and things that plug in via USB-C. He spent over 15 years in IT support before joining The Verge.\n\nGoogle announced an extended repair program for the Pixel 7A that promises free repairs for devices that suffer from “unexpected battery swelling” issues, 9to5Google reports. The program covers symptoms that directly indicate an expanding battery, including bulging of the device or separation of the phone cover. Google also indicates that rapid battery draining could be another symptom of swelling that the program covers.\n\nThe Pixel 7A launched in 2023, and since then has faced many user complaints online, including on Reddit, where a year after its launch people complained about poor battery life, body swelling, and difficulties getting Google support to set up a warranty repair.\n\nGoogle says the battery replacement will be done “at no charge for individual end-user owners,” but that isn’t the case if there are other problems like liquid damage, cracks, or other things not caused by swollen batteries. You will need to go through an eligibility process on the program site and, if accepted, you’ll need to mail it in for repair or go to an authorized repair shop to get it fixed.\n\nIn some countries (not the US or India) that don’t have repair options, Google will offer money in lieu of fixing the device. You could get $200 (converted to local currency) for out-of-warranty Pixel 7A devices, or $300 towards a new Pixel. In-warranty devices can get a $456 payment."
    },
    {
        "title": "Former DOJ antitrust chief says a Google break up will benefit the internet",
        "description": "Today, we’re talking about the very real possibility that the United States government might break up Google. To figure that all out, I invited Jonathan Kanter, the former assistant attorney general for antitrust under the Biden administration, to join me on …",
        "url": "https://www.theverge.com/decoder-podcast-with-nilay-patel/654243/jonathan-kanter-antitrust-google-ad-tech-monopoly-doj",
        "source": "The Verge",
        "publishedAt": "2025-04-24T14:00:24Z",
        "full_text": "Today, we’re talking about the very real possibility that the United States government might break up Google. To figure that all out, I invited Jonathan Kanter, the former assistant attorney general for antitrust under the Biden administration, to join me on Decoder again.\n\nJonathan left the Department of Justice after President Trump was elected, but he was the architect of the major antitrust cases that Google just lost, and which the Trump administration continues to pursue. In the first case, the court found that Google illegally maintained its monopoly over web search with a series of default placement deals, most particularly on the iPhone. That case is back in court right now for the second phase of the trial, where a judge will decide what the remedy will be — essentially, how Google will be punished.\n\nThe government is asking for a very big remedy: it wants Google to sell off its Chrome browser and make its search data more accessible to rivals. On top of that, literally simultaneously, Google just lost another antitrust case. A different court ruled last week that the company “substantially harmed publishers and users on the web with its advertising monopoly.”\n\nThat case will also now head to a remedies phase, and it’s very likely the government will ask for part of Google’s ad tech system to be sold off as well. Obviously, Google says it’s going to appeal all of this, so it will all take many more years to play out. But these initial verdicts are clear, and chances are high that Google and the web itself will be very different when everything comes to a close.\n\nListen to Decoder, a show hosted by The Verge’s Nilay Patel about big ideas — and other problems. Subscribe here!\n\nNow, the search case was filed during the first Trump administration, but Jonathan and his team took it to trial and won. Jonathan and his team also filed the Google ad tech case in 2023. That same team also filed a big antitrust case against Apple. And if you’ve listened to Jonathan’s appearances on the show, you know that he had to play the role of buttoned-up prosecutor while he was working for the DOJ. But now that he’s out, he’s much more free to share his real thoughts on what it takes to build and win these cases and about what should happen next.\n\nYou will not be surprised to hear that Jonathan thinks we should break up Google, but I think you’ll find it fascinating to hear how we put together his team, how he thought through the construction of these two cases in particular, and what kinds of audiences he thought he was addressing in the legal complaints themselves.\n\nJonathan thinks of it as being head of a very specialized boutique law firm within the government, staffed by the most talented trial and antitrust attorneys the industry had to offer. That’s Decoder bait all by itself, but the weirdest part is that Jonathan left and had to hand that entire law firm and those cases over to an entirely new administration.\n\nSo I wanted to ask him about what happens now that Donald Trump and Attorney General Pam Bondi are in charge of his little law firm, especially because we’re seeing a pretty intense political realignment around antitrust these past few years. There are some prominent members of the new administration and the MAGA movement who have reached a rare consensus with some Democrats around breaking up big tech.\n\nSo I wanted to know if the DOJ’s Antitrust Division was still able to operate at the same level of effectiveness now, or if DOGE and the Trump administration’s purge of non-loyalists has hollowed it out. I also really wanted to know what Jonathan thought of the case his counterparts at the Federal Trade Commission are pursuing against Meta in court right now. That case seems much messier, but still might result in the breakup of Instagram and WhatsApp.\n\nAs you’ll hear, Jonathan was quite cordial about his replacement, Gail Slater. He was also optimistic about Attorney General Pam Bondi and Federal Trade Commission Chair Andrew Ferguson, who he hopes will continue to aggressively pursue tech regulation instead of treating the government like it’s “coin-operated,” which is something that many big tech executives would like it to be. In general, I’m deeply worried about the perception of corruption and the amount of nihilism that so many people feel towards the rule of law right now. So we talked about that a little bit as well.\n\nYou’ll hear me say this again a little bit, but we’ve had a lot of full-circle moments on Decoder this year, and getting Jonathan to come back on the show after he’s left office might be my favorite one yet.\n\nOkay, Jonathan Kanter, the former assistant attorney general for antitrust at the US Department of Justice. Here we go.\n\nThis interview has been lightly edited for length and clarity.\n\nJonathan Kanter, you’re the former assistant attorney general for antitrust at the United States Department of Justice. Welcome back to Decoder.\n\nGreat to be back, and yes, free and clear.\n\nYou’re one of our few third-time guests, and I’m particularly excited because you’re not in the Department of Justice anymore. You’re free. You could just say whatever you want.\n\nIt’s a weird feeling to just say what’s on your mind. I love it.\n\nI’m very excited. We’ve done a lot of full-circle Decoder episodes this year, but this one in particular I am excited for. The last time you were on, you had just won an antitrust case against Google in search. You’re on the show again today. The Department of Justice, not your Department of Justice anymore, but your case at the Department of Justice has been won. Google has lost the antitrust case in the ad tech market, which is very different from the search market, although I did find it interesting the judge made reference to the search case as well. So let’s just start at the beginning: What is this case? Why is it different from the search case?\n\nThe search case is the Google that most consumers know, which is you go to Google.com or to your search bar, you put in a search, and you get an answer back. That case focused on Google’s core product, which is a search monopoly.\n\nThis case focuses on all the interactions a lot of people have with Google on a daily basis, but don’t realize. So when you go out to the internet, to any site, and you see an ad, chances are very high that that ad is passing through Google technology. Ads are bought and sold on the internet using Google’s pipes and plumbing. So that’s what this case is about. It’s all that infrastructure, the stuff you don’t see that allows publishers — news publishers, or anyone who creates content — to sell an ad space and anyone who wants to buy an ad to buy ad space.\n\nNow, when people think of ads, they think of Mad Men, right? They think of the old-style “pouring a glass of whiskey and taking someone out to buy some airtime” kind of ads. That’s really not how ads work in the modern world. How they work in the modern world really is more like a commodities or a securities exchange, or like equities, where you buy and sell programmatically on these open-market exchanges and people bid on auctions. That’s how ads are sold, and this case is about exactly that technology.\n\nThere are a lot of complicated components to that digital auction. The way that I always think about it is there’s a lot of different software products that interact at every stage of that, and in most of those markets where those products play, Google is the one or two player. It just has a dominant position across every piece of technology you need to make an ad auction go.\n\nExactly.\n\nHow did you put this case together? How did you see that this was a problem, where did it come from, and how did you know, “Okay, this is one we can go win”?\n\nThis is years in the making, but the facts here are incredibly strong. So I think when you get out of Mad Men and into the kind of commodities exchange mindset, the case becomes very clear. You have the buy side and the sell side, right? The tools that someone, a publisher, will use to sell ads, the tools that an advertiser will use to bid on and buy ads. And then you have this exchange in the middle.\n\nWhat we found in our investigation is that Google has a dominant position on the buy side, the tools that buyers use. It has a dominant position on the tools that sellers use. It owns and has the dominant exchange in the middle, and then Google buys and sells on its own exchange. On top of that, it then rigs the results of those auctions, so it wins more and publishers get less money as a result.\n\nSo those tools in the middle, that’s the open web. What you’re describing here is the open web, right?\n\nExactly.\n\nYou run a website. You put some ad slots on it. You buy some software products to auction off that inventory. Someone shows up to use some other tools to buy it. That’s a smaller piece of Google’s revenue today than it was before. The part that really interested me about this whole case is the connection to Google Search, which is under all kinds of pressure, not just from the antitrust case that Google now has to defend in the remedies phase, but also from AI. Everyone can see what SEO is doing to the web overall, too.\n\nSo you can see the web is under all this pressure. It’s under revenue pressure from Google as well because of all of the antitrust activity, because of all the monopolization in the ad tech space you’re describing, but then Google itself is making more money on its own platforms, on Search itself, on YouTube. Was there ever a sense that you were chasing a thing that was dying all by itself? Because that felt to me like the hardest part of the puzzle here.\n\nNot at all. First and foremost, this technology matters a lot, particularly to news publishers. News publishers are critical for the free flow of information, which is vital to democracy, and I think that industry has been under assault for years, in part because the revenue streams have dried up in no small part due to Google’s conduct — in my view and in the view of the court here.\n\nSo I think that is an important starting point. Second is, I think ahead to AI as well, and Google really, at its heart, is an advertising company. It makes its money on advertising, and it puts out all these products, some of which are really good and interesting, to attract users in order to get their attention, in order to get their data, so then they can flip it to advertisers and sell it for money.\n\nWhen you think about where AI is going for a company like Google, that is likely to be how it monetizes a lot of its AI business, certainly its consumer AI business. And the infrastructure that we’re talking about here is likely to be the same kind of infrastructure, whether it’s the advertising infrastructure from the search case or the ad tech infrastructure from the ad tech case that translates into how Google sells advertising alongside its various consumer-based AI products. And so getting this right now wasn’t just critical to fix these industries as they exist today, but also was to make it clear that they can’t use these same anticompetitive practices and this playbook in the future.\n\nLet me push on that just a little bit harder. I hear that. The nihilist in me says, “Well, it’s already too late. The web has been scraped by all of the model makers fully and completely. The economics of starting a new website are pretty bad. Most new information happens on a closed platform.”\n\nWill a case like this, combined with the search case, result in the economics of publishing on the web being better than they are today?\n\nHopefully they will result in new businesses being funded and entering the market to figure out how to monetize content, how to monetize AI, how to sell advertising to advertisers, and how to help publishers figure out better ways to maximize their revenue. Right now — the system wasn’t working, right? Companies like Google were not only extracting all the data from these sites through crawling and indexing and training their models, but they also were extracting massive amounts of inventory through these intermediaries, these middlemen that they created to buy and sell and exchange ads.\n\nAnd so, we need something better, because what we have now doesn’t work. And so, either we can roll over and say, “Well, we’ll just throw our hands up. The market’s moved on to something else that they’re going to dominate and use the same playbook,” or we can fight. We could say what they did was wrong. They broke the law, and they shouldn’t do it again in the future.\n\nOne of the things that really struck me about the search case was Google’s pretty compelling argument that, “Yeah. The market might be distorted in favor of Google Search, but everything else is bad. Bing is just bad. There are other competitors that mostly use the Bing index. It’s just bad.” Satya Nadella took the stand and basically said, “I can make Bing better, but it wouldn’t be worth it.”\n\nAnd the real competition, as you and I discussed, was maybe from these AI products. It might disrupt search in some other way. And then the real problem was, by paying Apple for default placement, no one else could ever get the volume of search clicks to be better. But at the end of the day, Google’s core argument was, “Look, our product is just better. People like it. If we didn’t pay Apple, people would just choose Google by default. We might as well get some money.”\n\nThey lost on that argument, but the way they fought back was very intuitive. It was intuitive to say, “Look, our product is better. It’s winning in the marketplace. This distortion, just ignore it.” Again, they lost that case, but I understood the argument.\n\nThey made the same kind of argument in the ad tech case. Did you find it as compelling? Did you find it as distracting? Did you find it to be as much of a reflection of, “Well, the product is superior, so the product stays superior,” as I thought in search?\n\nI found it flat. If you listened to the trial and followed the trial, what you heard is publisher after publisher coming in saying they hated it, that they wanted to work with somebody else, that the technology sucked, that Google was giving themselves an advantage over others, that they wanted the freedom to work with other competitors, but that Google was imposing restrictions, whether they were tying restrictions or providing limited access to inventory for other publishing ad servers, the whole range of conduct that actually made it harder to work with rivals and pissed off, to a significant degree, most everyone in the industry.\n\nThe case, admittedly, in search was powerful, but a little bit more nuanced, which is, it’s learning by doing, and the more queries you get, the smarter your search engine gets. And so, by suffocating rival search engines, it made it harder for them to get smarter and compete on quality with Google. We didn’t have those same issues here.\n\nIn fact, we had the opposite. We had the industry coming forward in trial saying that they were very upset, that they were unhappy with the level of quality. They were unhappy with the ROI that they were getting for their ads, and they wanted something better, and they couldn’t use it because Google was getting in the way. And in fact, it’s funny, I don’t think Google called a single witness that didn’t either work for Google or is paid by Google. And so, they had no one coming to their defense.\n\nTell me about the mechanics of putting a case like this together as the attorney general for antitrust. You decide, “Okay. We see some conduct. We’ve heard from a lot of publishers that they’re mad. We can see the distortion in the search market. We’re going to do both. We’re going to chase both of these down.”\n\nHow did you decide to prioritize these cases? And then I want to know how you decided to put them together, because no one ever really gets that view.\n\nThese are really hard cases, so what you do is kind of take a step back. For the investigation, you talk to the industry. You interview people. You learn about the products. You understand how they work, and then you send out subpoenas, and you get information and documents for Google — and we found incredible stuff where Google knew that what it was doing was wrong.\n\nIt talked about how owning this publisher server and these technologies and these ad exchanges would be like if Goldman Sachs owned the New York Stock Exchange. That’s an actual document that they wrote, that we featured in our case, and that actually made it into the opinion. And then you put all that evidence together, and then you realize that the impact here is great. Internet advertising is a huge business. This is not a side hustle. When you think from the advertiser’s perspective, advertising is one of the largest, if sometimes the largest, costs for most small businesses, in particular, small and medium-sized businesses who rely on internet advertising for lead gen and customer generation, and many even offline businesses rely on online advertising in order to get people coming in through the door.\n\nPeople who create content for the masses, whether they’re news publishers or any other type of content who doesn’t want to sell exclusively by subscription, need to sell advertising. In the internet world, you can’t sell advertising the Mad Men way and make money. You have to have technology and tools in order to clear all those impressions. Google understood early on that it could gobble up, through acquisition, all of the components to give itself power in those tools, and then it could use market manipulation, exclusivity, and other types of course of behavior in order to lock itself in, and that’s exactly what the court found.\n\nSo put me in the room. Are you screaming, “We’re going to go get Google”? Is it a presentation from your staff that says, “We think we have a case here. Here’s how we’re going to make it”? Was there a PowerPoint? How does this work?\n\nIt’s extremely deliberate. So the staff will investigate. We will, in my office, stay in tune and line with the staff and get updates on those investigations and make sure that we’re sending subpoenas and interview requests out to everyone in the industry. We hire experts, we get data. We analyze that data, and it’s expensive — very expensive actually.\n\nWhen we get closer to thinking there’s a problem, we start figuring out, “Okay, how do we tell this story, and does it survive scrutiny?” So we put ourselves through a very rigorous red team-style exercise to make sure that we’re right. The power of the government is extraordinarily significant, and we don’t wield it lightly. We want to make sure it’s going to hold up in the court of law, that we think we’re going to win, and that it’s the right case for the right reasons.\n\nThen you have to figure out, “Okay, how are we going to litigate this case? How are we going to write it in a way that, especially in a market like this, is filled with acronyms?” It’s incredibly complicated. Things move at the speed of milliseconds in terms of data. So how do we tell that story in a way that’s accessible?\n\nWe took a very interesting path, and I think this was consistent with our approach in a lot of these antitrust cases. Some lawyers will say, “You want to write a tight, short, crisp complaint.” I actually took a different view. My view is that we have all of this evidence. Let’s lay it all out there for the public and the court to see at the outset. Let’s err on the side of saying more rather than less, but let’s almost have three different stories in one.\n\nSo the way we would structure our complaints would be a very short intro, one page or two, that gives you the thematic opening to the case. This is the stuff that if you’re going to read one thing and you need to quickly understand what the case is about, you can read that one or two pages and understand it. In our case, we put it forward with that Goldman Sachs quote, because I think that really told the story.\n\nThen you have a longer executive summary, and this is for the person who’s got a little more time and is willing to read 15 pages and wants to get some more detail on what are the relevant markets and what are some of the key documents and what’s some of the harm. Then you have the antitrust nerds, like you, who want to read the whole thing from start to finish, and that’s the additional 80, 90, or 120 pages, whatever it might be in the case. That’s where you go really deep into the weeds and you can understand how the industry functions, where the documents are, what Google understood it was doing at the time, why it knew that it was behaving in an anticompetitive fashion, what the harm was, and how competitors were responding.\n\nThen we position all of that so that we can go to the court and say, “This is not a theory. This is not just based on a guess. This is based on a really serious inquiry. It’s based on data. It’s based on analysis. It’s based on internal documents and testimony, and the story is going to be coherent from start to finish.”\n\nThat trend towards really readable complaints that are essentially narrative is new, right? Well, it’s not so new. It’s new in the past five years, maybe. Do you think about, “Okay, well, this PDF is going to be on social media. I better give it a good hook”? Is that on your mind?\n\nNo. When we initially filed this case, we asked for a jury trial. So we thought about how this would play with the jury. My view is, if you can’t tell the story to a jury of your peers, how are you supposed to tell the story to the judge, and how are you supposed to tell it to the public? So I think we didn’t want to sacrifice sophistication, but on the other hand, having a good hook was really more about boiling something down to its core essence.\n\nIt’s what lawyers do. If you can’t make the case digestible, if you can’t make it easy to understand, you’re not likely to win. And so, if you have something that’s really complicated, how do you make sure that you’re not skimping on the nuance and the technicalities while at the same time saying, “What did they do that’s wrong? Why should they be held in violation of the law in a government lawsuit?”\n\nOkay, so Google owns the exchange. It represents the buyers. It represents the sellers. It owns the exchange in the middle. It buys and sells in its own exchange, and it manipulates it, and it knew what it was doing the whole time. To me, you don’t have to understand the technology to know that that’s wrong, and it’s really important to boil things down like that.\n\nWe did it in all of our cases, whether it’s this one, in the Ticketmaster one, and in our Apple case and others, and then we explain why it matters. It’s important for a court to understand why this matters to the public. Why are we going to the court and saying, “We’re asking you to take a lot of time and use your resources to try this case and figure out the right outcome. We believe in it, and here’s why, and here’s why it’s a good use of our resources and a good use of the court’s resources”?\n\nThere’s the complaint. There’s storytelling. There’s convincing the court it’s a good use of resources and surviving however many motions to dismiss Google wants to file. Then there’s the trial, in which you had to bring up a lot of experts to talk about price increases on the orders of pennies, but over millions and millions of transactions. There’s an insane number of acronyms that exist in the ad tech space. Google’s own products are basically named acronyms.\n\nThat was all very technical, and as I’ve watched a bunch of these antitrust trials over the years, that’s where it starts to fall apart. That you’ve got these very technical systems that might be working, might not be working, and then you’ve got these experts that everybody brings in to argue about whether prices went up or down a percentage based on some model they’ve created. Ad tech, in particular, is boring. Just inherently, the only people who care about it are people who work in ad tech, and they care about it a lot. But regular people, their eyes glaze over. How did you think about that in the course of actually being in the courtroom?\n\nSo first and foremost, you have to invest in the right team. When I started the antitrust division, I realized that we weren’t going to be successful unless we can convince courts, juries, and judges that we’re right. We had the best — in my view, and still do — antitrust lawyers in the world, but many of them didn’t have the experience of standing up in a courtroom and trying cases.\n\nThe vision that we brought to the antitrust division when I arrived was, “How do we take world-class antitrust lawyers and match them with world-class trial lawyers?” So we went out and built this elite core of first-chair trial lawyers, about 25 of them. These are people who have grown up in courtrooms: former US attorneys, assistant US attorneys, DAs, plaintiffs’ lawyers, and partners at law firms. How do we assemble folks who really can be that lead lawyer in first, second, and third chairs alongside the antitrust experts? And if you combine those two expertise, you can bring the sophistication and you can bring the storytelling in court.\n\nSo we built that, and we brought in incredible people. It was run by a woman named Hetal Doshi, who is one of my deputies and is just an extraordinarily gifted storyteller, lawyer, debater, and mastermind in the courtroom. Then we assembled this incredible team of what we called senior litigation counsel. I actually recruited a former partner of mine from private Big Law, a woman named Julia Wood, who ended up becoming the leading trial lawyer in the case, and Aaron Teitelbaum, who is a former prosecutor in the US Attorney’s Office, and then a number of others to help lead the trial team and go head-to-head with my former firm Paul, Weiss.\n\nIt sounds to me like you’re building a little law firm inside the Department of Justice. You’re describing a culture shift. You’re describing hiring and recruiting. Is that how people should think about it, that this is a little law firm that you ran?\n\nAbsolutely. Yeah, it’s a scrappy little law firm, certainly compared to the size of the big law firms, and we had incredible assets when I arrived. We just needed to shape them a little bit differently. So bringing in this trial unit, building a data scientist unit, boosting the core expertise that I thought we needed in order to go head-to-head with companies like Google and litigate two cases in a year and win both of them, while at the same time suing Apple, RealPage, Ticketmaster, and a number of other companies. So we needed to scale, we needed scope, and we needed depth. How you build your team is really important, and we invested a lot in that early on before we went to battle.\n\nI’m going to come back to this idea that you started a law firm and it was good at its job, because I think that’s hard for people to see. I think they see the Department of Justice, and you’re describing a unit within the Department of Justice that you built. You started a law firm. And that’s useful to me, but I want to come back to it.\n\nYeah, we built the world’s best antitrust boutique firm inside the Department of Justice, and we kicked ass.\n\nLike I said, we’re going to come back to it. The Department of Justice won on two of the three counts here. I just want to read you this quote, because I’m curious what you think this means. Google says, “We won half of this case, and we will appeal the other half. The court found that our advertiser tools and our acquisitions, such as DoubleClick, don’t harm competition. We disagree with the court’s decision regarding our publishers’ tools. Publishers have many options, and they choose Google because our ad tech tools are simple, affordable, and effective.”\n\nSounds to me like Google is as bad at math as it is in antitrust.\n\nOkay. So I’m curious about this.\n\nHalf of what? There were multiple claims inside all of those, right? So there were the publisher-side tools. There was the ad exchange, and then there were advertiser-side tools. We not only won on multiple claims involving both the publisher ad server and the ad exchange, but even though the court didn’t find a relevant market on the advertising tools, the court was quite clear that its power on that side of the market was relevant to understanding its power on the other sides of the market. So to say it’s spin would be a little charitable.\n\nWe’re onto the remedies phase now in both the search case and in the ad tech case. What do you want those remedies to be? The last time you were on, you couldn’t say, but you’ve told me you’re free now. What do you want those remedies to be?\n\nI’m free. Those remedies need to be structural and forward-looking. So structural means the company has too much power. It’s used that power, it’s abused that power, and particularly in the case of ad tech, it has conflicts of interest. Google represents buyers and sellers on the exchange and buys and sells on its own exchange. The only way to deal with that is to eliminate those conflicts of interest and to reduce its power.\n\nIn terms of forward-looking, we need to confront the market where it is today in light of a decade of anticompetitive behavior, and this is true in both search and in ad tech. The infrastructure, whether it’s search infrastructure and search advertising infrastructure or the ad tech infrastructure, is going to be used now going forward not only for current-day products, but also going forward as things morph into a web that includes a lot of AI-driven content and information and products.\n\nSo I think it needs to be structural. It needs to be definitive. It needs to be forward-looking. It needs to skate to where the puck is going, which, in this world, is a more AI-driven marketplace that still relies on a lot of the same infrastructure, just for different use cases.\n\nDo you think Google should be broken up?\n\nYes.\n\nHow would you break up Google?\n\nIn these cases, the Department of Justice has asked for Google to sell its Chrome browser, which was critical to the finding in the search case. In the context of ad tech, I think, again, it should not be able to own the buy side and sell side and exchange all at the same time, and I think that anybody who has even a passing familiarity with securities, financial, or commodities markets will tell you that that’s just table stakes.\n\nSo Google owns DFP, which stands for DoubleClick for Publishers. That’s what websites run to get the ad inventory. They own AdX, which is the exchange, and they own their own tools which advertisers use. Which of those would you want Google to sell?\n\nI think that’s going to require a little more work to figure it out. But I do worry about them owning the publisher-side tools, and then we’d worry about them recreating a lot of the same advertising and exchange tools and then creating that functionality somewhere else in the marketplace, like in a browser, for example.\n\nSo you need to have really good fencing-in remedies, as we call them in the industry, and other kinds of anti-circumvention provisions. I also do think that when you look across both cases, it’s quite clear that their strength flows from the small and medium-sized businesses that advertise on AdWords. That’s their core fire hose of demand, and that has been built now through two markets where they’ve been found to have violated the antitrust laws. So I think you need to take a very careful look at AdWords.\n\nI think an independent AdWords would be extraordinarily powerful and would address all of those conflicts of interest quite quickly. Now, ultimately, it’ll be up to the folks who are in the DOJ today and the state attorneys general to make that determination, just to be very clear. It’s out of my hands. I no longer have a say in the matter, but I think there’s a lot of value to be created.\n\nI think also — and Wall Street is now confronting this across a lot of different industries — that these conglomerates, by accumulating, acquiring all these assets, have actually destroyed a lot of value. You’d actually have more value created overnight, frankly, if you start divesting assets. You can look at what General Electric did, for example — voluntarily, not for antitrust reasons, but for business reasons.\n\nYou look at a company like Google, and just to be very clear, this asset wasn’t part of the case, but if Google divested YouTube, the Mag Seven would become the Mag Eight overnight, and you’d probably unlock a lot of shareholder or market value. There are two separate discussions. One is what needs to be done for the purposes of resolving the antitrust case, and I think there are structural remedies in terms of breakup that should be and will be on the table.\n\nThen there’s the second question, which is just from an efficiency and market perspective: are these companies too big? And are they locking up too much value or stifling too much value by holding onto assets that would be worth a lot more on their own?\n\nDo you think there’s a Google left if you peel off all those pieces? Again, I keep coming back to the open web. The open web right now relies on Google. It’s the number one referrer of traffic to websites. It is the number one monetization engine for all of those websites. Chrome is the dominant browser. You break that company up into a hundred little pieces. What’s left? Does the web persist, or does it all just become AI training data?\n\nWell, I think the web may, sadly, be turning into AI training data regardless of whether there are antitrust remedies. The fact of the matter is, Google is going to continue to exist after this case, and it’s going to continue to be a really significant company, just as AT&T continued after its breakup.\n\nBut AT&T reformed itself, like the Terminator.\n\nWell, it kind of did, that’s true. But I will also say, quite interestingly, it was the Reagan administration that ultimately pulled the trigger on breaking up AT&T. There were multiple cases going back to the ‘50s that involved patent divestitures, licenses, and other things. But ultimately, it was the Western Electric case, and that separated the hardware from the line, right?\n\nIt used to be that you had to rent a rotary phone from AT&T with their proprietary plug and plug it into the wall. The DOJ got AT&T to sell off Western Electric to break the hardware up from the line. And guess what? We saw tons of innovation. Companies first started building the phones with buttons rather than rotors, and then you saw cordless phones, and eventually you saw wireless and smartphones. So I think it was great for innovation.\n\nThere’s an argument that if the government hadn’t broken up AT&T, we all might be walking around with iPhones that have big rotors on them that had to be plugged into your wall. So a lot of antitrust over the years has actually unlocked a lot of innovation. Now, throughout the ‘80s and beyond, a lot of those antitrust breakups, whether it was in oil or in telecommunications or other areas, resulted in the companies reforming themselves in a very Borg-like way. The company re-assimilated its old components and created AT&T. So I think there are good questions about whether we should let them reformulate, but I think it is indisputable, at least in my view, that these breakups have actually generated rather than destroyed value.\n\nThe iPhone is an interesting one, because it launched with a singular executive on stage, and then by the time it actually came out, it was AT&T once again. So you just see that the industry kind of re-rolled itself up into different kinds of companies, maybe with the same name. But what’s fundamentally interesting to me is Microsoft. The Microsoft antitrust case is in a way what allowed Google to exist, right? It allowed the open web to thrive. Do you see a challenger like that to Google that hasn’t been able to exist because Google is dominant in the places where it’s dominant?\n\nAbsolutely. So to me, antitrust is most important when you reach inflection points in the market. So the AT&T case preceded the emergence of the PC. There’s an IBM antitrust case that preceded the emergence of software and operating systems. The Microsoft case immediately preceded the internet era and the launch of Google.\n\nI think what enforcers and the antitrust lawyers are concerned about is that incumbents, seeing these new threats and these new inflection points coming, will use their power to slow them down and make sure that they can transfer their dominance from market A to market B. They can incumbent-advantage into this new technology. But that’s not what you want. What you want as an enforcer is you want these new, nimble companies to emerge without the kind of lethargy of a big monopoly aircraft carrier, and you want someone who can move quickly and decisively.\n\nSo if Microsoft had won its antitrust case, who knows what would have happened? Perhaps it could have owned the browser market. Perhaps it could have owned the search market. It could have owned all these businesses. But instead, companies like Google and others were allowed to thrive. It’s not lost on us when we put this in our Apple case that iTunes and the iPod, which was really the precursor to the iPhone, really got traction when it went from being a Mac-only product to a Windows product, too.\n\nWhen you can use your iPod at the time with your Windows computer, because iTunes was available, that was something that was made possible by the Microsoft consent decree that involved competing media players being on Windows. So all of these things interact with one another. We’re sitting here now on the dawn of this new era. You had Web 1.0 and 2.0, and now we’re moving to the AI-based web, where you interact with agents and all other cool stuff that you all at The Verge talk about all the time. We want to make sure that those new companies, those little tech companies, those startups, those other incumbents in other areas who see as an opportunity to diversify can come in here and invent new technologies and compete on the merits rather than running into obstacles.\n\nIf you look at both Google cases, the obstacles were manmade, kind of like our economic problems today. They’re not due to better innovation. They’re due to contractual restrictions. It’s Google paying Apple $20 billion to lock up search defaults, it’s Google tying products and services together or giving itself first look or last look on auctions, which is what we proved in the ad tech case, rather than having an open auction where anybody can win. It’s putting sand in the gears or bumps on the road to slow other people down rather than speeding themselves up to innovate in order to compete.\n\nSure, I buy that argument with Microsoft, maybe because I was young and Microsoft was the evil empire during that time. But Google was like a cute upstart company that had slides in the office. You wanted the open web to win. The web itself was a new technology. Apple was on the brink of death. Steve Jobs was going to save the music industry with Jimmy Iovine. You wanted the iPod to succeed. I don’t know if anyone feels the same way about Sam Altman and OpenAI. Is that the company you’re trying to protect?\n\nNo, no.\n\nThe AI industry is made up of trillion-dollar giants., right? It’s not a bunch of kids.\n\nThat’s a separate problem. But I think part of what we’re trying to do is we’re trying to go giant by giant and make sure that they can’t use their power in one market to dominate another. So if you look at where the antitrust cases are, let’s look at the Big Four right now across the two agencies. It’s Google, Amazon, Apple, and Meta. The idea is saying, “Okay, we’ve had these massive conglomerates who are locking up commerce and locking up business and innovation who have become these sort of essential platforms, and they’re making it hard for new folks to emerge.”\n\nWhether you root for OpenAI or against OpenAI is a separate question. You can’t say that there should be no more innovation or no more progress. We just want to make sure that the markets are as competitive as possible. That’s a separate question, in my view, from whether we need other kinds of restrictions, like on privacy or data use or copyright. I think there are a lot of important conversations to be had.\n\nBut once a company has so much power, it’s hard to have market-based solutions to any of those problems if you don’t have competition. So you got to start by saying, “Let’s make the market as competitive as possible, figure out how a competitive market and all the innovations that flow from that can result in advances and help maybe get people innovate on better copyright solutions or better privacy solutions.”\n\nThen if there are market failures or safety, privacy, and security issues that aren’t being addressed by the market, then you can put some lines on the road so people can drive in the right lanes. But I think none of that works unless you have a free, fair, and competitive marketplace.\n\nBoth of these cases went to trial during the Biden administration, but the DOJ under Donald Trump looks very different. Pam Bondi is the new attorney general, replacing your former boss, Merrick Garland, and you yourself were replaced by Gail Slater. So now, as we enter the remedies phase of both cases, it’s a very open question as to whether Trump’s DOJ will be as aggressive against Google as it was when you worked there.\n\nEarlier, we were talking about you building a little law firm at the DOJ and that law firm being really good. Is the little law firm at the DOJ still as good as the one that you had?\n\nI hope so. I think they’ve lost some folks, and my hope is that I will give them the benefit of the doubt that people who are there now are, I think, talented people, like Gail and the others who are running it. All signs are that they’re going to continue with their foot on the pedal doing good work. So if they do, I will be there to cheer them on, support them, and give them the credit they deserve, and that’s where I hope we’ll be.\n\nOf course I worry, right? We built something. It was really successful but fragile, and I think there’s been a lot of damage done — forget the antitrust division, just more broadly to the government — due to DOGE, which I have a lot of feelings about, as well as about the villainization of government workers. I think what I saw was very different from what a lot of people portray about government workers. These are people who are working harder than folks in the private sector for less money and, frankly, are under-resourced, significantly so.\n\nThe value that we created for the economy was extraordinary, and I will say we did it at the antitrust division at zero cost to taxpayers, and I ran a unit with a budget surplus every year. We ran solely on Hart-Scott-Rodino fees. These are the merger filing fees. We did it with, again, a budget surplus. So we ran it very carefully and responsibly.\n\nSo I hope they continue doing that, but I hope that they continue investing in and maintaining and fortifying the resources that we developed. And, of course, everyone should run it the way they want to with their own stamp, but I think what we did was pretty special.\n\nHas your group, or the DOJ at large, been affected by DOGE and the cuts?\n\nI don’t know exactly. My sense is it’s mostly what’s happened at the DOJ more broadly. There were reports they wanted to shut down our San Francisco and Chicago offices, which boggled my mind, because the San Francisco office was absolutely critical in a lot of our big tech cases, including both Google cases, and our Chicago office was a center of excellence for antitrust enforcement in the agriculture industry, which people care a lot about, especially farmers. Even from just a pure political perspective, that’s a widely popular program with people like Senator Grassley and others.\n\nSo I hope that smarter heads prevail and that they don’t do any of that. I don’t know that that was being driven by the antitrust division, but I think those are more of the DOGE-style efforts where people who don’t really understand how things work come in, feel like they need to break something in order to prove that they’re doing their jobs, and then end up causing more harm than good.\n\nYou ran a pretty independent operation from Merrick Garland, the attorney general under Biden. That seems to be going away in the Trump administration. There’s the unitary executive theory, that Trump is actually making all the decisions, and then all of his appointments are just extensions of him. Pam Bondi is firing attorneys and trying to wrestle control of various divisions. Describe how independent you were and how independent you perceive the current Antitrust Division, to be specific.\n\nSo we worked very well with the rest of the Department of Justice, including with the attorney general, and there is a culture which I think he was trying to restore, appropriately so, that enforcement needs to be done for the right reasons and not for political reasons. So I think creating centers of excellence inside the Department of Justice, giving prosecutors and lawyers the ability to investigate and bring cases that are right on the law and right on the facts, is the right way to do it. It’s consistent with the broader policy objectives of the administration and the attorney general.\n\nWe found, I think, the right balance, and it’s hard. I think a lot of the concerns that are occurring now are that by doing a seat-of-the-pants, political rolling-up of power — and taking away those principles of prosecution being done on the facts and the law in a way that is sufficiently distinct from political considerations — creates a risk of corruption and risks undermining the confidence in our judicial system.\n\nI think when it comes to the law, and when it comes to using the awesome power of the Department of Justice and its ability to prosecute private individuals and corporations, we need to make sure that we’re doing it responsibly. One is we’re holding bad actors to account regardless of their political influence, heft, or donations; and two, that we are doing it the right way for the right reasons.\n\nDo you think Gail Slater is sufficiently independent of Pam Bondi?\n\nI don’t know what’s going on in the DOJ. I have a lot of confidence in Gail. I know her well, and I think she is a good actor. My hope is that, left to her own devices, she will do an excellent job. But there are things that are happening in the administration more broadly that do concern me.\n\nWell, I asked that because our readers have reacted to this news with what I can only describe as nihilism. Not just some readers, but almost all of them. That was the reaction to our coverage of the case. It’s in the comments on our website. It’s in the replies to me on Bluesky with people saying, “Well, then Google will just buy themselves out of this. They’ll just write a check to Donald Trump, and the case will go away.” They think that this doesn’t matter because at some point, it’s going to hit some level of transactional Donald Trumpism, and that’s why they were all on stage with him at the inauguration. Do you think that view is credible?\n\nWell, I think we should watch and find out. I mean, so far, that hasn’t happened, at least in these cases. The DOJ is going to court on the Google remedies, and the FTC is going to court on the Facebook case. Frankly, let’s be clear, that shouldn’t be celebrated on its own. That’s the right thing to do. The cases should be brought for the right reasons, and people shouldn’t be able to buy their way out of antitrust cases through political donations and favors.\n\nNow, when you have Tim Cook, [Google executives] Sundar Pichai and Sergey Brin, Jeff Bezos, and Zuckerberg and others toasty and warm inside the rotunda on a cold day during the inauguration, it creates a perception that leads to the reaction that your readers are having. That’s why those kinds of things matter. Those appearances undermine confidence and trust in the government, and that’s a problem. I sure as heck hope that they are not buying their way out of legitimate antitrust cases or other prosecutions. Only time will tell.\n\nYou said this two-word phrase earlier. You said “little tech.” That’s an Andreessen Horowitz phrase. That’s a phrase they use to describe how much they want to see things like NFTs on the iPhone being sold without Apple’s 30% tax. That’s a real thing they want. That’s a thing they used to describe Google’s dominance of the web.\n\nJD Vance has very specifically said that Google was a problem for him when he was a VC. At one point, he said Lina Khan was the only good member of the Biden administration. That’s the former chair of the Federal Trade Commission. That’s one side of the tech industry. Then there’s the oligarchs and there’s MAGA, the general MAGA movement, which is very populist. There are some weird lines between all three of these.\n\nWe just covered an antitrust event put on by Y Combinator where Lina Khan took a selfie with Steve Bannon. I would have never expected this in the past, but these are the new kind of addled lines. As you look at these cases and see how they’re going to move through the system, how do you think that’s going to break down?\n\nSo listen, let me start by saying that when I was in office, I was fortunate to have bipartisan support for antitrust, and that was a good thing. I don’t view that as a problem. I view that as a rarity, and an unfortunate rarity in today’s society, where you actually can have agreement on things among people who sit on both sides of the aisle.\n\nAt the same time, I had Republicans and Democrats who were unhappy with what we were doing, and it just didn’t neatly break down along neat political lines, and that’s fine. I think if that’s the case for antitrust, that’s a good thing, and we shouldn’t shy away from that. Of course, there’ll be differences and people might do different things or have different motivations for what they’re doing, but so long as they’re done for legitimate policy and law enforcement reasons, I think I’m pleased that we have actual continuity.\n\nI think it’s something we should celebrate rather than reject, but I also understand at the same time why there’s a degree of distrust and concern. Again, when you see these modern-day oligarchs in the rotunda giving money and trying to buy their way out of antitrust cases, it raises concerns. We should not have a government that’s coin-operated that way, and hopefully we won’t.\n\nCoin-operated is a good phrase. We’ve been calling it “gangster tech regulation,” because it just feels like there’s just a lot of threats and leverage and people are paying each other off, and that’s how it’s going to end up.\n\nBut just so I can be an equal-opportunity critic, I was just as critical, and still am, of the role that Google had in the Obama administration. They were way too cozy with the Obama administration. They were in and out of that White House like they lived there. I think it wasn’t right then and it’s not right now.\n\nLet me ask you about the other law firm in the government that pursues antitrust cases. That’s the Federal Trade Commission. I’ve got you here now, and I have to ask you about the Meta case that’s ongoing right now that’s run by the FTC. That case, I believe, was filed in the first Trump administration, pursued by Lina Khan’s FTC, and now it’s being taken to trial by the Trump FTC. Straightforwardly, is the FTC as good of a law firm as the DOJ?\n\nI think they’re pretty damn good. I know some of the people over there. Their head of the Bureau of Competition was one of our leads on the Google ad tech case at the DOJ, and they have some excellent lawyers over there. They did during our admin, and they do now. I will also note for the record, I’m a proud alum of the FTC. I started my career as a lawyer there.\n\nSo they’re a terrific group of people. They’re excellent litigators. They have a wonderful litigation team on the Meta case. By all accounts, they’re doing a pretty good job in court. It’s too soon to say how it’s going to result, but I think they’ve done a good job so far, an excellent job, in terms of putting on good witnesses and surfacing the right documents. So yeah, I’m a big fan of the FTC, and I will remain so. Hopefully, the FTC will continue to exist as an independent agency, but we’ll have to see.\n\nWe’ll come to that. I actually disagree with you, and I was hoping you would take the bait.\n\nI’ve been watching the Meta case very carefully. That case seems way harder than either of the two Google cases that you managed to win, because Google runs in an open ecosystem. It has to make deals with third parties. There’s lots of evidence in the various Google cases of its emails, of its contracts, of how it deals with Android vendors and Apple and whoever else.\n\nGoogle is also just chattier as a company, it seems, even though they had gotten some trouble suppressing evidence. Meta, on the other hand — the FTC has struggled and continues to struggle to even describe what Facebook is. The market definition tripped this case up so badly that, at one point, it went away, and they had to refile the complaint.\n\nAnd now we’re in court, and the FTC is claiming that Meta has no competitor, save Snap and some tiny social network called MeWe. And to me, that feels like a strategic blunder. We’re struggling to even define what this company is that we say is dominant. How would you have done that differently?\n\nWell, I don’t know if I would do it differently. Let me just try to give you a sense of what I think they’re trying to say, which is that a social graph is different than a performance graph. And so, if you think about YouTube and TikTok, it’s about an audience connecting with people that they want to perform for them, whether that’s singing and dancing or podcasting, or whatever people on TikTok do, which is a combination of all of them. It’s about being entertained or informed by people that you generally don’t know, but admire or interested in hearing from.\n\nI think the FTC is seeing that as distinct from connecting to people that you do know, friends and family. And so, the social graph or the perspective of communicating and sharing family pictures and reconnecting with people from your school and communities, and it’s different — using the tools for different reasons.\n\nWhat the commission is saying is that that’s how Facebook views it internally, and that’s how they’ve distinguished themselves, and that’s why they view themselves as different from a TikTok, for example, or YouTube, and essentially offer different functionality for different purposes, and so that the two coexist. Now, I see you smiling as if you don’t necessarily agree, but I think it’s a factual question.\n\nI’m just saying, take the compliment! I’m saying you did a better job in your cases than they did in this one. How would you have done this one better? Would you have pursued that theory of the case?\n\nPerhaps. I think it is a plausible, good theory, which is that social graphs are different than what TikTok does, and I think one of the things that they really have going for them is the documents in those cases are fire. It’s not as if they just made a better product, according to the FTC. What the commission is saying is that they said, “Shit, the biggest threat to us is if somebody starts peeling off messaging and photos and other things that are central to our social graph-based product, and then they go off.”\n\nAnd that’s what Instagram and WhatsApp were doing according to the FTC. They were off-ramps. They were a way to start building bridges to people creating new networks. They were disintermediating. They were removing friction. They were filling them out, whichever metaphor you want to use. And instead of competing by building their own stuff, which [Meta was] trying to do and not doing as good a job, the FTC is saying they just went and bought them, and said so in their documents that, “We’re buying them because they’re a competitive threat, and we’re going to neutralize that competitive threat so that we can maintain our power.” I think if the court focuses on the words of the executives, they have a very strong case.\n\nI think I look at it and I say, “Well, Facebook today is not just about friends and family. It’s a feed full of stuff from all kinds of people, and TikTok is a competitive threat to them.”\n\nYeah. But I think there’s one thing that’s true in antitrust that’s worth distinguishing: Just because they compete for some part of the business, doesn’t mean they compete for all of it. While there may be aspects of Facebook or Instagram that do what TikTok does, it’s not true that TikTok does everything that Facebook does, or a big chunk of it, which is the friends and family piece. And from my perspective, that’s where the FTC is focusing.\n\nAndrew Ferguson is the new head of the FTC. Donald Trump has fired the Democratic commissioners of the FTC. That appears to be illegal under a 100-year-old statute that lots of people want to talk about, but we’ll set aside for the purpose of this conversation.\n\nAndrew Ferguson is a fire breather. He got that job by writing a letter to Donald Trump, basically saying everything Lina Khan did was bad. I mean, I’ll just read the quotes: “Lina Khan should stop abusing FTC enforcement authorities as a substitute for comprehensive federal privacy legislation. She should stop bringing novel and legally dubious consumer protection cases. I will end Lina Khan’s politically motivated investigations.”\n\nAnd here we are. We’re pursuing the Meta case, and none of that stuff is coming up in this case. None of the censorship stuff that Trump likes to talk about is coming up in this case. Do you think that this case is still as legally clean as it was before? Because right now, it seems like leverage, and if anything gets a deal made for exit ramp, it feels like this case is right on the line.\n\nWe can voice those concerns, and as I said earlier, I think when you have an administration that presents itself as being coin-operated, it opens itself up to that degree of distrust and concerns about whether things are being done for the wrong reasons.\n\nThey’re trying the case the right way. They’re not trying it like a coin-operated operation. They’re trying it the same way that Trump 1 did, Chair Khan’s FTC, and now Chair Ferguson’s FTC.\n\nIn terms of what they’re putting in front of the court, I think it’s very much in line with how it’s been done, and it’s being tried the right way in a very sensible, professional, legal manner, one that does not appear politically motivated. What happens in the future, and whether they settle something or take the 25-cent coin in the slot and spit out a Dr Pepper full of settlements, I don’t know, but I hope they don’t.\n\nIt’s a couple million dollars to the library, actually, that’s how much it costs. Speaking of a couple million dollars to the library, Tim Cook did pay $1 million for Donald Trump’s library. Apple is the next big case. That’s your case at the DOJ, saying Apple uses the power of iOS to prevent all kinds of applications from being developed. My favorite part of it is the limitations on CarPlay. We talk about CarPlay a lot on this show for some reason.\n\nHow do you think that one’s going to go now?\n\nWe’ll see. I hope they do the right thing for the right reasons. It’s a strong case. It is an important case, and Apple is a company that has extracted a lot of money from a lot of people for the same product without necessarily corresponding innovations. Once it was this incredibly visionary and innovative company. A lot of what they’re doing now, at least our case [alleges], was restricting the innovations of others in order to maintain their own position and be able to extract fees — fees from developers, fees from Google in terms of its search engine, fees from banks in terms of basis points on tap-to-pay transactions, from car manufacturers and others.\n\nIt is an extraordinarily profitable and extractive business, but it’s maintaining that position by restricting the ability of others to innovate. And so, our case was not about saying, “Apple, you have to stop innovating.” It’s, “Apple, go innovate the way you want to. Just stop telling others how they can and can’t build their products and services.”\n\nThis has been a theme of this conversation, the idea that the power of law enforcement is enormous, the government should wield it responsibly, and there’s a right way to do these things. There’s also a wrong way to do these things. There’s a way to tell these stories.\n\nThis government, in particular, is not prone to using that power responsibly. We see it all over the place. We see the irresponsible use of power, power for power’s sake, all over the place with the Trump administration, particularly here in the second term. These huge companies in the first term were checks on that power; they were the ones who stood up and said, “No, we’re actually not going to do this.”\n\nThe stock market tanking, at least in the first term, would sometimes stop Trump from indulging his worst impulses, maybe less so in the second term, but it still seems to have some effect on him. Tariffs, imports, the tech industry, AI — all that stuff is wrapped up in these huge companies. Do you think there’s any danger at all in all of these enforcement actions being taken against the very companies that might otherwise check the worst impulses of this administration?\n\nNo. I think that’s exactly the wrong way to think about it, which is that we are at our best when we have rule of law. People come to this country because there’s rule of law. What distinguishes us from a tin-pot dictatorship or banana republic is not that we have a Constitution, but that we have checks and balances and the court system to enforce the laws.\n\nSaying that we need to allow these companies to become powerful, well — they were showing up to the inauguration, and they’re giving money. And they’re doing business with China. It’s not as if they are an extension of the US military or the US government. They’re private companies, and those institutions should speak up for the rule of law, because, frankly, they benefit. They might not like our antitrust case, but their ability to make the kinds of profits for themselves and their shareholders flows from having an open marketplace and society.\n\nI think what’s happening now is a going after all of those institutions that function as checks, independent businesses rather than having nationalized businesses. It’s independent law firms rather than having nationalized law firms. It’s courts. It’s universities that seek truth through scientific research and political thought and debate and speech, and many others.\n\nThose institutions matter a great deal to our freedom. They matter a great deal to our progress, and it is one of the reasons, if not one of the most significant reasons, that people want to do business in the United States, that they want to come to school here, that they want to build their businesses here, that they want to rely on our currency: because they believe in the stability of our nation.\n\nOnce we start undermining that trust, and once we look like we’re coin-operated, once we look like that, once people are concerned that the rule of law no longer has power and effect, they’re going to stop investing in the United States and they’re going to find other partners, and that is going to put us at a major disadvantage and set us back decades, if not more.\n\nIf people listening to this hear you and they’re inspired by it, what do you think folks can do?\n\nDon’t compromise on your core principles.\n\nFocus on what matters. The rule of law matters. Hold your leaders accountable. Vote. Make sure that elections are fair. Make sure that your voices are heard.\n\nWe can’t be complacent, and I think sitting back and letting somebody take our democracy bit by bit, institution by institution, is only going to result in there being nobody left to fight.\n\nSo if you see something that’s wrong, stand up for [what’s right]. I think whether it’s a university or a law firm or a judge, we need to stand up for our independence, and I think that includes making sure that our courts have the freedom to reach decisions; that the executive branch follows the directions of our courts, as our Constitution demands; that our institutions, like universities, have the freedom to seek out truth; that our law firms are free to defend, without reservation or hesitation, independent actors from government overreach. That’s how our system works, and we need to protect it.\n\nIt’s rare that a conversation on antitrust ends with a stirring call to defend the Constitution, but I think that’s where we are now. Jonathan, this has been wonderful. We’re going to have to have you back for a fourth time. Thanks.\n\nI love it. Thanks so much.\n\nQuestions or comments about this episode? Hit us up at decoder@theverge.com. We really do read every email!\n\nDecoder with Nilay Patel A podcast from The Verge about big ideas and other problems. SUBSCRIBE NOW!"
    },
    {
        "title": "Google will pay a $1.375 billion settlement to Texas over privacy violations",
        "description": "Google is set to pay $1.375 billion to settle claims of data privacy violations brought by Texas Attorney General Ken Paxton, according to a press release. Texas filed two lawsuits in 2022 against Google for “unlawfully tracking and collecting users’ private …",
        "url": "https://www.theverge.com/news/664663/google-texas-settlement-1-billion-data-privacy-violations",
        "source": "The Verge",
        "publishedAt": "2025-05-10T00:12:04Z",
        "full_text": "is a news editor covering technology, gaming, and more. He joined The Verge in 2019 after nearly two years at Techmeme.\n\nGoogle is set to pay $1.375 billion to settle claims of data privacy violations brought by Texas Attorney General Ken Paxton, according to a press release.\n\nTexas filed two lawsuits in 2022 against Google for “unlawfully tracking and collecting users’ private data regarding geolocation, incognito searches, and biometric data,” the release says. Before now, no single state has “attained a settlement against Google for similar data-privacy violations greater than $93 million.”\n\n“This settles a raft of old claims, many of which have already been resolved elsewhere, concerning product policies we have long since changed,” Google spokesperson José Castañeda tells The Verge. “We are pleased to put them behind us, and we will continue to build robust privacy controls into our services.”\n\nIn 2022, Google agreed to pay $391.5 million to 40 states over allegations of location tracking without user consent. Last year, Meta agreed to a $1.4 billion settlement with Texas over facial recognition and photo tags."
    },
    {
        "title": "Meta and Spotify are teaming up to lobby against Apple and Google",
        "description": "Meta has joined forces with Spotify, Garmin, Match, and others to form a lobby group to represent their interests, especially as they come into conflict with those of Apple and Google. The group’s first order of business is arguing that age verification shoul…",
        "url": "https://www.theverge.com/news/659443/meta-spotify-match-garmin-lobby-group-apple-google-age-verification",
        "source": "The Verge",
        "publishedAt": "2025-05-01T13:31:01Z",
        "full_text": "Meta has joined forces with Spotify, Garmin, Match, and others to form a lobby group to represent their interests, especially as they come into conflict with those of Apple and Google. The group’s first order of business is arguing that age verification should be the responsibility of app stores, and not the apps themselves.\n\nBloomberg reports that the Coalition for a Competitive Mobile Experience will fight for app makers’ interests on a range of fronts, including ensuring that Apple and Google products work well with rivals’ devices and software, fighting what’s perceived as discrimination from the App Store and Play Store, and aiding the Justice Department in its ongoing antitrust cases against Apple and Google.\n\n“What these founding companies share in common is they rely on the mobile ecosystem in order to serve their customers,” Brandon Kressin, the director of the coalition, told Bloomberg. “They each recognize there’s power in numbers, especially when going up against companies as powerful as the duopoly.”\n\nRight now, the group’s priority is joining Meta’s ongoing efforts to persuade lawmakers that app stores should bear the responsibility for controlling which apps children can download, saving the apps themselves from the brunt of age verification. Google, for its part, says Meta is trying to “offload” its responsibility to keep kids safe. Utah has already passed a law requiring app stores to verify user ages, and the new coalition intends to support similar bills in other states, and efforts to introduce equivalents in the House and Senate.\n\nThe new coalition announced itself just hours before Apple suffered a major defeat in its ongoing litigation against Epic. The judge ruled that Apple is no longer allowed to collect fees on purchases made outside apps or restrict how developers can direct users to other payment options."
    },
    {
        "title": "Eddy Cue is fighting to save Apple’s $20 billion paycheck from Google",
        "description": "Microsoft's Bing or DuckDuckGo probably won't disrupt Google's dominance in search, said Apple senior vice president of services Eddy Cue - but AI services easily could. Cue was returning to a courtroom in Washington, DC where he last testified in the Justice…",
        "url": "https://www.theverge.com/policy/662974/google-search-remedies-trial-eddy-cue-apple-deal-ai",
        "source": "The Verge",
        "publishedAt": "2025-05-07T21:40:34Z",
        "full_text": "is a senior policy reporter at The Verge, covering the intersection of Silicon Valley and Capitol Hill. She spent 5 years covering tech policy at CNBC, writing about antitrust, privacy, and content moderation reform.\n\nMicrosoft’s Bing or DuckDuckGo probably won’t disrupt Google’s dominance in search, said Apple senior vice president of services Eddy Cue — but AI services easily could.\n\nCue was returning to a courtroom in Washington, DC where he last testified in the Justice Department’s trial against Google’s search monopoly in September 2023. During the current remedies trial on Wednesday, Cue said that in the time since, well-funded generative AI upstarts have made such significant advancements that they could ultimately disrupt that monopoly — perhaps more effectively than the court could.\n\nCue was also, however, there to defend a significant source of Apple’s revenue: the payments Google offers for default search engine placement on Apple’s Safari browser.\n\nAfter the 2023 trial, Judge Amit Mehta found that Google illegally monopolized the online search market, in part through agreements like the Safari deal. For the last two and a half weeks, Google and the DOJ have pitched Mehta on what he should (or shouldn’t) do to fix the problem. The DOJ says Google should be forced to share valuable search data with competitors and spin off its Chrome browser, while Google (which plans to appeal the earlier ruling) wants only restrictions on the deals Mehta deemed unfairly exclusionary. And rather than barring its Apple deal altogether, it would make Google give Apple more flexibility to sign additional default search agreements across its various devices or in private browsing mode.\n\nCue argued Wednesday that rapid AI advancements mean the antitrust threat Mehta identified is shrinking. For the first time in 22 years, Cue said, Apple saw search volume decline in its Safari browser last month — a side effect of users seeking more information from AI chatbots. The DOJ, unsurprisingly, disagrees. It’s not uncommon for technological development to outpace the slow trudge of the court system, but the government says that pace isn’t fast enough to fix a persistent market issue.\n\nApple has a lot of skin in the game here — the DOJ previously revealed it rakes in $20 billion in payments from Google annually. Google’s proposed remedies could reduce it, but they would also open up Apple’s options and preserve much of its revenue flow. The DOJ’s, meanwhile, could wipe out that cash flow altogether. Cue seemed bewildered that Apple could get the short end of the stick for a punishment supposedly inflicted on Google. The idea that the court could decide Google did something wrong and then let it save money at Apple’s expense, he said, “just seems crazy to me.”\n\nGoogle could even keep its prime Safari placement without a deal in the short term, Cue said. “We don’t really have a choice today,” he testified. Even if Apple could cut a new default deal with another company, Google is still the best service available for customers, so they’d probably seek it out — and Apple wouldn’t get a cut. Cue said he’s “lost a lot of sleep” over the prospect of losing the Google deal, and warned it would impact Apple’s ability to make new products.\n\nCue also told Mehta he “can’t say I disagree” with his analysis that Apple was disincentivized from building its own search engine because of its deal with Google. But, he added, “we can’t do everything,” and since Google is really good at what it does, Apple prefers to focus on areas where it can offer unique value.\n\nThere’s “much greater potential because there are new entrants that are attacking the problem in a different way”\n\nAI could eventually change all of this, Cue testified. Apple is already exploring adding AI search options, though it recognizes they can’t yet replace traditional search engines. “To date, they’re just not good enough,” he said.\n\nCue said “good enough” could come sooner than he anticipated. He said there’s “much greater potential because there are new entrants that are attacking the problem in a different way.” Large language model (LLM) AI companies haven’t built a robust enough search index to substitute for Google yet, he said, but combining an LLM with search could let them use a smaller index effectively soon.\n\nEven though he is backing Google’s fight to keep its search deals, he seemed to acknowledge that the DOJ’s proposal to syndicate Google’s search index could get AI rivals up to speed even faster.\n\nCue cautioned the judge that tech is not like other industries, and giants often fall even without court intervention. “When I got to Silicon Valley, all of the best companies, or the most successful companies, either don’t exist today or are significantly smaller and less impactful,” Cue said, pointing to companies like HP, Sun Microsystems, and Intel. In the technology field, being an incumbent might not offer the same benefits it does in other markets. “We’re not an oil company, we’re not toothpaste. These are things that are going to last forever,” he said. “You may not need an iPhone 10 years from now.” After nearly four decades at Apple, Cue now sees AI as “a huge technological shift.”\n\nPutting himself in the judge’s shoes, Cue told Mehta, “we’re lucky, because honestly, if AI had not come about, I don’t know what you could do.” That’s because, he explained, “until there are truly competitive products, people will keep using the best one.”"
    },
    {
        "title": "Google is scrapping its planned changes for third-party cookies in Chrome",
        "description": "Google’s plan to phase out third-party cookies in Chrome is officially over. In an update on Tuesday, Google Privacy Sandbox VP Anthony Chavez says the company has decided “to maintain our current approach to offering users third-party cookie choice in Chrome…",
        "url": "https://www.theverge.com/news/653964/google-privacy-sandbox-plans-scrapped-third-party-cookies",
        "source": "The Verge",
        "publishedAt": "2025-04-22T22:06:40Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nGoogle’s plan to phase out third-party cookies in Chrome is officially over. In an update on Tuesday, Google Privacy Sandbox VP Anthony Chavez says the company has decided “to maintain our current approach to offering users third-party cookie choice in Chrome.”\n\nFor years, critics have argued that Google’s Privacy Sandbox could harm advertisers and violate privacy laws, while the Electronic Frontier Foundation (EFF) told users to opt out of the program, saying it “is still tracking your internet use for Google’s behavioral advertising.” Last week, a US judge found that Google “willfully engaged in a series of anticompetitive acts” in the advertising technology industry, and the competition regulator in the UK, the Competition and Markets Authority (CMA), has been investigating its evolving series of proposals to address concerns that they might give Google an unfair advantage.\n\nGoogle’s Privacy Sandbox initiative was announced in 2020 with plans to block third-party cookies in Chrome by default, similar to Firefox and Safari. It has made several changes to the initiative over the years, such as proposals like its Topics API to assign interests to users based on their web activity and other tools it said could target ads while still offering some privacy. But following years of delays and scrutiny, Google said last year that it would let users choose whether to opt into a cookie-less Chrome. Now, it appears the initiative has come almost completely to an end.\n\n“As we’ve engaged with the ecosystem, including publishers, developers, regulators, and the ads industry, it remains clear that there are divergent perspectives on making changes that could impact the availability of third-party cookies,” Chavez writes, adding that Google “will not be rolling out a new standalone prompt for third-party cookies.”\n\nThe Movement for an Open Web (MOW), which filed a complaint with the CMA about the initiative in 2020, said Google’s latest update is an “admission” that the Privacy Sandbox is over.\n\n“Google’s intention was to remove open and interoperable communications standards to bring digital advertising traffic under their sole control and, with this announcement, that aim is now over,” MOW co-founder James Rosewell said in an emailed statement to The Verge. “They’ve recognised that the regulatory obstacles to their monopolistic project are insurmountable and have given up.”"
    },
    {
        "title": "Google, Apple, and Snap aren’t happy about Meta’s poorly-redacted slides",
        "description": "During Meta’s antitrust trial today, lawyers representing Apple, Google, and Snap each expressed irritation with Meta over the slides it presented on Monday that The Verge found to contain easy-to-remove redactions. Attorneys for both Apple and Snap called th…",
        "url": "https://www.theverge.com/news/649834/meta-redactions-apple-google-snap-angry-ftc-antitrust-trial",
        "source": "The Verge",
        "publishedAt": "2025-04-16T18:18:33Z",
        "full_text": "is a weekend editor who covers the latest in tech and entertainment. He has written news, reviews, and more as a tech journalist since 2020.\n\nDuring Meta’s antitrust trial today, lawyers representing Apple, Google, and Snap each expressed irritation with Meta over the slides it presented on Monday that The Verge found to contain easy-to-remove redactions. Attorneys for both Apple and Snap called the errors “egregious,” with Apple’s representative indicating that it may not be able to trust Meta with its internal information in the future. Google’s attorney also blamed Meta for jeopardizing the search giant’s data with the mistake.\n\nDetails about the attorneys’ comments come from The Verge’s Lauren Feiner, who is currently in the courtroom where proceedings are taking place today. Apple, Google, and Meta did not immediately respond to The Verge’s request for comment. Snap declined to comment.\n\nSnap’s attorney maligned Meta’s “cavalier approach and casual disregard” of other companies swept into the case, and wondered if “Meta would have applied meaningful redactions if it were its own information that was at stake.” Meta attorney Mark Hansen suggested using a third party that’s not involved in the trial team to work on redactions.\n\nEven prior to the discovery of the redactions issue, Snap had been upset about what it called confidential information being shared during opening statements. (The company didn’t specify precisely which information it considered confidential.) Hansen said yesterday that he didn’t believe he revealed anything confidential in the company’s opening statements, an assessment Snap’s attorney disagreed with.\n\nAs for why Meta didn’t let Snap know it would be including the information, Hansen said that he didn’t want to give the company a heads up about what it’s presenting at trial because “very clearly, Snap is working with the FTC. Snap is a major competitor.”\n\nThough clearly redacted for a reason, as they shared information from inside other companies that wasn’t intended for public viewing, the unredacted documents didn’t reveal particularly juicy information. One segment mentioned that iPhone users tend to prefer Apple’s own Messages app to those of Meta and Snap, while another slide, labeled “Snapchat in 2020: Competitors Are Succeeding and Not Just Meta Apps,” noted that its competitors, including Meta’s apps and TikTok, were “thriving.”\n\nTo Snap and the other companies, how juicy the details were isn’t the point. Snap’s attorney accused Meta’s lead attorney of openly referencing Snap’s competitive assessments that should have been private."
    },
    {
        "title": "DOJ asks court to split up Google’s ad tech empire",
        "description": "The US Department of Justice filed a plan in court to make Google divest its advertising marketplace and ad management platform, part of a proposal to address the company’s “decade-long campaign of exclusionary conduct,” which a judge has declared violates an…",
        "url": "https://www.theverge.com/news/661833/google-ad-tech-business-doj-break-up",
        "source": "The Verge",
        "publishedAt": "2025-05-06T14:44:03Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nThe US Department of Justice filed a plan in court to make Google divest its advertising marketplace and ad management platform, part of a proposal to address the company’s “decade-long campaign of exclusionary conduct,” which a judge has declared violates antitrust law.\n\nOn Monday, the DOJ and Google both filed requests for remedying the tech giant’s legally declared ad-tech monopoly. The DOJ plan proposes having Google sell two major pieces of its business: its Ad Exchange (AdX) and its ad management platform DoubleClick for Publishers (DFP), which is now called Google Ad Manager. Google, which plans to appeal the original verdict, asks the court to require targeted changes in certain business practices while leaving the company intact.\n\nThe DOJ’s AdX sale pitch cites the court’s April ruling that AdX made it “more difficult for customers on both sides of the ad exchange market to switch to rival exchanges.” It says that Google should sell its AdX business “as soon as possible,” while implementing an interim remedy that would require the marketplace to work with other systems. It also proposes preventing Google from operating an ad exchange for 10 years.\n\nThe DOJ suggests a “phased” divestiture of Ad Manager/DFP. This divestiture addresses a ruling that Google forced customers to use a product “they would not necessarily have otherwise used” by tying DFP to AdX, while also implementing policies that customers disliked, according to the DOJ.\n\nFor the first phase, the DOJ proposes having Google create an API that would allow the platform to integrate with other ad exchanges, as well as provide an export feature that would let publishers transfer their data from DFP to another ad server. The DOJ then suggests forcing Google to release the code used to carry out final ad auctions under an open-source license, while blocking it from “hosting or recreating” the code in any of its products, including DFP, Android, and Chrome. The final phase of the DOJ’s proposal would require Google to divest the remainder of DFP to an entity separate from the one that acquires AdX.\n\nAlong with these proposals, the DOJ suggests forcing Google to share the data it obtained through DFP and says it shouldn’t use first-party data from YouTube, Gmail, Search, Chrome, and Android to gain an unfair advantage.\n\nGoogle, of course, disagrees with these proposals. In a filing outlining its proposed remedies, Google argues that it shouldn’t be forced to sell AdX or DFP because it fairly acquired these businesses without unlawful intent. Google adds that because of the services’ design, “divestiture is not as simple as selling either the AdX or DFP source code to a willing buyer.” The company claims divestiture would require the creation of new versions of AdX and DFP that work outside Google, a process it estimates would take at least five years.\n\n“In the meantime, this process would significantly harm the customers of AdX and DFP,” Google says. “During the years of rebuilding either or both of AdX and DFP, coding new versions of the tools would conscript precious resources, including the limited universe of software engineers familiar with these tools, that are currently devoted to maintaining and improving AdX and DFP.”\n\nTo resolve the court’s concerns, Google proposes barring a handful of business practices that the DOJ singled out for criticism in court. It commits to making real-time bids from AdX available to rival ad servers, as well as removing policies that prevent these bids from being shared with competitors. It also says it would deprecate unified pricing rules (UPR), which the DOJ claims it used to unfairly gain control in the ad tech market. Google would also promise not to rebuild the First Look and Last Look tools — which gave Google a leg up in ad auctions — that it discontinued in 2019.\n\nThe tech giant is under mounting pressure from the DOJ, which is currently in court asking a judge to make Google sell Chrome as part of a separate antitrust case that saw Google search ruled a monopoly. These new proposals threaten to split up Google’s sprawling empire even further."
    },
    {
        "title": "The Pixel Watch 2 is now on sale for $100 off",
        "description": "If you’re an Android user who has been staring longingly at the wrists of people with smartwatches, but haven’t had the impetus (or the cash) to buy one yourself, this may be your chance. The last-gen Google Pixel Watch 2 is currently on sale at Amazon, Best …",
        "url": "https://www.theverge.com/tech/657220/pixel-watch-apple-ue-buds-sale-deal",
        "source": "The Verge",
        "publishedAt": "2025-04-28T16:50:14Z",
        "full_text": "If you’re an Android user who has been staring longingly at the wrists of people with smartwatches, but haven’t had the impetus (or the cash) to buy one yourself, this may be your chance. The last-gen Google Pixel Watch 2 is currently on sale at Amazon, Best Buy, and Google for about $149, a savings of $100 off of its usual price of $249 and only $4 more than its lowest past price of $145.\n\n\n\nThe 41mm Pixel Watch 2 is Google’s second try at creating a smart watch that would compete with the Apple Watch, and while it doesn’t quite come up to the standards of the latest Google Watch 3, it is still a solid and useful device. It comes with sensors for heart rate tracking, skin temperature, and stress management, Emergency SOS and fall detection, and a safety check feature for when you’re trying to get home okay in tricky situations. It also has a battery that will last you all day — something that its predecessor lacked. Read our review.\n\n\n\nOn the other hand, if you’re determined to get the latest model of Google’s watch, the 41mm version of the Pixel Watch 3 is also on sale at Amazon and Google for $299.99, which is $50 off its usual price of $349.99. Our reviewer found that the Watch 3 offered a multitude of tweaks and improvements that added up to a better experience, including a brighter display and smaller bezel, even better battery life, and a bunch of fitness and health updates, including custom running workouts and a revamped daily readiness score. Read our review."
    },
    {
        "title": "Is Google’s smart tag network any good yet?",
        "description": "When Google launched its long-awaited Find My Device network in April 2024, it arrived to… well, what's the opposite of \"fanfare\"? A slow network rollout and damning reviews dampened enthusiasm for what was supposed to be a wave of Android-powered rivals to A…",
        "url": "https://www.theverge.com/google/655319/google-find-my-device-smart-tag-network-one-year-later",
        "source": "The Verge",
        "publishedAt": "2025-04-24T20:03:29Z",
        "full_text": "When Google launched its long-awaited Find My Device network in April 2024, it arrived to… well, what’s the opposite of “fanfare”? A slow network rollout and damning reviews dampened enthusiasm for what was supposed to be a wave of Android-powered rivals to Apple’s AirTag. But a year’s a long time in tech, and Google has been promising improvements almost since Find My Device was first switched on. I wanted to know: have things gotten any better?\n\nTo find out, I set about testing the latest trackers from the three main companies that make compatible models: Pebblebee, Chipolo, and Motorola. For now Google doesn’t make its own Pixel or Nest-branded tracker, and Samsung’s SmartTags use its own SmartThings Find network, not Google’s. In the name of science, I also got hold of an Apple AirTag and a Tile tracker to serve as reference points for Google’s chief competitors.\n\nI found a network that’s clearly improved in the year since launch, one that in good conditions — a busy city, a tracker that’s not moving — is every bit as good as Apple’s and Tile’s. It’s when tracking gets trickier, in rural settings or with moving tags, that a gap between Google and the competition still opens up. The strange part is, that might well be by design.\n\nThe network\n\nIn its broad strokes, the Find My Device network works pretty similarly to Apple’s Find My network. You can use it to locate dedicated smart tracking tags, along with offline phones and tablets, or one of a small selection of third-party devices with built-in Bluetooth tracking, including certain Sony headphones and earbuds. Trackers and lost devices use Bluetooth to connect to passing Android devices, which in turn share their encrypted location with the network, so that you can, in theory, see its location on a map. Then it’s just a matter of heading there to find it.\n\nI say “in theory” because things aren’t quite so simple, and they certainly weren’t when Google’s network first launched. While Apple’s Find My network will tell you where your tech is so long as a single nearby iPhone makes Bluetooth contact, Google has been more cautious about how it uses location data. To avoid sharing the location data of individual nearby Android devices that have found a tracker — even anonymized, and encrypted — the Find My Device network defaults to aggregating location data. That means it requires multiple Android devices to make Bluetooth contact with a tracker, before sharing a single location calculated using the separate devices, so no individual user’s location data is shared unless they opt in to more permissive privacy settings. Making matters worse, Bluetooth pings are intermittent, not constant, which means a passing Android phone isn’t guaranteed to successfully make contact, adding to just how many people you’d need to pass by your lost belongings to get a successful location.\n\nUnlike AirTags, the Chipolo Pop and Pebblebee Clip are built to attach directly to your keys.\n\nEven a few months after the network came online, the result was that Google’s tracker network wasn’t very good at tracking. In a review of the Pebblebee Tag in June 2024, Android Police went a full day without getting a location ping on a “lost” tracker. Around the same time Android Central tested both Pebblebee and Chipolo trackers — they went three days without an alert.\n\nGoogle acknowledged the issues, promising that June that it was “actively working to roll out enhancements” to improve the speed and accuracy of tracking. Android product manager Angela Hsiao told me that Google’s internal testing shows that on average items are now found four times faster than at launch, and in follow-up testing this January Android Police agreed that the trackers “suddenly work great.” So, what changed?\n\nAny improvements come in two parts. First up, Hsiao says that Google has been making “continuous algorithm and technical under-the-hood improvements” since the network’s launch, doing things like tweaking Bluetooth scanning frequency and duration to improve the odds of two devices making the Bluetooth connection necessary to trigger a connection.\n\nUser behavior has changed, too. While the default settings rely on aggregated data to protect individual users’ privacy, those who are willing can switch from this “high-traffic areas” setting to an “all areas” option. The names are needlessly confusing, but what it really means is letting Google use your phone’s location data individually to track other devices — just like Apple’s network does — without waiting for other phones to come along. With every device on default settings at launch, no-one had this enabled. Hsiao wouldn’t specify how many users have opted in over the last year, only telling me that there are “more” than before, though with the option buried in the Find Device app’s settings it’s hard to imagine it’s any more than a small minority.\n\nSo is Google overselling its improvements, or is its Find My Device network really up there with Apple’s Find My by now?\n\nThe trackers\n\nBefore that, it’s worth a quick rundown of exactly what I’ve been testing. Pebblebee, Chipolo, and Motorola are the three big manufacturers of dedicated Find My Device trackers in North America and Europe, at least until Google decides to get involved for itself, so I tested them all.\n\nThe Pebblebee Clip includes a light to help you find it. Chipolo’s new Pop comes in a range of bright colors. Motorola designed its Tag to match the AirTag almost exactly, so existing accessories should fit it well.\n\nPebblebee offers three models: the Clip, Tag, and Card. I focused on the Clip, a circular tracker a little larger than an AirTag, but with a built-in hole for attaching to key rings. It has a Bluetooth range of up to 500 feet — though this assumes open line of sight and ideal conditions, so practical range will be much shorter — and, uniquely, it’s USB-C rechargeable (apparently lasting a year between charges), so it won’t generate undue e-waste. The Tag is a smaller model with a shorter range, while the Card is designed to slip into your wallet. All three support both Google and Apple’s tracker networks, though only one at a time. But it does mean that if you change phones you can keep using the same tracker.\n\nChipolo used to offer both a round tracker and a card, but in the course of my testing the company simplified its range: there’s now only the circular Chipolo Pop, which like Pebblebee trackers will work with either Android or iOS. It comes in a range of bright colors — ideal if you want to pick up a few for the family without mixing them up — but top Bluetooth range is a little shorter at 300 feet. You also can’t recharge these, though the standard CR2032 battery should be easy enough to replace when it dies after a year or so of use.\n\nThen there’s the Moto Tag. It’s strictly Android-only, but it’s also the most Apple-y tracker of them all — Motorola sneakily designed it in almost the exact same proportions as the AirTag, deftly piggybacking on that existing accessory market. Its Bluetooth range is similar to the Chipolo Pop’s, it uses the same replaceable battery, and its IP67 rating is the best water-protection across any of the Google-powered options. This is also the only one to include support for ultra wideband (UWB), enabling precision tracking from a compatible phone when you’re in short range… or at least it would, if Google had enabled UWB support on the network. Until it does — and for what it’s worth, Hsiao told me that Google will have more to share on that “very soon” — the Moto Tag’s UWB support is strictly theoretical, but a welcome bit of futureproofing.\n\nPebblebee also offers its smaller Tag. There’s a wallet tracker from Pebblebee too, though this Chipolo model was discontinued during my testing — which means you can find it for cheap right now. Find My Device trackers come in all shapes and sizes, though that’s mostly thanks to Pebblebee.\n\nWhat about the competition? The AirTag only comes in one size and shape, and Apple doesn’t quote an official range on its Bluetooth. Like the Moto Tag it’s IP67-rated, and uses CR2032 batteries, too. It also boasts UWB support, and it actually works. One handy feature that Apple offers and Google doesn’t is separation alerts, notifying you when you’re walking away from a device to prevent you losing it in the first place.\n\nFinally, I tested a Tile Mate, too. The OG tracker giant updated its range in 2024, but still leverages its own network of Tile devices, rather than using Google’s or Apple’s. There’s no UWB support, but there is a range of four styles: the regular Mate, more powerful Pro, card-shaped Slim, and the small Sticker, which can attach directly to whatever you want to track. The big downside to Tiles is that unless you buy the Pro, the batteries are non-replaceable — meaning when they die, they die, and you’ll have to buy a new one.\n\nThe results\n\nThe five trackers I set head to head (clockwise from top): Moto Tag, Chipolo Pop, Pebblebee Clip, Tile Mate, Apple AirTag\n\nI set out to test how this range of trackers handled three basic things:\n\nTracking lost items using the wider network, both in dense urban areas and those a little less busy.\n\nFinding items at close range, using Bluetooth, UWB, and alarms.\n\nTriggering “unknown tracker” alerts when placed in someone else’s bag, to prevent possible stalking.\n\nTo test the first, I dropped off my bundle of trackers in a small park across from a popular cafe in Islington, London — a spot with moderately heavy footfall, but some way short of what you’d find at a central tube station. I hid them behind a low brick wall, purposefully making conditions suboptimal for the Bluetooth. Then I headed back home, marked each tracker as lost, and waited.\n\nThe Tile Mate popped up first, 15 minutes after I’d marked it lost, and marked the location just a few feet from where I knew I’d left the tags. Another 15 minutes later, the AirTag and the Google trio all popped up at about the same time, but with one big difference: Apple’s location pin was just as accurate as Tile’s, but the three Google trackers all showed me a search radius of 20 feet or so, and the tracker was actually located just outside that circle. When I checked again a few hours later the pin was in the perfect spot, but it took the network a little longer than the others to get there.\n\nI tried the same thing outside of London, along a secluded trail in the suburbs. This is a spot with minimal foot traffic outside of a few dog walkers and joggers, making it more of a challenge for the tracker networks. This time Apple came in first, taking just 15 minutes to let me know my AirTag had been found — quicker than it had actually managed in the city, and the pin was just as precise. Tile took a little over an hour to find my Mate, though it thought it was about 50 feet down the road, meaning I’d probably never have really found it. Across the four hours I spent in the area, none of the trackers on Google’s network popped up at all.\n\nWhat about when you actually get to wherever your tracker supposedly is, but need to know exactly where it is? I expected Apple to have an easy upper hand here, its UWB support giving precise(ish) directions to your iPhone, so that you know which direction to walk and how close you are. Once you’re close enough, you can tell the AirTag to start ringing an alarm so you can find it by sound.\n\nWhile none of the Chipolo, Pebblebee, or Motorola tags support UWB properly just yet, they’re actually easier to find than the AirTag, thanks to one clever little technological trick: they’re really, really loud. UWB or not, all three of the Google-powered tags I tested packs a speaker far louder than Apple’s, audible from several rooms away, which is really all you need so long as the tracking network can get you close enough in the first place.\n\nBut there’s the rub. Across several weeks of testing tracking, the story was similar: in busy areas Google’s network was about as fast as Apple’s to track and find devices, but it was often less precise. This is especially true for moving targets: when my partner carried my assortment of trackers with her on a night out (consensually!), the Find My Device network succeeded at identifying her location when she was hanging out in a bar, but it offered hopelessly broad search areas — sometimes whole city neighborhoods — whenever she was on the move.\n\nPrevious Next\n\n\n\n\n\n1 / 4 Google finds moving targets hard to track precisely — this is a really big chunk of London.\n\nThat’s a direct result of Google’s choice to rely on aggregated data. Unless a tracker is picked up by multiple devices simultaneously, any tracking will rely on aggregating pings from across a period of time. If the tracker is moving, that means each device it connects to will report a different location, and as a user you get shown a pretty large area to search. Leave your backpack behind in a bar and Google’s network will help you find it; leave it in a cab and you might be in trouble.\n\nIn Google’s defense, that’s a feature, not a bug. Hsiao told me that the network “is intentionally designed with a balance that prioritizes safety over continuous, real-time tracking capabilities.” That’s safety for individual users’ location data, but also safety for potential stalking victims, as there’s no useful live feed of a tracker’s location.\n\nThe other side of stalking protection is unknown tracker alerts, and the bad news here is that no one seems to be getting this right. Tile doesn’t offer the feature at all, and in fact advertises on that basis — not in the name of easier stalking, but so that would-be thieves don’t get alerts that you might be tracking them as they run off with your gear.\n\nInteroperability seems to be the problem elsewhere: friends’ iPhones would reliably detect my rogue AirTag if I sent it out with my partner, and Android phones would usually warn about the Find My Device tags, but it was rare for either type of phone to detect a tracker from the other network. That ain’t great, but it seems to be Apple’s problem as much as Google’s — the two companies worked together to create an industry standard for detecting unwanted trackers, but it doesn’t seem to actually work all that well.\n\nTry not to leave this behind in a cab.\n\nEven after 12 months of work, it’s pretty inarguable that Google’s Find My Device network still isn’t as good as Apple’s Find My at actually finding stuff. The difference now is that the disparity is philosophical, not technological: Google doesn’t seem to want to offer precise real-time tracking, and so it’s built its network to be more private, but less effective.\n\nFor those who want to actually track their lost tech, that’s a big potential downside — Apple’s AirTag will often do a better job, and even Tile’s network is occasionally more accurate. Google’s big bet is that “good enough” will be good enough, that finding lost belongings most of the time, pretty accurately, and fairly fast is all people really need, and that they’re willing to give up on those edge cases in return for a network that’s safer and more private than the competition.\n\nQuite simply, it’s not very Google. This is not a company known for sacrificing functionality in the name of privacy, and certainly not one you’d expect to claw at less data than Apple does at the same game. And so whatever the Find My Device network’s faults, there’s something to celebrate in its compromises.\n\nPhotography by Dominic Preston / The Verge"
    },
    {
        "title": "Google’s iOS app will use AI to simplify jargon",
        "description": "Google has a new AI tool that can help iPhone users to better grasp complicated or confusing writing online. The Simplify feature, rolling out in the Google app on iOS starting today, generates a simpler, more digestible version of any highlighted text withou…",
        "url": "https://www.theverge.com/news/661695/google-simplify-ai-gemini-feature-ios-app",
        "source": "The Verge",
        "publishedAt": "2025-05-06T11:43:18Z",
        "full_text": "Google has a new AI tool that can help iPhone users to better grasp complicated or confusing writing online. The Simplify feature, rolling out in the Google app on iOS starting today, generates a simpler, more digestible version of any highlighted text without leaving the current web page.\n\nSimplify is built on Google’s Gemini AI model, and was developed by Google Research to make technical jargon easier for anyone to understand without losing key details. For example, Simplify can break down medical terms like “emphysema” (a condition that damages the air sacs in lungs) and “fibrosis” (dense connective tissue or scarring that develops in response to damage) in reports and journals, preventing readers from needing to reference terminology on a separate web page.\n\nThe simplified version of selected text will appear in a pop-up window that can be dismissed when it’s no longer required. GIF: Google\n\nGoogle says that people found the simplified versions to be “significantly more helpful than the original complex text” in its testing, but acknowledged the study “has limitations” and that “ongoing vigilance” is required to monitor errors.\n\nThe feature can be found in the iOS Google app by highlighting any text on a website, and tapping the Simplify icon from the menu options that appear. When asked if Simplify will be made available for Android and desktop Chrome users, Google spokesperson Jennifer Kutz told The Verge that “we don’t have anything to announce yet, but we’re always looking to bring useful features to more of our products.”"
    },
    {
        "title": "Mexico sues Google over 'Gulf of America' name change",
        "description": "President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.",
        "url": "https://www.bbc.com/news/articles/c5yk5nj7p7ko",
        "source": "BBC News",
        "publishedAt": "2025-05-09T18:10:02Z",
        "full_text": "Mexico sues Google over 'Gulf of America' name change\n\n3 days ago Share Save Danai Nesta Kupemba BBC News Share Save\n\nGetty Images Mexican President Claudia Sheinbaum has asked the tech company multiple times to change the name\n\nMexico is suing Google for ignoring repeated requests not to rename the Gulf of Mexico the Gulf of America for US users on its maps service, Claudia Sheinbaum has said. The Mexican president did not say where the lawsuit had been filed. Google did not respond to the BBC's request for comment. On Thursday, the Republican-led House of Representatives voted to officially rename the Gulf for federal agencies. US President Donald Trump signed an executive order on his first day in office in January calling for the body of water to be renamed, arguing the change was justified because the US \"do most of the work there, and it's ours\".\n\nHowever, Sheinbaum's government contends that Trump's order applies only to the US portion of the continental shelf. \"All we want is for the decree issued by the US government to be complied with,\" she said, asserting that the US lacks the authority to rename the entire gulf. Sheinbaum wrote a letter to Google in January asking the firm to reconsider its decision to rename the Gulf of Mexico for US users. The following month, she threatened legal action. At the time, Google said it made the change as part of \"a longstanding practice\" of following name changes when updated by official government sources. It said the gulf - which is bordered by the US, Cuba and Mexico - would not be changed for people using the app in Mexico, and users elsewhere in the world will see the label: \"Gulf of Mexico (Gulf of America)\".\n\nThe Gulf of Mexico has been renamed the Gulf of America on Google Maps in the US"
    },
    {
        "title": "How Apple lost control of the App Store",
        "description": "\"Cook chose poorly\" is one of those phrases you'll someday read in a history book about the tech industry. That's just one of the memorable lines from Judge Yvonne Gonzalez Rogers' stinging rebuke of Apple this week, in which she ruled that Apple needed to ch…",
        "url": "https://www.theverge.com/the-vergecast/660098/apple-app-store-payment-rules-epic-meta-google-vergecast",
        "source": "The Verge",
        "publishedAt": "2025-05-02T12:42:08Z",
        "full_text": "is editor-at-large and Vergecast co-host with over a decade of experience covering consumer tech. Previously, at Protocol, The Wall Street Journal, and Wired.\n\n“Cook chose poorly” is one of those phrases you’ll someday read in a history book about the tech industry. That’s just one of the memorable lines from Judge Yvonne Gonzalez Rogers’ stinging rebuke of Apple this week, in which she ruled that Apple needed to change the way it handled external payments, buttons, and links in apps. And it needed to do so now. Apple says it will appeal, but it has already changed the rules. The app economy might never be the same.\n\nOn this episode of The Vergecast, we talk about what just happened and why it matters. After some very important party speaker updates, Nilay, David, and The Verge’s Jake Kastrenakes walk through Apple’s years of closed-door meetings about app commissions, and the ways in which Gonzalez Rogers found she’d been misled throughout the process. (Nilay also takes a victory lap on the whole “buttons and links” thing.) We talk about how developers are responding to the news, as well as what new things you might be able to buy in the App Store, which new apps might suddenly be possible, and whether Apple has any moves left in this case.\n\nAfter that, it’s time for… more monopoly talk! Meta and Google are both still in court fighting to keep their companies intact. We’re learning a lot about how important TikTok has become, how Meta sees the world in general, and why it feared what might happen if Google bought WhatsApp. Meanwhile, just down the hall in the DC District courthouse, Google CEO Sundar Pichai made an impassioned case that this trial could be the end of Google Search.\n\nIf you want to know more about everything we discuss in this episode, here are some links to get you started, beginning with Apple:\n\nAnd in the Google and Meta trials:\n\nAnd in the lightning round:\n\nUpdate! I forgot the party speaker pictures. Here are some party speaker pictures. Thanks to everyone who sent them, keep ‘em coming."
    },
    {
        "title": "Google’s AI podcast maker is now available in over 50 languages",
        "description": "Audio Overviews, the AI tool that turns your research into podcast-like conversations in Google’s NotebookLM app, is expanding beyond English. Now you can generate and listen to Audio Overviews in more than 50 languages, including Spanish, Portuguese, French,…",
        "url": "https://www.theverge.com/news/657785/google-audio-overviews-ai-podcasts-50-languages",
        "source": "The Verge",
        "publishedAt": "2025-04-29T16:01:55Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nAudio Overviews, the AI tool that turns your research into podcast-like conversations in Google’s NotebookLM app, is expanding beyond English. Now you can generate and listen to Audio Overviews in more than 50 languages, including Spanish, Portuguese, French, Hindi, Turkish, Korean, and Chinese.\n\nYou switch to a different language by heading to NotebookLM, selecting your settings in the top-right corner of the screen, and choosing Output Language. From there, you can select from a list of languages, allowing you to receive responses and hear Audio Overviews in the language of your choice.\n\nYou can now receive responses and hear Audio Overviews in your preferred language. GIF: Google\n\nGoogle says this is only “an early look at what’s possible with this feature,” adding that it plans to continue “building and refining it” based on feedback. Since launching Audio Overviews last year, Google has expanded it to more than 200 countries and added a range of new features, giving you the ability to “guide” the AI hosts of the conversation and even interact with them.\n\nGoogle has also brought Audio Overviews to its Gemini AI chatbot and Google Docs, allowing you to convert even more kinds of written material into AI podcasts."
    },
    {
        "title": "OpenAI Adds Shopping to ChatGPT",
        "description": "OpenAI is launching a shopping experience inside of ChatGPT, complete with product picks and buy buttons. WIRED spoke with Adam Fry, the company's search product lead, to ask how it all works.",
        "url": "https://www.wired.com/story/openai-adds-shopping-to-chatgpt/",
        "source": "Wired",
        "publishedAt": "2025-04-28T19:01:10Z",
        "full_text": "OpenAI announced today that users will soon be able to buy products through ChatGPT. The rollout of shopping buttons for AI-powered search queries will come to everyone, whether they are a signed-in user or not. Shoppers will not be able to check out inside of ChatGPT; instead they will be redirected to the merchant’s website to finish the transaction.\n\nIn a prelaunch demo for WIRED, Adam Fry, the ChatGPT search product lead at OpenAI, demonstrated how the updated user experience could be used to help people using the tool for product research decide which espresso machine or office chair to buy. The product recommendations shown to prospective shoppers are based on what ChatGPT remembers about a user’s preferences as well as product reviews pulled from across the web.\n\nFry says ChatGPT users are already running over a billion web searches per week, and that people are using the tool to research a wide breadth of shopping categories, like beauty, home goods, and electronics. The product results in ChatGPT for best office chairs, one of WIRED’s rigorously tested and widely read buying guides, included a link to our reporting in the sources tab. (Although the business side of Condé Nast, WIRED’s parent company, signed a licensing deal last year with OpenAI so the company can surface our content, the editorial team retains independence in how we cover the startup.)\n\nSearching for espresso machines inside ChatGPT. Image Courtesy of OpenAI\n\nThe new user experience of buying stuff inside of ChatGPT shares many similarities to Google Shopping. In the interfaces of both, when you click on the image of a budget office chair that tickles your fancy, multiple retailers, like Amazon and Walmart, are listed on the right side of the screen, with buttons for completing the purchase. There is one major difference between shopping through ChatGPT versus Google, for now: The results you see in OpenAI searches are not paid placements, but organic results. “They are not ads,” says Fry. “They are not sponsored.”\n\nWhile some product recommendations that appear inside of Google Shopping show up because retailers paid for them to be there, that’s just one mechanism Google uses to decide which products to list in Shopping searches. Websites that publish product reviews are constantly tweaking the content of their buying recommendations in an effort to convince the opaque Google algorithm that the website includes high-quality reviews of products that have been thoroughly tested by real humans. Google favors those more considered reviews in search results and will rank them highly when a user is researching a product. To land one of the top spots in a Google search can lead to more of those users buying the product through the website, potentially earning the publisher millions of dollars in affiliate revenue.\n\nSo how does ChatGPT choose which products to recommend? Why were those specific espresso machines and office chairs listed first when the user typed the prompt?\n\n“It’s not looking for specific signals that are in some algorithm,” says Fry. According to him, this will be a shopping experience that’s more personalized and conversational, rather than keyword-focused. “It's trying to understand how people are reviewing this, how people are talking about this, what the pros and cons are,” says Fry. If you say that you prefer only buying black clothes from a specific retailer, then ChatGPT will supposedly store that information in its memory the next time you ask for advice about what shirt to buy, giving you recommendations that align with your tastes."
    },
    {
        "title": "Pete Hegseth’s Signal Scandal Spirals Out of Control",
        "description": "Plus: Cybercriminals stole a record-breaking fortune from US residents and businesses in 2024, and Google performs its final flip-flop in its yearslong quest to kill tracking cookies.",
        "url": "https://www.wired.com/story/pete-hegseths-signal-scandal-spirals-out-of-control/",
        "source": "Wired",
        "publishedAt": "2025-04-26T10:30:00Z",
        "full_text": "As the Trump administration’s aggressive immigration policy ramps up, people have started to seriously consider their privacy and security when crossing into the United States. That’s especially true when it comes to searches of travelers’ phones and other devices, which US Customs and Border Protection agents have broad authority to search. Fortunately, there are some steps you can take, such as deleting certain apps from your personal phone or using an alternative phone that’s set up just for traveling internationally.\n\nOperatives with Elon Musk’s so-called Department of Government Efficiency (DOGE) have spent the first months of the Trump administration clawing their way into US government systems. It’s now starting to become clear exactly what those systems are and what kind of data on US residents they hold. WIRED this week detailed the 19 systems DOGE operatives have access to just at the Department of Health and Human Services.\n\nPope Francis died on Monday at age 88. The passing of the supreme pontiff sets in motion a conclave, the secretive process used to select the new pope. To protect the conclave’s integrity and try to prevent leaks, a wide range of security measures will be put in place, from privacy film on windows at the Vatican to signal jammers and sweeps for hidden microphones.\n\nGoogle recently announced the initial rollout of end-to-end encrypted email for Google Workspace accounts, which is good news for the privacy of enterprise-level users. When a Workspace user emails a non-Workspace account, the recipient gets an invitation to create a guest account so they can read the email. Unfortunately, security experts say, this will likely create new opportunities for phishing attacks, as scammers try to bait people with fake invitations.\n\nBut that’s not all. Each week, we round up the security and privacy news we didn’t cover in depth ourselves. Click the headlines to read the full stories. And stay safe out there.\n\nSignalGate is the scandal that just won’t die—at least not if you’re US secretary of defense Pete Hegseth. On Wednesday, The Washington Post reported that Hegseth had installed Signal on a “second computer in his office” so that he could “use Signal in a classified space, where his cellphone and other personal electronics are not permitted, and communicate with ease with anyone.”\n\nThe Associated Press on Thursday added to the picture of Hegseth’s reported Signal use, revealing that Hegseth got a second internet line installed that connected directly to the public internet rather than through the Pentagon’s secured connection, according to sources who spoke with the AP. Hegseth allegedly did this so he could use that second computer with Signal installed. Then on Friday, The New York Times found that the phone number associated with Hegseth’s Signal account—the one he used in that infamous group chat—is easily discoverable online, potentially opening him up to targeted cyberattacks by hostile nations.\n\nDespite a steady flow of arrests and takedowns of online scammers, cybercriminals are operating at unprecedented levels and making more money than ever. Two reports released this week reveal the stark scale of online criminality. Last year in the United States, businesses and individuals lost $16.6 billion to online crimes, according to the FBI’s Internet Crime Complaint Center—that’s the highest figure ever reported and a leap of 33 percent compared to 2023. In 2024, there were 859,532 complaints about potential online crimes, with the FBI saying phishing and spoofing complaints account for 193,000 of them, followed by extortion with 86,000 complaints. Investment scams, which often involve cryptocurrency, made up more than $6 billion of the total losses, with business email compromise scams leading to losses of $2.7 billion.\n\nAround the same time, the United Nations Office on Drugs and Crime highlighted that giant scam compounds in Southeast Asia—where human trafficking victims are forced to work scamming people—are generating $40 billion in profits per year and keep on growing. These industrial-scale scam organizations, which are often linked to Chinese criminals, heavily use investment scams (sometimes called pig-butchering) to con people out of their life savings and are expanding outside of the region. “It spreads like a cancer,” Benedikt Hofmann of the UNODC said in a statement.\n\nBack in 2020, Google announced its Chrome browser would stop using third-party cookies, which track people around the web, and would move to a less creepy way of powering its advertising businesses. Web browsers such as Safari, Firefox, and Brave ditched cookies years before Google made the announcement. But this week, after countless U-turns, failed efforts to develop alternatives, and criticism that proposals to replace cookies would favor Google, the company announced it will, in fact, keep the trackers in Chrome.\n\n“We’ve made the decision to maintain our current approach to offering users third-party cookie choice in Chrome,” wrote Anthony Chavez, the Google VP in charge of its Privacy Sandbox efforts, in a blog post. “As we’ve engaged with the ecosystem, including publishers, developers, regulators, and the ads industry, it remains clear that there are divergent perspectives on making changes that could impact the availability of third-party cookies,” Chavez wrote. While the US government is proposing that Google sell off Chrome as part of its antitrust case against the company, it’s still possible to turn off third-party cookies or use a privacy-friendly browser instead."
    },
    {
        "title": "Gmail gets a slider on Android tablets, AI on the side",
        "description": "Google is rolling out Gmail updates for mobile users across Android and iOS, with some design updates and new access to AI features. Android tablet and foldable owners will have a more flexible Gmail app interface that lets them drag the divider to adjust the…",
        "url": "https://www.theverge.com/news/656708/gmail-app-gemini-image-generator-workspace-ios-material-3",
        "source": "The Verge",
        "publishedAt": "2025-04-25T21:58:50Z",
        "full_text": "is a news writer fond of the electric vehicle lifestyle and things that plug in via USB-C. He spent over 15 years in IT support before joining The Verge.\n\nGoogle is rolling out Gmail updates for mobile users across Android and iOS, with some design updates and new access to AI features.\n\nAndroid tablet and foldable owners will have a more flexible Gmail app interface that lets them drag the divider to adjust the list and conversation panes to whatever size they want in landscape view. You can also drag the divider all the way to one side to switch to a single pane view if preferred. The update is rolling out now for Workspace and personal accounts.\n\nAdjustable panes in the Gmail app for Android tablets and foldables. GIF: Google\n\nGoogle is also pushing a Material Design 3 update to Gmail on iOS that puts it in parity with the Android and redesigned web versions, including the pill-shaped buttons on the bottom and a rounded search bar on top. The update is rolling out now to both Workspace and personal accounts. Additionally, Google Calendar on iOS will now let you create and modify birthday events like you already can on Android.\n\nFinally, Gemini’s image generator is coming to the Gmail app sidebar on both Android and iOS for Workspace users. Like in Google’s Workspace apps on the web, you can generate images within the Gmail app and then save them, copy them, or insert them directly into your email draft."
    },
    {
        "title": "Google Indoor Nest Security Cam Hits All-Time Low, You’ll Think It’s Black Friday in April",
        "description": "Know more and worry less with a Google Nest Cam for 30% off",
        "url": "https://gizmodo.com/google-indoor-nest-security-cam-hits-all-time-low-youll-think-its-black-friday-in-april-2000589332",
        "source": "Gizmodo.com",
        "publishedAt": "2025-04-15T14:35:49Z",
        "full_text": ""
    },
    {
        "title": "Google Pixel Buds A-Series Match Black Friday Price Again on Amazon, and They’re Nearly Free",
        "description": "Listen to your favorite music and podcasts with these great Android-centric earbuds that last and last.",
        "url": "https://gizmodo.com/google-pixel-buds-a-series-match-black-friday-price-again-on-amazon-and-theyre-nearly-free-2000597281",
        "source": "Gizmodo.com",
        "publishedAt": "2025-05-02T12:50:16Z",
        "full_text": ""
    },
    {
        "title": "Google Is Clearing Out Their Smart Watches? The Latest Pixel Watch 3 Hits All-Time Low",
        "description": "Save between $50 and $70 on the Google Pixel Watch 3 in a variety of colors and sizes over at Amazon.",
        "url": "https://gizmodo.com/google-is-clearing-out-their-smart-watches-the-latest-pixel-watch-3-hits-all-time-low-2000596025",
        "source": "Gizmodo.com",
        "publishedAt": "2025-04-30T13:25:21Z",
        "full_text": ""
    },
    {
        "title": "Google Is Getting Into the Movie Business to Produce Pro-Tech Propaganda",
        "description": "Big tech has an image problem. It's going to the people who make the images for help.",
        "url": "https://gizmodo.com/google-is-getting-into-the-movie-business-to-produce-pro-tech-propaganda-2000598304",
        "source": "Gizmodo.com",
        "publishedAt": "2025-05-05T20:05:25Z",
        "full_text": ""
    },
    {
        "title": "Is Amazon Clearing Out Google Phones? Pixel 9 Pro Drops to a Record Low",
        "description": "The Pixel 9 Pro stands as the biggest competitor to both the iPhone 16 Pro and the Galaxy S25 Ultra.",
        "url": "https://gizmodo.com/is-amazon-clearing-out-google-phones-pixel-9-pro-drops-to-record-low-2000588910",
        "source": "Gizmodo.com",
        "publishedAt": "2025-04-19T09:34:02Z",
        "full_text": ""
    },
    {
        "title": "Google CEO Says Antitrust Remedies Would Cripple Google Search",
        "description": "Google and the United States Justice Department are back in court to fight over the remedies that will be implemented to address Google's search monopoly, and Google CEO Sundar Pichai today took the stand to defend Google.\n\n\n\n\n\nThe DoJ wants Google to divest …",
        "url": "https://www.macrumors.com/2025/04/30/google-search-crippled-antitrust-remedies/",
        "source": "MacRumors",
        "publishedAt": "2025-04-30T17:54:15Z",
        "full_text": "Google and the United States Justice Department are back in court to fight over the remedies that will be implemented to address Google's search monopoly, and Google CEO Sundar Pichai today took the stand to defend Google.\n\n\n\nThe DoJ wants Google to divest its Chrome browser, refrain from making search engine agreements like the one Google has with Apple, and share \"critical portions\" of its search data with competitors at a \"marginal cost,\" including how it ranks search results and query understanding information. According to Pichai, these remedies would essentially mean the end of Google search.\n\nAs outlined by The New York Times, Pichai said that if Google had to share data, the company wouldn't likely continue to invest in search. \"The combination of all the remedies, I think, makes it unviable to invest in R&D the way we have for the past three decades, to continue to innovate and build Google search,\" he said. He suggested that Google would not be able to fund \"all the innovation\" that the company puts into search.\n\nPichai said that the data sharing requirement would be a \"de facto divestiture\" of Google's intellectual property. With that information, Pichai claimed that any company could \"completely reverse engineer, end to end, every aspect of [Google's] technology stack.\" He said that the DoJ's proposal that Google share its data is \"extraordinary\" and \"far reaching.\"\n\nGoogle wants to be able to continue to make search engine deals like the one it has with Apple, according to Pichai, though he suggested those deals could be renegotiated on an annual basis and that those deals would not be exclusive. Google's upcoming deal to add Gemini to the iPhone along with OpenAI was cited as an example of Google's new deal making policy.\n\nJudge Amit Mehta, who is overseeing the case, will consider testimony from both Google and the DoJ before he provides remedies. A decision is expected by August, and Google will undoubtedly appeal, so the case is likely to take many more years to play out."
    }
]