[
    {
        "title": "The Meta AI App Lets You 'Discover' People's Bizarrely Personal Chats",
        "description": "Launched in April, the Meta AI platform offers a “discover” feed that includes user queries containing medical, legal, and other seemingly sensitive information.",
        "url": "https://www.wired.com/story/meta-artificial-intelligence-chatbot-conversations/",
        "source": "Wired",
        "publishedAt": "2025-06-12T21:46:37Z",
        "full_text": "“What counties [sic] do younger women like older white men,” a public message from a user on Meta’s AI platform says. “I need details, I’m 66 and single. I’m from Iowa and open to moving to a new country if I can find a younger woman.” The chatbot responded enthusiastically: “You’re looking for a fresh start and love in a new place. That’s exciting!” before suggesting “Mediterranean countries like Spain or Italy, or even countries in Eastern Europe.”\n\nThis is just one of many seemingly personal conversations that can be publicly viewed on Meta AI, a chatbot platform that doubles as a social feed and launched in April. Within the Meta AI app, a “discover” tab shows a timeline of other people’s interactions with the chatbot; a short scroll down on the Meta AI website is an extensive collage. While some of the highlighted queries and answers are innocuous—trip itineraries, recipe advice—others reveal locations, telephone numbers, and other sensitive information, all tied to user names and profile photos.\n\nCalli Schroeder, senior counsel for the Electronic Privacy Information Center, said in an interview with WIRED that she has seen people “sharing medical information, mental health information, home addresses, even things directly related to pending court cases.”\n\n“All of that's incredibly concerning, both because I think it points to how people are misunderstanding what these chatbots do or what they're for and also misunderstanding how privacy works with these structures,” Schroeder says.\n\nIt’s unclear whether the users of the app are aware that their conversations with Meta’s AI are public or which users are trolling the platform after news outlets began reporting on it. The conversations are not public by default; users have to choose to share them.\n\nThere is no shortage of conversations between users and Meta’s AI chatbot that seem intended to be private. One user asked the AI chatbot to provide a format for terminating a renter’s tenancy, while another asked it to provide an academic warning notice that provides personal details including the school’s name. Another person asked about their sister’s liability in potential corporate tax fraud in a specific city using an account that ties to an Instagram profile that displays a first and last name. Someone else asked it to develop a character statement to a court which also provides a myriad of personally identifiable information both about the alleged criminal and the user himself.\n\nThere are also many instances of medical questions, including people divulging their struggles with bowel movements, asking for help with their hives, and inquiring about a rash on their inner thighs. One user told Meta AI about their neck surgery and included their age and occupation in the prompt. Many, but not all, accounts appear to be tied to a public Instagram profile of the individual.\n\nMeta spokesperson Daniel Roberts wrote in an emailed statement to WIRED that users’ chats with Meta AI are private unless users go through a multistep process to share them on the Discover feed. The company did not respond to questions regarding what mitigations are in place for sharing personally identifiable information on the Meta AI platform."
    },
    {
        "title": "Scientists Launch Wild New Project to Build a Human Genome From Scratch",
        "description": "The medical charity behind the controversial new plan says the benefits outweigh the risks.",
        "url": "https://gizmodo.com/scientists-launch-wild-new-project-to-build-a-human-genome-from-scratch-2000620762",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-29T14:00:04Z",
        "full_text": ""
    },
    {
        "title": "YouTube has loosened its content moderation policies",
        "description": "YouTube has relaxed its moderation policies and is now instructing reviewers not to remove content that might violate its rules if they’re in the “public interest,” according to a report from The New York Times. The platform reportedly adjusted its policies i…",
        "url": "https://www.theverge.com/news/682784/youtube-loosens-moderation-policies-videos-public-interest",
        "source": "The Verge",
        "publishedAt": "2025-06-09T14:51:28Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nYouTube has relaxed its moderation policies and is now instructing reviewers not to remove content that might violate its rules if they’re in the “public interest,” according to a report from The New York Times. The platform reportedly adjusted its policies internally in December, offering examples that included medical misinformation and hate speech.\n\nIn training material viewed by the Times, YouTube says reviewers should now leave up videos in the public interest — which includes discussions of elections, ideologies, movements, race, gender, sexuality, abortion, immigration, censorship — if no more than half of their content breaks its rules, up from one quarter. The platform said in the material that the move expands on a change made before the 2024 US election, which allows content from political candidates to stay up even if they violate its community guidelines under its exception for educational, documentary, scientific, and artistic content (EDSA).\n\nAdditionally, the platform told moderators that they should remove content if “freedom of expression value may outweigh harm risk,” and take borderline videos to a manager instead of removing them, the Times reports.\n\n“We regularly update our Community Guidelines to adapt to the content we see on YouTube,“ YouTube spokesperson Nicole Bell said in an emailed statement to The Verge. Bell added that EDSA exceptions only “apply to a small fraction” of videos on the platform.\n\n“This practice allows us to prevent, for example, an hours-long news podcast from being removed for showing one short clip of violence,” Bell said. “We regularly update our guidance for these exceptions to reflect the new types of discussion and content (for example emergence of long, podcast content) that we see on the platform, and the feedback of our global creator community.”\n\nThe changes follow years of attacks on tech companies from Trump, and Google in particular is in a vulnerable legal situation, facing two Department of Justice antitrust lawsuits that could see its Chrome browser and other services broken off. Trump has previously taken credit for Meta’s moderation changes.\n\nAs noted by the Times, YouTube showed reviewers real examples of how it has implemented the new policy. One video contained coverage of Health and Human Services Secretary Robert F. Kennedy Jr.’s covid vaccine policy changes — under the title “RFK Jr. Delivers SLEDGEHAMMER Blows to Gene-Altering JABS” — and was allowed to violate policies surrounding medical misinformation because public interest “outweighs the harm risk,” according to the Times. (The video has since been taken off the platform, but the Times says the reasoning behind this is “unclear.”) Another example was a 43-minute video about Trump’s cabinet appointees that violated YouTube’s harassment rules with a slur targeting a transgender person, but was left up because it had only a single violation, the Times reports.\n\nYouTube also reportedly told reviewers to leave up a video from South Korea that mentioned putting former president Yoon Suk Yeol in a guillotine, saying that the “wish for execution by guillotine is not feasible.”\n\nUpdate, June 9th: Added a statement from YouTube."
    },
    {
        "title": "Cyclist gets 3D printed face after bike accident",
        "description": "The Bristol 3D Medical Centre covers the whole of the South West and can scan and print in the same place.",
        "url": "https://www.bbc.com/news/articles/cx2epz2gep1o",
        "source": "BBC News",
        "publishedAt": "2025-06-17T05:05:20Z",
        "full_text": "Cyclist gets 3D printed face after bike crash\n\n17 June 2025 Share Save Matthew Hill BBC West Health Correspondent Share Save\n\nBBC The centre in Bristol brings 3D imaging and printing into one facility\n\nA cyclist left with devastating facial injuries after being knocked off his bike by a drunk driver is one of the first patients to benefit from a unique NHS body parts printing centre. The Bristol 3D Medical Centre covers the whole of the South West and is believed to be the first in the UK to have 3D imaging and printing all in a single space. It provides scientific and technical support to trauma patients through state-of-the-art digital technology and specialist reconstructive expertise. Dave Richards, from Devon, said following his crash, the centre helped to make him \"feel a lot more comfortable in myself\".\n\nDave Richards was knocked off his bike by a drunk driver\n\nIn July 2021, Mr Richards was cycling in Meare, Somerset, with two of his friends when they were hit by a drunk driver. The 75-year-old from Devon said: \"He [the driver] came up behind us and was on his phone. \"My two friends were knocked clear but suffered multiple fractures. \"I, unfortunately, got trapped underneath the vehicle so I got severe burns down one side of my body and face and suffered crush injuries, ribs on my right hand side.\" After multiple operations for reconstruction at Southmead Hospital in Bristol and rehabilitation with numerous medical specialties, Dave has begun to get his life back together. He continues to visit the the Bristol 3D Medical Centre where he has just been given facial prosthetics. A large orbital prosthesis and neck scar splints have been made with the aid of the centre's technology. Mr Richards can also have a 3D scan to capture his face digitally to develop replicas of him and then design the moulds for these prosthesis. Dave told the BBC: \"Most times people don't notice. I have had to live with this for four years. Most of this is in my head. A lot of the time people don't notice or don't say anything or accept the way I am. He added: \"If I want to socialise a lot I feel a lot more comfortable in myself if I look in a mirror and look reasonable.\"\n\nThe medical centre can both scan and print prosthesis for patients\n\nThe Bristol 3D Medical Centre Opened in April on the old Frenchay Hospital site on the outskirts of the city. The centre consolidates a new science and technology service into one space and was one of the first NHS Hospitals to receive a PEEK printer which makes bespoke items at temperatures as high as 200 degrees celsius. A scanner tool can digitally map an individual's body whilst sat in a specifically designed planning room which is sophisticated enough to scan moving babies. The centre is also finding many new applications, such as a 3D model of a damaged kidney showing surgeons not only the area to be removed but nerves and blood vessels to avoid. It is believed to be the first in the UK to have this all in a single space. The majority of the equipment was funded by the Southmead Hospital Charity, the official charity of North Bristol NHS Trust."
    },
    {
        "title": "US Supreme Court Upholds Tennessee’s Ban on Gender-Affirming Care for Minors",
        "description": "In United States v. Skrmetti, the Supreme Court ruled that Tennessee’s ban on gender-affirming care for minors was not unconstitutional—the first case of its kind on which the court has ruled.",
        "url": "https://www.wired.com/story/supreme-court-ruling-gender-affirming-care-trans-rights-skrmetti-case/",
        "source": "Wired",
        "publishedAt": "2025-06-18T15:37:23Z",
        "full_text": "The US Supreme Court’s conservative majority on Wednesday upheld the state of Tennessee’s ban on gender-affirming care for minors.\n\nIn a 6–3 decision in United States v. Skrmetti, the justices found that Tennessee’s law is not unconstitutional. The central issue of the case was whether Tennessee’s ban violates the equal protection clause of the 14th Amendment, which states that the government cannot discriminate against individuals based on their race, gender, or other characteristics. The ruling does not affect states where gender-affirming care for youth remains legal, but establishes the precedent that states can ban this kind of treatment.\n\nThe lawsuit was brought to the court by three transgender teenagers and their parents, as well as a doctor, with the Biden administration’s Department of Justice joining the plaintiffs. They argued that the Tennessee law discriminates based on sex and gender status by denying medical care to transgender youth that is available to other minors. This is the first case the Supreme Court has taken up on the issue of gender-affirming care for minors.\n\nGender-affirming care includes a variety of medical services meant to help align a person’s body more closely with their gender identity. It can include hormone therapy, puberty blockers, and surgeries.\n\nTennessee enacted its law in 2023, which prohibits health care providers from prescribing medication or offering gender-affirming surgical procedures to minors whose gender identities are different from their assigned sex at birth. The law excludes procedures that address congenital defects or physical injuries, as well as gender-affirming medical care for minors whose gender identity conforms with their designated sex at birth. It means, for instance, that a cisgender boy with gynecomastia, a hormonal condition that causes enlarged male breast tissue, could receive medication or undergo surgery to remove breast tissue to conform to their gender identity, but a transgender individual could not receive the same treatment for gender dysmorphia.\n\nToday’s Supreme Court ruling, delivered by Chief Justice John Roberts, maintains that Tennessee’s law is not discriminatory because it “prohibits healthcare providers from administering puberty blockers or hormones to any minor to treat gender dysphoria, gender identity disorder, or gender incongruence, regardless of the minor’s sex.” According to the justices, the Tennessee law does not exclude any individual from medical treatments based on their transgender status. “Rather, it removes one set of diagnoses—gender dysphoria, gender identity disorder, and gender incongruence—from the range of treatable conditions,” the ruling says.\n\nSince 2021, more than two dozen states have adopted laws or policies that prohibit or severely limit gender-affirming care for people under the age of 18. Many of those states also penalize health care practitioners for providing or offering this type of care to minors. According to the health policy nonprofit KFF, 40 percent of trans youth between the ages of 13 and 17 live in a state that has enacted a policy against gender-affirming care.\n\nThough several states were facing legal challenges to their bans, today’s Supreme Court decision means those laws will likely remain intact.\n\nLeading medical organizations—including the American Medical Association, the American Academy of Pediatrics, the American Psychiatric Association, American College of Obstetricians and Gynecologists, and the World Health Organization—support access to gender-affirming care for transgender and gender-diverse youth, which they say is backed by scientific evidence. One study from 2022 surveyed nearly 12,000 transgender and nonbinary youth aged 13 to 24 and found that those who received gender-affirming hormone therapy had lower rates of depression, thoughts of suicide, and attempted suicide than those who had not received hormone therapy.\n\n“Today’s Supreme Court decision is a devastating blow to transgender youth and the families who love them,” said Kelley Robinson, president of the Human Rights Campaign, an organization that promotes LGBTQ+ civil rights, in a statement. “Families may now have to make the heartbreaking choice to leave their state or split their families, or take on extensive financial burdens, in order to ensure that their kids can access medically necessary care.”"
    },
    {
        "title": "Ask Jerry: Are wearables ready to be medical devices yet?",
        "description": "Have a question about the tech in your life? If so, maybe we can get them answered!",
        "url": "https://www.androidcentral.com/wearables/ask-jerry-are-wearables-ready-to-be-medical-devices-yet",
        "source": "Android Central",
        "publishedAt": "2025-06-09T20:48:14Z",
        "full_text": "Welcome to Ask Jerry, where we talk about any and all the questions you might have about the smart things in your life. I'm Jerry, and I have spent the better part of my life working with tech. I have a background in engineering and R&D and have been covering Android and Google for the past 15 years.\n\nAsk Jerry (Image credit: Future) Ask Jerry is a column where we answer your burning Android/tech questions with the help of long-time Android Central editor Jerry Hildenbrand.\n\nI'm also really good at researching data about everything — that's a big part of our job here at Android Central — and I love to help people (another big part of our job!). If you have questions about your tech, I'd love to talk about them.\n\nEmail me at askjerryac@gmail.com, and I'll try to get things sorted out. You can remain anonymous if you like, and we promise we're not sharing anything we don't cover here.\n\nI look forward to hearing from you!\n\nAre wearable devices accurate enough to help my Doctor?\n\n(Image credit: Michael Hicks / Android Central)\n\nRhea asks:\n\nAre wearables like watches and smart rings ready to be health devices yet? They can track information I need but if they aren't accurate are they helping or hurting? I know you've talked about this in the past but have a few years made a big difference?\n\nThanks!\n\nBe an expert in 5 minutes Get the latest news from Android Central, your trusted companion in the world of Android Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nHi Rhea, and thanks for sending in a great question. It's also an important one, especially for people with health concerns or fitness fanatics: Are wearable devices accurate enough in 2025?\n\nThe easy answer is no. But that's not the right answer. Accuracy is important, but it's not the only data that can be insightful for your health, and wearables do a pretty good job at it, even if they aren't giving the perfect readings.\n\nTo be clear, I'm talking about the things a wearable tracks on its own, like heart rate, breathing, sleep patterns, or (coming soon?) blood glucose. The things you have to enter yourself, like how many glasses of water you drank, are only as helpful as you make them. Cheating and saying you drank eight glasses of water instead of six is kind of silly.\n\n(Image credit: Nicholas Sutrich / Android Central)\n\nIt's true that wearables don't give perfect readings. They're built using fairly cheap off-the-shelf sensors and calibrated to work for (almost) everyone, not to work perfectly until it's recalibration time. Nobody would buy a smartwatch that needed to go back every 90 days to be tested and ended up costing a couple of thousand dollars to be slightly more precise.\n\nBut they don't need to be exact to be helpful. NEVER depend on a wearable device to make any sort of diagnosis or determine if you have an emergency in the works. The companies making them will tell you the same — if your watch says you're heart seems fine but you don't feel fine, go to the emergency room. The opposite is true, too — if the watch says there is a problem, but you don't feel like there's a problem, get looked at anyway.\n\n(Image credit: Derrek Lee / Android Central)\n\nIt sounds like I'm saying you shouldn't trust what you see from your watch, and that makes them seem unhelpful. That's half-right; don't fully trust what it tells you, but they can be very helpful because they have one thing going for them: consistency.\n\nI've tested a smartwatch against actual medical equipment, and the results were different, even to the point that the watch didn't see a real problem. What I've found is that while the readings may not be fully accurate, they are great at showing trends\n\nIf your watch indicates that your heart rate is 20 bpm different from an actual monitor, but shows a 20 bpm difference each time your heart rate rises or drops, you will see a consistent trend. And so will your doctor.\n\nI've even asked my doctor about this because I am a nerd. She told me that you can't get real-time clinical data from a watch or a ring, no matter the brand. However, you can review your history, and important information is readily available to help her. You aren't in her office hooked up to an EKG 24 hours a day, but you wear your watch whenever it's not charging. Those readings tell a story. That's why she wears one!\n\n(Image credit: Nicholas Sutrich / Android Central)\n\nI believe wearables play a crucial role in healthcare, particularly for individuals who require additional support in this area. But don't let your Pixel Watch or Galaxy Ring decide if and when you should go to the ER.\n\nProvide your doctor access to your wearable's health history and give them another tool to keep you healthy."
    },
    {
        "title": "The Medical Revolutions That Prevented Millions of Cancer Deaths",
        "description": "Vox publishes a story about \"the quiet revolutions that have prevented millions of cancer deaths.... \n\n\"The age-adjusted death rate in the US for cancer has declined by about a third since 1991, meaning people of a given age have about a third lower risk of d…",
        "url": "https://science.slashdot.org/story/25/06/09/0232200/the-medical-revolutions-that-prevented-millions-of-cancer-deaths",
        "source": "Slashdot.org",
        "publishedAt": "2025-06-09T11:34:00Z",
        "full_text": "Vox publishes a story about \"the quiet revolutions that have prevented millions of cancer deaths ....\"The age-adjusted death rate in the US for cancer has declined by about a third since 1991 , meaning people of a given age have about a third lower risk of dying from cancer than people of the same age more than three decades ago... \"The article begins with some recent quotes from Jon Gluck , who was told after a cancer diagnosis that he had as little as 18 months left to live — 22 years ago..."
    },
    {
        "title": "Air India crash kills at least 200 people, marking the first fatal Boeing 787 plane accident",
        "description": "An Air India plane with more than 240 people onboard crashed into a medical college just five minutes after takeoff.",
        "url": "https://www.businessinsider.com/air-india-crash-kills-200-people-first-fatal-boeing-accident-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-12T18:25:56Z",
        "full_text": "An Air India plane bound for London crashed into a medical college in Ahmedabad, killing at least 200 people.\n\n\n\nIndia's home minister said one passenger survived the Boeing 787 collision, which happened shortly after take-off. Two hundred forty-two people were onboard, including two pilots and cabin crew.\n\n\n\nAuthorities are investigating the incident. The crash is the first total loss of a Boeing 787 since the aircraft entered service over a decade ago."
    },
    {
        "title": "Microsoft says its new health AI beat doctors in accurate diagnoses by a mile",
        "description": "The AI system correctly solved 85.5% of medical cases in the study, outperforming 21 experienced doctors who averaged 20% accuracy.",
        "url": "https://www.businessinsider.com/microsoft-ai-diagnosed-accurate-doctors-medicine-study-2025-7",
        "source": "Business Insider",
        "publishedAt": "2025-07-01T06:45:48Z",
        "full_text": "Microsoft said its medical AI diagnosed cases four times as accurately as human doctors.\n\nMicrosoft said its medical AI diagnosed cases four times as accurately as human doctors. Matthias Balk/picture alliance via Getty Images\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nMicrosoft said its medical AI system diagnosed cases more accurately than human doctors by a wide margin.\n\nIn a blog post published on Monday, the tech giant said its AI system, the Microsoft AI Diagnostic Orchestrator, diagnosed cases four times as accurately as a group of experienced physicians in a test.\n\nMicrosoft's study comes as AI tools rapidly make their way into hospitals and clinics, raising questions about how much of medicine can or should be automated and what role doctors will play as diagnostic AI systems get more capable.\n\nThe experiment involved 304 case studies sourced from the New England Journal of Medicine. Both the AI and physicians had to solve these cases step by step, just like they would in a real clinic: ordering tests, asking questions, and narrowing down possibilities.\n\nThe AI system was paired with large language models from tech companies like OpenAI, Meta, Anthropic, and Google. When coupled with OpenAI's o3, the AI diagnostic system correctly solved 85.5% of the cases, Microsoft said.\n\nBy contrast, 21 practicing physicians from the US and UK — each with five to 20 years of experience — averaged 20% accuracy across the completed cases, the company added. In the study, the doctors did not have access to resources they might typically tap for diagnostics, including coworkers, books, and AI.\n\nThe AI system also solved cases \"more cost-effectively\" than its human counterparts, Microsoft said.\n\n\"Our findings also suggest that AI reduce unnecessary healthcare costs. US health spending is nearing 20% of US GDP, with up to 25% of that estimated to be wasted,\" it added.\n\n\"We're taking a big step towards medical superintelligence,\" said Mustafa Suleyman, the CEO of Microsoft's AI division, in a post on X.\n\nHe added that the cases used in the study are \"some of the toughest and most diagnostically complex\" a physician can face.\n\nSuleyman previously led AI efforts at Google.\n\nMicrosoft did not respond to a request for comment from Business Insider.\n\nWill AI replace doctors?\n\nMicrosoft said in the blog post that AI \"represents a complement to doctors and other health professionals.\"\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\n\"While this technology is advancing rapidly, their clinical roles are much broader than simply making a diagnosis. They need to navigate ambiguity and build trust with patients and their families in a way that AI isn't set up to do,\" Microsoft said.\n\n\"Clinical roles will, we believe, evolve with AI,\" it added.\n\nTech leaders like Microsoft cofounder Bill Gates have said that AI could help solve the long-standing shortage of doctors.\n\n\"AI will come in and provide medical IQ, and there won't be a shortage,\" he said on an episode of the \"People by WTF\" podcast published in April.\n\nBut doctors have told BI that AI can't and shouldn't replace clinicians just yet.\n\nAI can't replicate physicians' presence, empathy, and nuanced judgment in uncertain or complex conditions, said Dr. Shravan Verma, the CEO of a Singapore-based health tech startup.\n\nChatbots and AI tools can handle the first mile of care, but they must escalate to qualified professionals when needed, he told BI last month."
    },
    {
        "title": "Congress Demands Answers on Data Privacy Ahead of 23andMe Sale",
        "description": "House Democrats sent letters to the potential buyers of the genetic testing company, asking how they plan to protect customer genetic data under a change of ownership.",
        "url": "https://www.wired.com/story/congress-demands-answers-on-data-privacy-ahead-of-23andme-sale/",
        "source": "Wired",
        "publishedAt": "2025-06-12T16:08:34Z",
        "full_text": "US Representatives Alexandria Ocasio-Cortez and Jan Schakowsky on Thursday sent letters to the two potential buyers of troubled genetic testing firm 23andMe demanding details about consumer data privacy should either of them acquire the company.\n\nSigned by 20 other Democratic members of Congress, the letters—which can be read here and here—were sent to Regeneron Pharmaceuticals and TTAM Research Institute, which have put forth separate bids to buy 23andMe. In the letters, they ask Regeneron and TTAM if they will continue to give customers the option to delete their data and withdraw consent for their data to be used in medical research. They also want to know if 23andMe’s current policy of not sharing genetic data with law enforcement without a warrant will be upheld, and whether both entities intend to proactively notify 23andMe customers about the sale.\n\nAfter struggling for years to turn a profit, 23andMe filed for bankruptcy protection in March and put its assets up for sale. Shortly after, its CEO, Anne Wojcicki, resigned. Wojcicki had tried unsuccessfully to take the company private, but her proposals were rejected by a special committee formed by 23andMe’s board of directors.\n\nIn May, biotech company Regeneron announced that it was named the successful bidder in a bankruptcy auction, offering $256 million to acquire 23andMe. “We believe we can help 23andMe deliver and build upon its mission to help those interested in learning about their own DNA and how to improve their personal health, while furthering Regeneron’s efforts to use large-scale genetics research to improve the way society treats and prevents illness overall,” said George Yancopoulos, cofounder and chief scientific officer of Regeneron, in a company statement last month.\n\nBut after the auction closed, Wojcicki put in a bid of her own—offering $305 million through a newly formed nonprofit, TTAM Research Institute. The offer prompted a federal judge to reopen the sale process, and now both Regeneron and TTAM will have a chance to put in a final bid.\n\nFounded in 2006, 23andMe pioneered the field of personal genomics with its DNA test kits, which allow customers to learn about their ancestry, family connections, and certain medical risks after submitting a spit sample. Despite selling more than 12 million of its DNA testing kits, the company never achieved profitability and struggled to diversify its revenue streams after going public in 2021. In another blow to the company, a major data breach in 2023 exposed the personal data of millions of customers, including a leak that targeted users with Chinese and Ashkenazi Jewish heritage.\n\nThe new owner of 23andMe would acquire its vast trove of genetic data, raising questions about how that data would be used. Under 23andMe’s current policy, customers can choose to make their genetic data and other personal information available for medical research. They also have the option of deleting all of their data and directing 23andMe to destroy their saliva sample. The members of Congress who sent the letters on Thursday are seeking clarity from Regeneron and Wojcicki on whether they plan to continue those practices.\n\nThe signees are also concerned about genetic data being shared with law enforcement and immigration authorities and the possibility of genetic and other personal data being used to train AI models. They’re also asking Regeneron and TTAM to disclose a full list of all third parties who currently have access to 23andMe data and the steps both entities will take to ensure transparency of third-party access in the future. 23andMe previously had a multi-year research collaboration with pharma giant GlaxoSmithKline.\n\nThe representatives are asking Regeneron and TTAM to respond by June 26.\n\nWojcicki and 23andMe's interim CEO, Joe Selsavage, testified during a House Oversight Committee hearing this week on the privacy and national security concerns surrounding 23andMe’s sale. During that hearing, Selsavage told lawmakers that 1.9 million people, or about 15 percent of its customer base, have asked for their genetic data to be removed from the company’s servers since the company filed for bankruptcy protection in March.\n\nThis week, more than two dozen states and the District of Columbia filed a lawsuit against 23andMe, arguing that the company cannot auction 15 million customers’ highly sensitive personal genetic information without their consent or knowledge."
    },
    {
        "title": "Medical equipment repair is a fast-growing healthcare career. The average salary is $65,000, and it doesn't require a 4-year degree.",
        "description": "A career in medical equipment repair can pay $65,000 annually and offer job security and growth in a field that's facing a labor shortage.",
        "url": "https://www.businessinsider.com/medical-equipment-repair-growing-healthcare-jobs-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-06-11T19:33:08Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nHealthcare technology management, or HTM, is a growing field with promising career opportunities — but it's one that remains under the radar.\n\nIt ranked 22nd in the US News & World Report's list of the 100 best jobs of 2025. And according to a report from the US Bureau of Labor Statistics, jobs in medical equipment repair are expected to grow by 18% between 2023 and 2033 — a faster rate than average for all occupations.\n\nSeveral factors are driving this growth. Medical equipment repairers or biomedical equipment technicians are an increasingly vital part of the healthcare ecosystem. They maintain, calibrate, and repair everything from vital-sign monitors to MRIs.\n\n\"You can't deliver healthcare without either a patient, a provider, or an instrument,\" Jinesh Patel, the founder and CEO of the medical equipment management company UptimeHealth, told Business Insider. \"Without an X-ray, the radiologist isn't doing anything. Without a vitals monitor, the nurse can't tell you what's going on.\"\n\nThe industry is also aging out faster than new BMETs can be trained. A survey from the Association for the Advancement of Medical Instrumentation found that about a third of HTM professionals are over 55.\n\n\"A large portion of our experienced workforce is reaching retirement age, leaving a significant talent gap across the country,\" said Kristi McDermott, the chief operating officer of the clinical asset management company Trimedx. She added that too few people know about the viability, or even existence, of this profession.\n\n\"There's going to be a vacuum of knowledge very soon,\" said Patel, who added that he regularly struggles to find enough technicians for his hiring needs.\n\nThe US Bureau of Labor Statistics projects 7,300 openings for medical equipment repairers each year over the next decade; meanwhile, the Association for the Advancement of Medical Instrumentation reports that BMET programs only graduate about 400 students a year.\n\n\"This is a huge labor demand that isn't being met, and this is the time, in my opinion, for anyone to get involved,\" Patel told BI.\n\nBMET careers are accessible, well-paid, and meaningful\n\nWhile many other high-growth healthcare jobs require advanced degrees, medical equipment repair is a career you can start more quickly and affordably. Many technicians enter the field with just an associate degree, meaning they have relatively minimal college debt, and earn an average entry-level salary of about $65,000 a year. \"That's a high ROI on day one,\" Richard Gonzales, the president of the College of Biomedical Equipment Technology, said.\n\nSome jobs require even less prior education and training, as some employers offer paid apprenticeships or on-the-job training to meet skyrocketing demand. Gonzales said that his college is constantly working with top-tier healthcare organizations to help technicians land jobs faster.\n\n\"These organizations all want the same thing — to reduce the time it takes to establish minimum competency for an entry-level technician — and they're willing to put in the sweat equity to support that individual's career path,\" he explained.\n\nMany BMETs are also inspired by the ability to have a real-world impact on people's lives. \"You are actually helping create access to healthcare. Every time you get a machine back up and running, a patient can be seen on that machine again,\" Patel said.\n\n\"If you're interested in pursuing a career that has real meaning, just look at the patient connected to the device — you're making a difference,\" Gonzales said. He added that he sees a lot of veterans, like himself, pursue this as a second career for just that reason: \"You served your country, now you can serve your community.\"\n\nA future-proof trade for a modern healthcare system\n\nPatel likened medical equipment repair to trade careers like plumbing and electrician work: The need for those jobs isn't going away anytime soon. \"There's no world, at least that we can perceive, that equipment will not be used to help facilitate healthcare,\" he said. \"It's almost a guaranteed profession.\"\n\nGonzales said the opportunities for career growth are broad for technicians who are excited to continue learning. \"When you think about innovation, medical device integration, cybersecurity, network medical devices, advances in patient care, and AI,\" he said, \"somebody is either designing and creating these devices, installing them, hooking them to patients, or maintaining and repairing them.\"\n\nPatel added that the industry is ripe for new people to come in and help shape its future: \"If people get excited about not just doing a job, but being the next wave of leaders and people who help take it to the next level, this is the place to do it.\""
    },
    {
        "title": "A retired woman living month-to-month on disability says one of her biggest financial regrets was being too generous",
        "description": "Anita Clemons Swanagan was forced into early retirement after a brain tumor and several strokes that left her over $100,000 in medical debt.",
        "url": "https://www.businessinsider.com/retired-woman-regrets-giving-money-to-friends-and-not-saving-more-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-27T10:46:01Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nAnita Clemons Swanagan was forced into early retirement at 55 after developing a brain tumor and having several strokes. The medical bills piled up for the expenses that her health insurance would not cover.\n\nAt one point, she had over $100,000 in medical debt. She said she'd paid most of it off, but doing so drained most of her savings.\n\n\"Right now, I live totally on what I receive from disability,\" Swanagan said at the time of her interview with Business Insider in late 2024, adding, \"I wouldn't consider myself financially stable.\"\n\nAre you an older American comfortable sharing your retirement outlook with a reporter? Please fill out this quick form. We are especially interested in hearing from people 80 and older.\n\nSwanagan said that one of her financial regrets is giving too much money to friends in need when she was younger and not saving more for herself.\n\n\"It's OK to care about people,\" she said, adding, \"However, you have to look at what it is costing you mentally and financially. You only have so many years to prepare for retirement.\"\n\nSwanagan is one of many in the US whose retirement was derailed by a medical crisis. Dozens of people between 48 and 96 who have emailed reporters or responded to surveys about their biggest life regrets told BI their stories about not factoring medical expenses into retirement planning or prioritizing routine medical appointments.\n\nShe regrets not asking for more money\n\nAfter getting divorced, Swanagan raised her three children on a single salary as a solo parent, but never took government assistance before retirement. She believed being financially self-resilient set the right example for her children to become productive members of society.\n\nHowever, that meant she constantly worked long hours and juggled multiple jobs to support her family. She spent 15 years as a correctional officer in Texas, Kansas, Washington, and Illinois. She also worked in hospitals, worked side gigs on farms, and provided in-home care for Alzheimer's patients.\n\nSwanagan dedicated her career to helping others. SDI Productions/Getty Images\n\nLooking back, she regrets some of her decisions. \"There were times I worked for less than I was worth,\" she said, adding, \"I never demanded more money or moved on to where I was appreciated. My salary hovered around $50,000.\"\n\nShe wishes she'd saved more for the future\n\nDespite tight finances, Swanagan said she always helped coworkers and friends who were going through hard times. It was \"never more than a couple hundred dollars,\" she said, \"but it adds up.\"\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nShe said helping people is important, but your future self is someone worth helping, too. If she could go back in time, she said she would tell her younger self not to be so generous because the future is unknown.\n\n\"There's no such thing as a perfect retirement plan,\" she said. \"Circumstances change, and you can never be fully prepared.\"\n\nSwanagan is unable to work because of her disorder. Clancy Morgan/Business Insider\n\nLater in life, Swanagan was diagnosed with a rare, aggressive hormonal disorder called acromegaly, which she said caused her brain tumor and was a contributing factor to her diabetes and high blood pressure. It also caused some of her bones, including those in her jaw, to expand, which led her to lose all of her teeth and her joints to ache constantly.\n\n\"There's nothing they can really do about it to take the pain away, so I'm always in some degree of pain, stiffness. I have trouble walking,\" she said.\n\nUnable to work, Swanagan lives on inherited farmland in Illinois that has been in her family since 1856. At the time of her interview with BI, she was staying in her SUV, which she converted into a camper while she waited for the tiny home she ordered to arrive.\n\n\"I have people around me that are family that are willing to pitch in and help me put my home together,\" she said.\n\nThis story was adapted from Anita Clemons Swanagan's interview for Business Insider's series \"Life Lessons.\" Learn more about Swanagan's story and others' in the video below:"
    },
    {
        "title": "Stanford’s ChatEHR allows clinicians to query patient medical records using natural language, without compromising patient data",
        "description": "ChatEHR accelerates chart reviews for ER admissions, streamlines patient transfer summaries and synthesizes complex medical histories.",
        "url": "https://venturebeat.com/ai/stanfords-chatehr-allows-clinicians-to-query-patient-medical-records-using-natural-language-without-compromising-patient-data/",
        "source": "VentureBeat",
        "publishedAt": "2025-06-25T00:24:25Z",
        "full_text": ""
    },
    {
        "title": "Garmin’s new sleep-tracking armband lasts a full week between charges",
        "description": "Garmin has announced a new sleep-tracking band that can be strapped to your upper arm, which could make it more comfortable to wear overnight. The Index Sleep Monitor tracks sleep stages, heart rate, and even your breathing to create a “comprehensive view of …",
        "url": "https://www.theverge.com/news/688438/garmin-index-sleep-monitor-smart-arm-band-tracker",
        "source": "The Verge",
        "publishedAt": "2025-06-17T18:39:32Z",
        "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nGarmin has announced a new sleep-tracking band that can be strapped to your upper arm, which could make it more comfortable to wear overnight. The Index Sleep Monitor tracks sleep stages, heart rate, and even your breathing to create a “comprehensive view of overall fitness and recovery,” with a personalized sleep score delivered every morning so you know how well you slept, according to Garmin.\n\nThe Index Sleep Monitor is now available through Garmin’s online store in S-M and L-XL sizes for $169.99. The tracking is handled by a small, removable electronic module that features motion sensors and an optical heart rate sensor that Garmin says will run for up to seven days between charges.\n\nIn addition to tracking your light, deep, and REM sleep stages throughout the night, the Index can also measure your respiration rates, and, when paired with blood oxygen saturation measurements (a feature not available in all countries) it can help you “better understand shifts in breathing patterns while sleeping.”\n\nThe electronic module can be removed so the sleep monitor’s armband can be tossed in a washing machine (on the gentle cycle) for cleaning. Image: Garmin\n\nA thermometer monitors skin temperature, which can provide insights into how your environment is affecting your sleep while also flagging possible illnesses. Those temperature measurements also provide more insight into women’s health monitoring, including menstrual cycles, “improved period predictions,” and past ovulation estimates. However, Garmin says the Index is “not a medical device and is not intended for use in the diagnosis or monitoring of any medical condition.” The company also says it should not be used as a conception or birth control tool.\n\nOther health-related metrics that are monitored and made available through the Garmin Connect mobile app include estimates on stress levels based on sleep patterns, a Body Battery measurement letting you know if you’re low on energy and need more rest. Heart rate variability (HRV), which is a measure of the varying times between heartbeats, can also be used to assess if your body is dealing with increased stress or fatigue helping you know if you need to address issues with your sleep.\n\nThese are all metrics that can be measured using Garmin’s other smart wearables and many smartwatches, but only if you’re wearing them every single night. For those who prefer to charge their watches at night so their battery is full every morning, the Index Sleep Monitor provides an alternative way to track sleep metrics that’s also free of distracting notifications. The Index Sleep Monitor does have vibration capabilities, but they’re instead used as part of a smart alarm feature that only tries to wake you during lighter sleep stages."
    },
    {
        "title": "Kidney Transplant Patient Got Incredibly Rare Infection from Her Cat",
        "description": "The 56-year-old woman was hospitalized with an infection along her left arm's joints, tendons, and skin.",
        "url": "https://gizmodo.com/kidney-transplant-patient-got-incredibly-rare-infection-from-her-cat-2000622938",
        "source": "Gizmodo.com",
        "publishedAt": "2025-07-01T20:27:46Z",
        "full_text": ""
    },
    {
        "title": "Citadel hires a chief medical officer as Ken Griffin pushes for 'peak performance'",
        "description": "An internal company memo revealed the person is a neurologist who previously worked at Morgan Stanley and is a Harvard grad.",
        "url": "https://www.businessinsider.com/citadel-chief-medical-officer-david-stark-benefits-2025-7",
        "source": "Business Insider",
        "publishedAt": "2025-07-02T18:14:53Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nCitadel employees are now not only being paid like elite athletes, but treated like them, too.\n\nThe firm just hired former Morgan Stanley executive David Stark as its first-ever \"chief medical officer,\" Business Insider has learned. The new role, which was announced Monday in an internal memo obtained by BI, is meant to \"support peak performance\" in employees at both the hedge fund and its sister market-making firm.\n\nThe note said Stark, a neurologist who was previously in a similar role at Morgan Stanley, will start in September.\n\n\"In this newly created role, David will be responsible for driving innovation in employee benefits and wellness to further enhance the employee experience and support peak performance of our colleagues,\" said Sjoerd Gehring, Citadel's chief people officer, who joined from Apple in November, said in the memo.\n\nThis is the first in-house medical role for billionaire Ken Griffin's companies, according to a person with direct knowledge of the hire. Some offices have on-site medical clinics operated by third-party healthcare providers. Stark won't provide medical care, but will rework healthcare benefits, including concierge healthcare services, this person said. He'll also personalize health plans for the firm's employees.\n\nIt's not only a new role for Citadel, but also the $5.7 trillion industry. Other hedge funds have had performance coaches, nutritionists, and even personal trainers on staff — Citadel has employed a global head of culinary for years, for example — but this is the first chief medical officer in the space, according to the person close to the Miami-based fund.\n\nIt's another example of how the $66 billion hedge fund is more akin to an investment bank than its smaller asset management peers. Banks have long had these types of roles, in part to keep employees close to their desks so they can put in long hours with little interruption.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nGriffin has expressed admiration for the grueling work ethic required by many Wall Street institutions, specifically Goldman Sachs. Griffin, who has poached several Goldman executives to join his hedge fund and market-making firm, including Citadel Securities president Jim Esposito, said in 2020 at a talk with Goldman CFO John Waldron that leaders can't expect 9-to-5 schedules and \"a great weekend.\"\n\nIt's also not the first time the firm has offered employees extravagant work benefits. During the pandemic, Griffin rented out a hotel in Palm Beach as a makeshift trading floor so employees could work in a \"bubble.\" He once treated Citadel and Citadel Securities employees and their families to a weekend at Disney World, which included a concert headlined by Coldplay. Even their summer internship this year started with a trip to the Four Seasons.\n\nAccording to the memo, Stark's background includes training as a pediatric neurologist at Harvard Medical School. Before his time at Morgan Stanley, he was a medical director at Mount Sinai Health System.\n\nCitadel views this as another way to help it stand out in the industry's talent war.\n\n\"We believe this is a significant step forward, and one that will further differentiate Citadel as a place where exceptional people can achieve their highest potential,\" the memo said."
    },
    {
        "title": "'Really scary' - player in dugout hit by 105mph ball",
        "description": "Tampa Bay Rays player Hunter Bigge is taken to hospital after being hit by a 105mph foul ball while in the dugout at a Major League Baseball game.",
        "url": "https://www.bbc.com/sport/baseball/articles/cn412xjny09o",
        "source": "BBC News",
        "publishedAt": "2025-06-20T06:16:16Z",
        "full_text": "Tampa Bay Rays player Hunter Bigge was taken to hospital after being hit by a ball travelling at 105mph while in the dugout at a Major League Baseball game.\n\nThe relief pitcher, 27, was struck on the side of the face when the Baltimore Orioles' Adley Rutschman accidentally hit the ball into the home dugout at Steinbrenner Field in Tampa, Florida.\n\nBigge, who was not playing in the game as he recovers from a muscle strain, had been leaning on a rail in front of the dugout.\n\nEmergency medical staff rushed to help him and he was placed in a neck brace and taken away on a stretcher before going to hospital to be assessed.\n\nThe game was halted for 10 minutes while Bigge was treated but he gave a thumbs-up to the crowd as he was taken away.\n\nRays manager Kevin Cash said that Bigge remained conscious throughout and was talking to the medical staff while he received treatment.\n\n\"Certainly you feel for Hunter and his wife. I can't imagine what she and he were going through,\" he said.\n\n\"Scary for everybody, none more than them.\""
    },
    {
        "title": "One Woman’s Grueling Ordeal With Menopause and Medical Gaslighting",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_c71ba8b9-997f-4b64-a3e7-1390f13e03f8",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-06-18T10:37:00Z",
        "full_text": ""
    },
    {
        "title": "Watch: The emotional debate between MPs on assisted dying",
        "description": "MPs vote to back a bill legalising assisted dying in England and Wales by 23 votes.",
        "url": "https://www.bbc.com/news/videos/cj0mjm82j9yo",
        "source": "BBC News",
        "publishedAt": "2025-06-20T14:44:37Z",
        "full_text": "After several hours of emotional debate, MPs voted on a bill that would legalise assisted dying in England and Wales.\n\nThe bill would allow terminally ill adults with six months or less to live to get medical assistance to end their own lives.\n\nMPs were allowed to vote according to their personal beliefs, rather than following party lines.\n\nParliament voted to back the bill, which passed by 23 votes.\n\nThe Terminally Ill Adults (End of Life) Bill will now progress to the House of Lords, where it will face further scrutiny."
    },
    {
        "title": "Israeli strike at Gaza market kills 18 Palestinians, doctor and witnesses say",
        "description": "Witnesses said Israeli drones fired at Hamas police members dressed in civilian clothing and wearing masks.",
        "url": "https://www.bbc.com/news/articles/cly8dlzx918o",
        "source": "BBC News",
        "publishedAt": "2025-06-26T19:13:51Z",
        "full_text": "Israeli strike at Gaza market kills 18 Palestinians, doctor and witnesses say\n\n26 June 2025 Share Save Rushdi Abualouf Gaza Correspondent Share Save\n\nReuters People mourn Palestinians who were killed in an Israeli airstrike in Deir al-Balah\n\nAt least 18 Palestinians have been killed after an Israeli drone strike targeted a Hamas police unit attempting to assert control over a market in Deir al-Balah in central Gaza, a doctor and eyewitnesses told the BBC. Eyewitnesses said Israeli drones fired at Hamas police members, dressed in civilian clothing and wearing masks, who were confronting vendors they accused of price gouging and selling goods looted from aid trucks. The Hamas-run interior ministry condemned the strike, accusing Israel of committing \"a new crime against a police unit tasked with maintaining public order\". The Israeli military said it had struck \"several armed terrorists\" belonging to Hamas' Internal Security Forces.\n\nOne eyewitness told the BBC clashes broke out on Thursday after police confronted the vendors, with the unit commander shouting: \"Either sell at a fair price or we will confiscate the goods.\" Some of the vendors then \"pulled out handguns and one man had a Kalashnikov\", the eyewitness said. Israeli drones then fired two missiles, local residents said. Video footage from the aftermath shows bodies strewn on the ground and panicked shoppers screaming, as ambulances rush to attend to those injured. A doctor at Deir al-Balah's Al-Aqsa Hospital told the BBC 18 bodies were brought to the morgue there. It was not immediately clear how many of those killed were police officers. The Israel Defense Forces (IDF) said that prior to the strike, steps were taken to mitigate the risk of harming civilians.\n\nReuters A person is brought to Al-Aqsa hospital following an Israeli strike in Deir al-Balah\n\nThe incident came as civilians in Gaza continued to struggle to access food, with near daily shootings reported at and around US and Israel-backed Gaza Humanitarian Foundation (GHF) distribution sites in south and central Gaza, and the limited goods available in markets selling for highly inflated prices. The GHF - which has been accused of violating humanitarian principles by international aid groups - received a further $30m in funding on Thursday from the US, which has supported Israeli efforts to see it become the largest aid organisation in Gaza. Israeli Prime Minister Benjamin Netanyahu on Thursday accused Hamas of \"once again taking control of humanitarian aid… and stealing it from civilians\" in northern Gaza, as he gave the military two days to devise an \"action plan\" to prevent this. It came after video footage was filmed on Wednesday of a truck convoy carrying aid into northern Gaza, after entering through the Zikim gate, with armed and masked men on top. Israel's far-right National Security Minister Itamar Ben Gvir shared the video on social media, saying Hamas was \"taking control of the food and goods\" and calling on Netanyahu to halt the entry of aid into Gaza. Hamas has denied stealing or profiting from aid, and Gaza's higher committee for tribal affairs - a non-Hamas affiliated committee created during the war - also dismissed Israel's \"false claims\" in a statement on Thursday. \"The securing of aid has been carried out purely through tribal efforts,\" it said. At a warehouse in Gaza City on Thursday, thousands of aid parcels were distributed. Hamas political officials were present but said their role was \"supervisory\", with an NGO in charge of distributing some 6,000 food parcels. \"This morning, when I woke up to the message telling me to go get aid, all my children, young and old, started singing and dancing with joy. I pray to God that this blessing remains with us,\" one woman waiting for food there said."
    },
    {
        "title": "Diagnostics",
        "description": "“If it breaks, we’ll know how to fix it.” Old cars had an oil light, and that was about it. Often, we build things hoping they’ll work. But complex systems are more resilient when we build in the diagnostics for failure from the start. A multi-unit retail cha…",
        "url": "https://seths.blog/2025/07/diagnostics/",
        "source": "Seths.blog",
        "publishedAt": "2025-07-05T09:03:00Z",
        "full_text": "“If it breaks, we’ll know how to fix it.”\n\nOld cars had an oil light, and that was about it.\n\nOften, we build things hoping they’ll work. But complex systems are more resilient when we build in the diagnostics for failure from the start.\n\nA multi-unit retail chain, a medical practice, a school–they need a dashboard and process for finding and fixing things before the entire enterprise fails. A personal finance plan and a career probably need one too. It’s easier to do that well if we plan for it.\n\nThey don’t use canaries in coal mines any more, but you might need a few.\n\nPS if you’re already doing this, you know. If you’re not, this is the moment to begin."
    },
    {
        "title": "Norwegian doctor jailed for raping patients",
        "description": "Arne Bye is sentenced to 21 years in prison for abusing his position to conduct inappropriate exams.",
        "url": "https://www.bbc.com/news/articles/cgj8x7dz435o",
        "source": "BBC News",
        "publishedAt": "2025-06-06T16:55:32Z",
        "full_text": "Norwegian doctor jailed for raping patients\n\nArne Bye was found to have abused his position as a doctor to conduct inappropriate exams\n\nBye was also banned from practising medicine and ordered to pay compensation.\n\nNearly all of the offences took place during medical examinations that Bye carried out on his patients while he worked as a physician in the small town of Frosta - a tiny community of fewer than 3,000 residents, near Trondheim on the west coast of Norway.\n\nFormer GP Arne Bye was convicted of 70 counts of rape and sexual assault. He was also convicted of 82 counts of abusing his position as a doctor, Norwegian media report.\n\nA court in Norway has sentenced a doctor to 21 years in prison for the rape and sexual abuse of dozens of women, in a case that has shocked the Scandinavian country.\n\nWarning: this story contains details some may find distressing.\n\nThe court had deliberated over a lengthy indictment, which included allegations spanning nearly two decades relating to 94 women, according to Norwegian media.\n\nBye pleaded guilty to some of the crimes, and was also acquitted on a number of the charges.\n\nAddressing the court in Trondheim on Friday, Judge Espen Haug said the case was \"very serious\" and described Bye's actions as \"absolutely unacceptable\".\n\n\"The defendant's actions happened in a place and setting where people are supposed to feel safe,\" Judge Haug said. \"His actions have undermined public trust in the health service as well as doctors in general.\"\n\nThe 55-year-old defendant stood on his feet, appearing calm and unmoved as the maximum sentence was handed down.\n\nThe courtroom was then asked to sit as it took more than an hour for the judgement to be read out.\n\nHealth authorities had first alerted the police to concerns about Bye in August 2022, and he was charged a year later.\n\nBye had secretly installed a camera in his office, Norwegian media reports. Police uncovered the scale of his offences after reviewing hundreds of hours of footage.\n\nDozens of women and children, reportedly aged between 14 and 67, from the small, rural community came forward. The earliest complaint dated back to 2004, the most recent from 2022.\n\nCentral to the case had been the methods Bye used for medical examinations.\n\nOver four months, the court heard details of non-consensual touching and inappropriate pelvic examinations conducted by Bye.\n\nThese acts constitute rape under Norwegian law, which makes a distinction between penetrative and non-penetrative rape.\n\nBye was also shown to have used non-medical equipment, such as a deodorant, during these exams, with no justification for doing so.\n\nThe defence attorneys had sought a lower sentence of around 17-18 years as Bye had pleaded guilty to the rape of 21 victims.\n\nProsecutors told public broadcaster NRK that they were satisfied with the verdict, and would review the outcome before considering any appeals.\n\nBye's lawyer also said he would take some time to read the verdict properly before considering whether to appeal.\n\nIf you have been affected by any issues in this report, help and support is available at BBC Action Line."
    },
    {
        "title": "History Shows the Danger of Trump and RFK Jr.’s Health Policies",
        "description": "The medical achievements of the 20th century demonstrate how global health infrastructure is key to public health.",
        "url": "https://time.com/7286403/history-trump-rfk-jr-health-policies/",
        "source": "Time",
        "publishedAt": "2025-06-11T18:37:04Z",
        "full_text": ""
    },
    {
        "title": "Burnley sign England defender Walker from Man City",
        "description": "Burnley sign England defender Kyle Walker from Manchester City on a two-year deal.",
        "url": "https://www.bbc.com/sport/football/articles/cn5kq5k96vdo",
        "source": "BBC News",
        "publishedAt": "2025-07-05T10:38:31Z",
        "full_text": "Burnley have signed England defender Kyle Walker from Manchester City for a fee of up to £5m.\n\nThe right-back completed his medical on Friday and has signed a two-year contract with the Clarets.\n\nThe 35-year-old will work again with head coach Scott Parker, with whom he played at Tottenham Hotspur for two seasons.\n\n\"I'm delighted to be here,\" Walker told Burnley's website. \"I can't wait to come in and add my experience and quality to what looks an exciting squad.\n\n\"When I spoke to Scott and heard about his plans for next season, it was an opportunity I jumped at. He's done an amazing job here, guiding the club back to the Premier League.\""
    },
    {
        "title": "'I was lying in bed... The ceiling fell in': At the scene of Israeli hospital hit by Iran strike",
        "description": "A hospital in the Israeli town of Beersheba was hit as Iran fired a barrage of missiles at the country.",
        "url": "https://www.bbc.com/news/articles/c4gel0dd5y9o",
        "source": "BBC News",
        "publishedAt": "2025-06-19T16:25:36Z",
        "full_text": "'I was lying in bed... The ceiling fell in': At the scene of Israeli hospital hit by Iran strike\n\n19 June 2025 Share Save Lucy Williamson Middle East correspondent Reporting from Reporting from Beersheba Share Save\n\nAFP The Soroka hospital in Beersheba was hit by an Iranian strike on Thursday, although Iran denies targeting it\n\nBlack smoke was still billowing from the middle of the Soroka Medical Center when we arrived, several hours after Iran's attack on the building. Pieces of twisted metal shrapnel – some of it apparently from the missile itself – scattered across a 200m (656ft) area in and around the hospital complex. Vehicles carrying medical staff lined the road outside – an emergency response to a situation that many had feared would be worse. Crowds of soldiers, police and rescue teams milled around the hospital entrances, as a stream of ministers arrived to express their outrage at the strike.\n\nAlon Uzi was wandering around outside the hospital entrance with two bags of belongings. He said he had been receiving treatment in the emergency department when the attack happened, and didn't have time to reach the shelter. \"I was lying in bed, and I heard a big boom,\" he told us. \"And before I could do anything, there was an explosion and part of the ceiling fell and I was covered with white dust. \"There was no time to get out of bed. I was just getting ready and then I heard a whistling noise.\" Inside the emergency reception area, the air carried the tang of chemicals mixed with dust. Patients were still being evacuated on stretchers from deep inside the building, as emergency teams passed through into the surgical wards that were hit. Medical staff told local media that patients there had recently been moved to the hospital's emergency shelters underground. Seventy-one people have been injured, according to Israel's ministry of health.\n\nThe BBC spoke to Alon Uzi who was receiving treatment at the time of the blast\n\nReuters Hospital staff rushed to move patients to safety following damage to the building\n\nProfessor Asher Bashiri, director of the maternity ward, said he could see the area of impact from his office. \"It looks unbelievable,\" he told me. \"The upper part of the building is cracked, and fire was coming from it in the first hours. Everything looks broken.\" He said they had moved all the patients to a more protected area when the war began. \"We were very, very lucky,\" he said. \"It could have been so much worse. But we are still living in an unbelievable situation. It's not finished – I don't know what will happen tomorrow, or the next day. We're just happy that we're alive.\" The hospital director, Shlomi Codish, said that the northern surgical building was hit and that several wards were demolished, with extensive damage to the entire hospital. \"We expect that we will be transferring over 200 patients in the next few hours to other medical centres,\" he said. \"We're trying to minimise the number of people; we don't know if buildings might collapse or if wards might collapse.\" Among the stream of ministers visiting the site today was Culture Minister Miki Zohar, from Prime Minister Benjamin Netanyahu's Likud party. \"All the people need to know what we're facing – a regime that is trying to kill innocent people,\" he said. \"When you're dealing with evil, this is a different war. Believe me, we won't stop until we win. We're going to reply and it's going to be very strong.\" Mr Zohar was asked about Israel's history of bombing hospitals in Gaza – locations its army says are being used as military control centres by Hamas. \"We keep innocent people in Gaza safe as much as we can,\" he said. \"We call them to evacuate before we bomb. This is the big difference between Iran and us.\"\n\nBBC on the scene at Israeli hospital struck by Iranian missile"
    },
    {
        "title": "'We're not Rottweilers': Behind the scenes at a GP 8am scramble",
        "description": "The BBC goes behind the scenes at a GP surgery dealing with the high demand for appointments.",
        "url": "https://www.bbc.com/news/articles/c2lzny07jqxo",
        "source": "BBC News",
        "publishedAt": "2025-06-21T23:44:10Z",
        "full_text": "'We're not Rottweilers': Behind the scenes at a GP 8am scramble\n\n21 June 2025 Share Save Rob Sissons Health correspondent, BBC East Midlands Share Save\n\nBBC Jayne Bond and Sandra Brewster answer the phones during the rush for a same-day GP appointment\n\nAnyone who has ever tried to get a GP appointment in England will be familiar with the \"8am scramble\", as you phone your local surgery desperately hoping to get through. Many surgeries - like the Tudor House Medical Practice - open their telephone lines at 08:00, meaning that if you want an on-the-day appointment, you have to phone on the dot at 08:00. This can prove a source of frustration, with Jayne Bond - part of a four-strong team at the increasingly busy practice - often at the sharp end of patients' upset. \"Some people think we are Rottweilers, and we are trying to stop them getting appointments,\" she said. The practice invited the BBC to watch them at work first thing in the morning during the busiest part of their day, when those phone lines open.\n\nThe Tudor House Medical Practice in Nottingham has almost 7,000 patients\n\n\"When the phone lines open, it just goes manic,\" fellow receptionist Sandra Brewster said. She knows the scene at the practice, in Sherwood, is repeated at surgeries across the land when they release their same-day bookable appointments first thing. \"It is mad - we try and grab a cup of tea before the phones open up,\" Sandra added. Often potential patients can get frustrated when receptionists ask for more information. Jayne, 66, said: \"We are on the ball - we have to be. \"Some people think we are nosy, but we are just trying to get them to the right person.\" Eighty per cent of face-to-face GP appointments at the surgery are bookable on the day and released first thing, and typically within half an hour, they are gone.\n\nLike many surgeries, the practice has experienced increasing demand\n\nWe observed the pressure on a typical Wednesday morning. Jayne said: \"We normally call it 'wacky Wednesday' - it can be a very busy day.\" Only five minutes after the lines open, more than 30 people are queuing to get through. The telephone system has recently been upgraded, with an option for people to request to be phoned back without the caller losing their place in the queue. But despite this \"improvement\", high demand will mean some inevitably miss out. Sandra, also 66, admits receptionists can't always give people what they want. \"People have said to me, 'well if I die it will be your fault'. \"There can be verbal abuse - you just have to go home and forget about it and remember it is the situation, not personal, but they are the calls you remember,\" she said. We observed that 50 people were booked in at the surgery within 25 minutes.\n\nPractice manager Tricia Gibbons says the call handlers \"do a fantastic job\"\n\nThis relentless demand for appointments is a picture repeated across the country, and has seen the government step in earlier this year. The Labour government had pledged in its manifesto to end the early morning phone \"scramble\" for appointments, and in February, confirmed a deal to give an extra £889m a year to general practices. The new contract says patients should be able to arrange appointments online throughout working hours, freeing up the phones for those who need them most, and making it easier for practices to triage patients based on medical need. Practice manager Tricia Gibbons said patients were \"getting more used to not always seeing a GP\". The 56-year-old said: \"When I first started 11 years ago, we only had access to GPs and trainee doctors.\" The surgery now has an expanded team of health professionals to complement the work of family doctors, including an advanced nurse practitioner and a clinical pharmacist, which can see patients. Tricia stressed, though, that \"the doctors are always there to offer back-up\". \"This model is about giving doctors more time to focus on more complex cases,\" she said. \"Other members of the team are well placed to deal with the more minor illnesses and ailments.\"\n\nDr Jonathan Lloyd, a GP partner, said demand meant there was \"more pressure on doctors\"\n\nDr Jonathan Lloyd, a GP partner at the surgery, said demand for primary care had gone up hugely since he began working as a doctor almost 30 years ago. \"The number of appointments the average patient has each year has increased, and people have got older, and there are more people with dementia and chronic disease,\" he said. \"The number of GPs has not increased at the same rate, so there is more pressure on doctors.\" The 57-year-old said accessing primary care across the country was a \"big problem\", but felt most patients were \"comfortable\" knowing they might not always see a doctor. He said six out of 10 GP appointments were in person, with the rest on the phone, which \"many people are quite happy about\". \"Our patients have control over that - if they want to see me face-to-face, they can,\" he added.\n\n'Nowhere near a solution'\n\nLatest annual figures from NHS England show that record numbers of appointments - more than 370 million - were offered by GP surgeries in 2024-25, with almost two-thirds face to face, and the rest virtual. Four out of 10 appointments at surgeries are with doctors, and the rest with other health professionals. More than half of appointments were booked at least a day ahead, with the rest on the same day. Katie Bramall-Stainer, who chairs the British Medical Association GPs' committee, previously told BBC Breakfast that the new government deal could see patients begin to notice a difference in six to 12 months, but said the overall situation was \"nowhere near a solution\". So for now, the likes of Jayne and Sandra will continue to keep an eye on the clock as 8am approaches.\n\nFollow BBC Nottingham on Facebook, on X, or on Instagram. Send your story ideas to eastmidsnews@bbc.co.uk or via WhatsApp on 0808 100 2210."
    },
    {
        "title": "Premature Newborn Dies in Ontario After Catching Measles From Unvaccinated Mother",
        "description": "Thousands of people, mostly children, in the U.S., Canada, and Mexico have contracted the vaccine-preventable disease this year.",
        "url": "https://gizmodo.com/premature-newborn-dies-in-ontario-after-catching-measles-from-unvaccinated-mother-2000612381",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-06T15:45:03Z",
        "full_text": ""
    },
    {
        "title": "US researchers find cancer’s secret weapon to defeat death",
        "description": "Dallas (tca/dpa) — Fat isn’t just a guilty pleasure — it’s cancer’s secret weapon. New research from UT Southwestern Medical Center is shedding light on why ...",
        "url": "https://www.yahoo.com/news/us-researchers-cancer-secret-weapon-161527042.html",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-06-30T16:15:27Z",
        "full_text": "Dallas (tca/dpa) — Fat isn’t just a guilty pleasure — it’s cancer’s secret weapon. New research from UT Southwestern Medical Center is shedding light on why this is the case.\n\nIn a study published this month in the journal Nature, the researchers found cancer cells steal fat-packed molecules from the bloodstream, arming themselves with a potent antioxidant that shields them from death.\n\nTumours appear to do this by reeling in lipoproteins — molecules that carry fats and fat-soluble nutrients like vitamin E in the bloodstream — through sugar-coated molecules on their cell surface. These sulfated glycosaminoglycans (or GAGs) allow cancer cells to fortify their cell membranes with vitamin E and avoid a form of cell death called ferroptosis.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThough clinical applications are still a ways off, the study underscores how understanding cancer’s metabolism could open new doors for treatment, said Dr. Shad Thaxton, an associate professor of urology at Northwestern University’s Feinberg School of Medicine, who was not involved in the study.\n\n“I think this paper and others in the field (emphasize) the appreciation for ferroptosis as a mechanism to kill cancer cells — that mechanism of cell death is so intimately intertwined with cell metabolism,” Thaxton said. “I think what’s interesting for people is that metabolism has a really big impact on the potential vulnerability of cancer cells to specific therapies.”\n\nBuilding blocks with functional perks\n\nCancers rewire their metabolism in ways that support their growing horde of destructive cells. Some of this rewiring involves producing energy from glucose and acquiring cellular building blocks such as nucleic acids, proteins and lipids.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nAmassing cellular building blocks is especially crucial since a tumour’s uncontrolled growth lends to it creating a hostile microenvironment where there aren’t enough nutrients and other resources, said Javier Garcia-Bermudez, an assistant professor at UT Southwestern Medical Center’s Children’s Medical Center Research Institute, who led the study.\n\nLipids are essential for a tumour to grow and progress. The plasma membrane of each cell is a bilayer of lipids; as cancer cells swell in number, they have to source lipids from their immediate environment or make their own to maintain their plasma membranes.\n\nGarcia-Bermudez said that was the prevailing theory as to why lipids are so important to cancer. Emerging research has since discovered that lipids may offer cancer cells more functional perks. For example, a September 2024 study found that cancer cells use lipids called sphingolipids to go into stealth mode, evading detection and destruction by the immune system.\n\nStudies have also found lipids are somehow involved in ferroptosis, a type of cell death discovered in 2012. A portmanteau of “ferrous,” the Latin word for iron, and apoptosis, the scientific word for programmed cell death, ferroptosis happens when a buildup of toxic molecules called oxidants and iron overwhelms a cell, causing it to essentially rust from the inside out.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\n“Oxidants damage the lipids that are forming the membranes (of) a cell,” Garcia-Bermudez said. “What’s interesting is that cancer cells tend to produce more oxidants than normal cells,” he added, noting that there’s been interest in understanding why some cancers are more susceptible to this type of damage and in using ferroptosis to kill cancer cells.\n\nCut the GAGs, kill the cancer\n\nThe crafty masters of survival that they are, cancer cells have devised ways to dodge ferroptosis. Unraveling the reason why put Garcia-Bermudez and his lab on a four-year journey of scientific inquiry.\n\nOne of the researchers’ first findings, after screening 200 metabolic genes linked to cancer, was that an enzyme called glutathione peroxidase 4 was active in tumours. This wasn’t a new discovery: Studies have shown this enzyme, which can stop lipids from degrading, plays a pivotal role in controlling ferroptosis.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nWhen glutathione peroxidase 4 was erased from a cancer cell’s genome, the tumor would die — unless it was given a drug blocking ferroptosis or fed lipoproteins.\n\n“That was a clue that lipoproteins were somehow related to ferroptosis,” said Dr. Ralph DeBerardinis, director of UT Southwestern Medical Center’s Eugene McDermott Center for Human Growth and Development, who coauthored the study.\n\nIn a battery of experiments that included depriving cancer cells in petri dishes of lipoproteins and exposing them to different antioxidants, the full picture began to be unveiled. Cancer cells were intercepting lipoproteins, particularly those bearing vitamin E — a fat-soluble antioxidant — from their surrounding environment. Like a fisherman with a fishing line, cancer cells accomplished this not with the usual reels used to catch lipoproteins but with long, flowy sugar chains called sulfated glycosaminoglycans (or GAGs). These molecules are attached to a cancer cell surface through another molecule called a proteoglycan.\n\nWhen the scientists blocked the biochemical pathway responsible for manufacturing GAGs, this limited a lab-grown cancer cell’s access to vitamin E and made it more vulnerable to ferroptosis. In mice grafted with cancer cells, cutting off the pathway slowed tumor growth.\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nThe researchers also examined 20 tumours donated by patients with clear cell renal carcinoma, the most common type of kidney cancer, affecting over 640,000 people in the United States. These tumors had higher levels of GAGs and vitamin E — about 15 times more of the latter — compared to normal kidney tissue. Disrupting the biochemical pathway producing GAGs prevented kidney cancer cells from devouring vitamin E-laden lipoproteins, dying by the iron hand of ferroptosis.\n\nFuture research\n\nGarcia-Bermudez and DeBerardinis caution that there is much more research to be done before their study’s findings have any clinical application for treating cancer.\n\n“We know that GAGS are on the surface, they speak to the lipoproteins and they affect the uptake of lipoproteins,” Garcia-Bermudez said. “But how mechanistically this happens, especially in the cancer cell, hasn’t been shown before … If we understand how this works and we find molecular targets that maybe we can treat with drugs and block, then we have a way to specifically deplete vitamin E in the tumor.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nDeBerardinis said the research does not suggest any association between dietary vitamin E and cancer risk, or how vitamin E levels correlate with cancer patient outcomes. Figuring out those possible connections would be points for future study.\n\nIn the short term, DeBerardinis said, these findings could be used to investigate whether tumours with higher levels of glycosaminoglycans or stored vitamin E are linked to patient outcomes, such as survival rates or how well they respond to treatment.\n\nThaxton said there are currently no federally approved cancer treatments that incite ferroptosis. His lab at Northwestern University’s Feinberg School of Medicine is conducting research into synthetic lipoproteins devoid of any lipid passengers — a Trojan horse without soldiers hiding inside.\n\nThe cancer cells expect to get the lipoproteins with fats like cholesterol and vitamin E, Thaxton said, but “they end up dying of ferroptosis. Our drug doesn’t carry anything and it’s through this mechanism by which you can kill the cell.”\n\nAdvertisement Advertisement\n\nAdvertisement Advertisement\n\nFor Garcia-Bermudez and DeBerardinis, their research efforts were like finding a needle in a haystack, one they hope to find more needles in.\n\n“Our study is really exciting, but at the same time it’s a very basic discovery,” Garcia-Bermudez said. “It was incredible to discover something that people have not observed in cancer before, to understand why these tumours are so resistant. I’m super excited to keep working on this.”"
    },
    {
        "title": "Angels' Washington to miss remainder of season",
        "description": "The Angels said Friday that manager Ron Washington will remain on medical leave for the rest of the season.",
        "url": "https://www.espn.com/mlb/story/_/id/45598633/angels-ron-washington-remain-medical-leave-season",
        "source": "ESPN",
        "publishedAt": "2025-06-27T21:51:16Z",
        "full_text": "ANAHEIM, Calif. -- Los Angeles Angels general manager Perry Minasian met with his players early Friday afternoon and informed them that Ron Washington, their beloved, hard-nosed manager, would remain on medical leave for the remainder of the 2025 season.\n\nWashington, who at 73 is the oldest manager in the major leagues, was initially placed on leave because of an undisclosed medical issue June 20. His hope was to eventually return to his role this season -- and to be on the team's flight to Atlanta on Sunday night, where he would be reunited with a Braves organization he spent several years with -- but he and the team decided stepping away would be in his best interest.\n\nRay Montgomery, in his fourth year as the bench coach, will serve as interim manager for the team, which had won three straight before a 15-9 loss to the Nationals on Friday night dropped it to 40-41 on the season. Without going into specifics, Minasian sounded optimistic about Washington's long-term prognosis, adding that he is \"in good spirits.\"\n\n\"We want him here,\" Angels outfielder Mike Trout said, \"but we want him to get better.\"\n\nWashington, in his second year managing the Angels, experienced shortness of breath and appeared fatigued near the end of the team's four-game series at Yankee Stadium, which ended June 19. He underwent a series of tests upon returning to Southern California the following day and was placed on leave for the weekend series against the Houston Astros.\n\nWashington was still a notable presence in the ballpark then. The broadcast cameras caught him eating chicken wings from one of the Angel Stadium suites during last Friday night's game, delighting social media. On Sunday morning, he was on the field for pregame workouts and spoke optimistically about his chances of returning. But further testing prompted the team to extend his leave through the next three-plus months of the season.\n\n\"It's tough hearing news like that, especially when you first get to the ballpark,\" Angels shortstop Zach Neto said. \"But hearing great news that he's doing better, that whatever he has, they got it quick ... we're just grateful for that. Of course we want him here, we want him here managing us and all that, but health comes before everything else.\"\n\nWashington's contract includes a club option for 2026. Minasian would not speculate on Washington's future role with the team and said he does not know how involved Washington will be with the team moving forward.\n\n\"We're going to take it day by day, and we're going to do whatever he feels is the right thing to do,\" Minasian said. \"I'm not going to project going forward. Obviously, you'd love to have him around as much as you can. That's a no-brainer. But with that being said, we're going to do whatever's best for him.\"\n\nWashington carved out a 10-year career as a major league infielder, then transitioned to coaching, spending the 1996 to 2006 seasons with the then-Oakland Athletics. From there, Washington managed powerhouse Texas Rangers teams that made back-to-back World Series appearances in 2010 and 2011. He abruptly resigned Sept. 5, 2014, later revealing the decision was prompted by an extramarital affair.\n\nWashington returned to the A's for the next two seasons, then served as the Braves' third-base coach and infield instructor from 2017 to 2023, winning a World Series championship along the way.\n\nWhen the Angels hired him to return to managing in November 2023, Washington's reputation as one of the game's best teachers and most infectious personalities had long been established. Their hope was that he could turn around a franchise that by then had navigated eight consecutive losing seasons, specifically by elevating a young nucleus headlined by Neto and Logan O'Hoppe. That initial 2024 season saw the Angels lose a franchise-record 99 games. The next year began with a 26-31 record through May. But then the Angels' fortunes began to turn.\n\n\"I mean, he's the main reason why everything has been the way it has been around here this year so far,\" said O'Hoppe, the Angels' young catcher. \"It's nothing that we're not going to keep replicating. We're going to take the lessons he's given us and keep applying it.\"\n\nMinasian has long said that teams eventually embody the personality of their manager, and over the past few weeks, he has noticed a stark trait with his group -- resilience.\n\nEntering Friday, the Angels had reeled off 14 wins in 23 games in June, getting back to .500 as they approached the midway point of their schedule. A season that once seemed lost has suddenly sprung back to life, and through that, Minasian said, the team has come to personify Washington.\n\n\"We play to the last out as hard as possible,\" said Minasian, who was an advance scout with the Rangers and an assistant GM with the Braves during Washington's time with both organizations. \"A majority of credit to that should go to Ron, what he's instituted here and what he preaches on a daily basis.\""
    },
    {
        "title": "Officer shot and killed by inmate during medical visit: Sheriff",
        "description": "Two detention officers were escorting the suspect -- a heightened protocol after the inmate had previously attempted a failed escape from jail, authorities said.",
        "url": "https://abcnews.go.com/US/north-carolina-cherokee-county-detention-officer-shot-killed-inmate-medical-visit/story?id=123357979",
        "source": "ABC News",
        "publishedAt": "2025-07-01T01:03:53Z",
        "full_text": ""
    },
    {
        "title": "2 killed in June 6 Northfield Center Twp murder-suicide identified by medical examiner",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_96a00688-2766-4d94-9f5c-4d9669da2dd2",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-06-10T13:14:16Z",
        "full_text": ""
    },
    {
        "title": "US FTC workshop criticizing medical care for transgender youth draws staff opposition",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_eb01a7a7-e231-4be5-a65c-52dc826c001d",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-07-02T22:34:14Z",
        "full_text": ""
    },
    {
        "title": "Foreign medical residents fill critical positions at US hospitals, but are running into visa issues",
        "description": null,
        "url": "https://consent.yahoo.com/v2/collectConsent?sessionId=1_cc-session_2e6c32dc-ff2d-4919-b5a5-76859b1c70ec",
        "source": "Yahoo Entertainment",
        "publishedAt": "2025-07-04T04:04:50Z",
        "full_text": ""
    },
    {
        "title": "'You barely see people out': How immigration raids are reshaping daily life in Puerto Rico's Dominican enclave",
        "description": "Puerto Rico's Dominican immigrant community is on edge following a series of immigration raids, which started in January. People have stopped going to work, sending kids to school, or attending medical appointments. What was once a lively barrio is now mostly…",
        "url": "https://www.npr.org/2025/06/07/nx-s1-5388933/immigration-raids-are-reshaping-daily-life-in-puerto-ricos-dominican-enclave-trump",
        "source": "NPR",
        "publishedAt": "2025-06-07T10:00:00Z",
        "full_text": "'You barely see people out': How immigration raids are reshaping daily life in Puerto Rico's Dominican enclave\n\ntoggle caption Keren Carrión/NPR\n\nSAN JUAN, Puerto Rico — Juan Vega Paredes now has a new way of introducing himself to people he meets.\n\n\"I'm el hombre de los aguacates,\" he says, with a smile on his face.\n\nAvocado man, his new nickname, was born out of one of the worst days of his life: On January 26, Vega Paredes was arrested by federal immigration agents as he was walking to buy some avocados.\n\nHe's one of some 500 Dominican migrants arrested in Barrio Obrero, the heart of the Dominican community in San Juan, since President Trump took office in January.\n\ntoggle caption Keren Carrión/NPR\n\n\"Once I got intercepted, I thought, 'Oh, this is because of Donald Trump,'\" Vega Paredes says. \"I resigned myself.\"\n\nSponsor Message\n\nAccording to ICE , about 75 percent of the people arrested on the island so far have been Dominicans. Fewer than 80 of the 500 people detained by ICE had criminal records.\n\nMany of the arrests have happened in this poor, working-class community. These sweeps have neighbors on edge, and have transformed the once-lively barrio. Now, many restaurants are largely empty during the day and at night. Fewer people are going to church and everyone talks about immigración, the immigration agents.\n\nAll of this has driven immigration rights advocates, lawyers and some politicians to form an alliance to try to push back against Trump's policies.\n\nEl hombre de los aguacates\n\ntoggle caption Keren Carrión/NPR\n\nVega Paredes came to the U.S. territory of Puerto Rico in 2021 in a yola, a flimsy open boat made of wood, packed with other Dominicans traversing the dangerous 80-mile stretch of ocean between the Dominican Republic and Puerto Rico.\n\n\"I came to work, prosper, and give my daughters in the Dominican Republic a better life,\" Vega Paredes said.\n\nSince then, he's been living in the U.S. territory without legal status.\n\n\"Sometimes, when you migrate, you feel weird,\" Vega Paredes said. \"But when I got here I felt supported… despite my pain.\"\n\nSponsor Message\n\nHe's built a stable life here. He works in construction seven days a week building homes.\n\nHe rarely takes days off. But on Sunday, January 26, he was tired, so he didn't go to work.\n\nInstead, Vega Paredes woke up, and went to buy some avocados for his wife who was cooking at home. While walking down one of Barrio Obrero's streets, he was surrounded by immigration agents.\n\nVega Paredes is married to a U.S. citizen and he doesn't have a criminal record. But he's been living on the island illegally and immigration agents arrested him. He spent a few weeks at the troubled Krome Detention Center in Miami , a place some immigrants detained there have described as \"hell on earth.\"\n\nVega Paredes said he remembers men there crying in fear, uncertain about what was coming next.\n\n\"I kept telling one of them, 'be brave,'\" Vega Paredes recalled saying. \"But inside I was about to break down.\"\n\nVega Paredes was later relocated to a federal prison in Miami, and eventually released on a $10,000 immigration bond. His next ICE hearing is in July. It's unclear what will happen next. The Department of Homeland Security didn't respond to questions from NPR about the process.\n\ntoggle caption Keren Carrión/NPR\n\nOn a recent hot day, Vega Paredes walked by the spot where he was arrested and stood under a beautiful tree with lilac flowers. A woman, Digna Gómez, approached him.\n\n\"Do you remember a man who was arrested right here?\" he asked her.\n\nGómez did remember.\n\n\"I'm the famous hombre de los aguacates,\" he told the woman.\n\nGomez, who lives in the house with the beautiful tree, is also Dominican. She's in the U.S. territory legally, but is still scared.\n\nShe says she knows of many Dominicans picked up by ICE, including the barber who hid in a dumpster, or the man known as El Pescador, the fisherman who was arrested with his son.\n\nSponsor Message\n\n\"Now we have to carry our immigration documents at all times because you never know when you might get picked up,\" she said.\n\nAlliances to push back\n\ntoggle caption Keren Carrión/NPR\n\n\"Barrio Obrero is being stigmatized as a community with these persistent interventions at all hours,\" said Annette Martínez-Orabona, the executive director of the American Civil Liberties Union (ACLU) in Puerto Rico. The group is leading efforts to push back against the enforcement operations in immigrant communities on the island.\n\nShe said immigration raids are not new in Puerto Rico, but this time they are different.\n\n\"There's no reason for the government to repeat the raids in the same streets, in front of the same churches, in front of the same plaza,\" Martínez-Orabona said. \"No reason, besides wanting to criminalize that community.\"\n\nIn an interview with NPR , Rebecca González-Ramos, ICE's top investigator in Puerto Rico, dismissed the allegations of discrimination.\n\n\"There's been people detained from all sorts of countries. It's not just Dominicans,\" González-Ramos said. \"Most of them have been Dominicans because they are the highest population here from a foreign country.\"\n\nIn response to the detentions, the ACLU of Puerto Rico is spearheading an alliance between lawyers and the medical guild, whose members are already visiting patients at their homes, since many are scared and not going out to receive medical care.\n\n\"We are not going to violate the law, or the President's orders,\" Dr. Carlos Díaz Vélez, the president of the Association of Physicians and Surgeons of Puerto Rico, said. \"But we want to save people's health, safety, and give access to health care.\"\n\nChurches in Barrio Obrero, like the San Pablo Methodist Church, are also helping migrants with food, and access to legal aid.\n\ntoggle caption Keren Carrión/NPR\n\nA small tree-lined plaza is across the street from the Methodist church. Plaza Antonio R. Barceló is nestled between homes, bars like El Cibao and Arriba El Son, and places for migrants to send money back to the Dominican Republic.\n\nSponsor Message\n\nIt's the heart of Barrio Obrero, the place where people meet and play dominoes, and take breaks.\n\nSusana Rosario, 61, sits on a bench there every day. She's Dominican and has a green card now, but she used to live here without legal status. She works for the city of San Juan as a street sweeper and Barrio Obrero is part of her route.\n\n\"You barely see people out,\" Rosario said.\n\nShe said she has mixed feelings about Trump's immigration policies.\n\nShe wants him to remove \"those who are getting drunk or doing bad things,\" but not the people who are hard workers, she says.\n\nRosario lives about three miles from the center of Barrio Obrero.\n\nA few days later, after her first encounter with NPR, we found her crying on a bench.\n\nHer two Dominican neighbors — good kids, as she describes them — were just picked up by ICE at a construction site nearby."
    },
    {
        "title": "Person dies from rabies after stray dog contact",
        "description": "The person died after contact with a dog while on holiday in Morocco, the UK Health Security Agency says.",
        "url": "https://www.bbc.com/news/articles/c98wyllp170o",
        "source": "BBC News",
        "publishedAt": "2025-06-18T12:52:52Z",
        "full_text": "British woman dies from rabies after puppy scratch\n\n18 June 2025 Share Save Steve Jones & Rachel Russell BBC News, Yorkshire Share Save\n\nFacebook Yvonne Ford, 59, contracted rabies after being scratched by a dog while on holiday, her family said\n\nA British woman has died from rabies after she was \"scratched\" by a puppy in Morocco, her family said. Yvonne Ford, 59, from Barnsley, South Yorkshire, had light contact with the stray dog while on holiday in February in the North African country. In a social media post, reported by the Press Association, Mrs Ford's family said she developed a headache two weeks ago and later couldn't \"walk, talk, sleep, swallow\". The UK Health Security Agency (UKHSA) said there was no risk to the wider public due to no documented evidence of rabies passing between people.\n\nMrs Ford was diagnosed at Barnsley Hospital after returning to the UK, the hospital trust confirmed, and was later transferred to the Royal Hallamshire Hospital in Sheffield. She died on 11 June. An inquest into her death opened in Sheffield on Wednesday. In the Facebook post, her daughter Robyn Thomson said the family \"is still processing this unimaginable loss\". \"She was scratched very slightly by a puppy in Morocco in February,\" she wrote. \"At the time, she did not think any harm would come of it and didn't think much of it. She continued: \"Two weeks ago she became ill, starting with a headache and resulted in her losing her ability to walk, talk, sleep, swallow. Resulting in her passing.\" Close contacts of Mrs Ford and health workers were being assessed and offered vaccinations when necessary as a precaution, a UKHSA spokesperson added.\n\nWhat is rabies?\n\nGetty Images The World Health Organization says 99% of rabies cases in humans were passed on by dogs\n\nRabies is a virus that causes an infection of the brain and nervous system in humans\n\nSymptoms of rabies usually take three to 12 weeks to appear - but they can appear after a few days or not for several months or years\n\nSymptoms include numbness or tingling where you were bitten or scratched, hallucinations, feeling very anxious or energetic, difficulty swallowing or breathing and paralysis\n\nIt is nearly always fatal when symptoms appear, but post-exposure treatment is \"very effective\" at preventing disease if given promptly after exposure to the virus\n\nThe NHS website also advises people to seek medical help immediately if they have been bitten or scratched, or if they have been licked on the eyes, nose, mouth or an open wound by an animal abroad Source: World Health Organization/NHS/UKHSA\n\nMs Thomson added: \"We never thought something like this could happen to someone we love. \"Please take animal bites seriously, vaccinate your pets, and educate those around you.\" Six cases of human rabies connected to animal exposure abroad were reported in the UK between 2000 and 2024. Rabies is particularly common in Asia and Africa, the UKHSA said, with people visiting affected countries advised to avoid contact with dogs, cats and other animals wherever they can. The agency also advised people to seek advice about the need for a rabies vaccine before travel. Jane McNicholas, chief medical officer at Sheffield Teaching Hospitals NHS Foundation Trust, said: \"We can confirm that we provided specialist care for a patient who had contracted rabies whilst abroad and who has now sadly died. \"Our thoughts are with the family at this devastating time and out of respect for their privacy we will not be providing any further information.\""
    },
    {
        "title": "MPs to vote on decriminalising abortion",
        "description": "Two Labour MPs have tabled rival amendments to the Crime and Policing Bill on abortion.",
        "url": "https://www.bbc.com/news/articles/c3rprg8zv18o",
        "source": "BBC News",
        "publishedAt": "2025-06-17T02:30:54Z",
        "full_text": "MPs to vote on decriminalising abortion - how the law could change\n\n17 June 2025 Share Save Share Save\n\nGetty Images\n\nA law change aimed at decriminalising abortion will be debated in the House of Commons on Tuesday. Two Labour MPs, Tonia Antoniazzi and Stella Creasy, have tabled rival amendments to the Crime and Policing Bill. Speaker Sir Lindsay Hoyle could pick one or both amendments to be debated by MPs, but is likely to only pick one to go to a vote. MPs are usually given a free vote on abortion, meaning they do not have to follow any party line on the subject.\n\nWhat does the current law say?\n\nThe current law in England and Wales states that abortion is illegal but allowed up to the first 24 weeks of pregnancy and beyond that in certain circumstances such as if the woman's life is in danger. Abortions have to be approved by two doctors, who check if one of a list of criteria have been met - for example, if the pregnancy poses a risk to the physical or mental health of the woman. Recent law changes have allowed women to access pills to be taken at home to terminate their pregnancies under 10 weeks. In 2022, the most recent data available, 252,122 abortions were reported in England and Wales - the highest number since records began. Abortion providers have reported receiving 100 requests for medical records from police officers in relation to suspected abortion offences in the last five years. Last year, abortion provider MSI told the BBC, it was aware of 60 criminal inquiries in England and Wales since 2018, compared to almost zero before. Six women have appeared in court in England charged with ending or attempting to end their own pregnancy outside abortion law, in the past three years. Dr Jonathan Lord, medical director at MSI, said the organisation believes the \"unprecedented\" number of women being investigated could be linked to the police's increased awareness of the availability of the \"pills by post scheme\".\n\nWhat would Tonia Antoniazzi's amendment do?\n\nTonia Antoniazzi's amendment aims to prevent women from being investigated, arrested, prosecuted or imprisoned for terminating their own pregnancies. She has argued that the investigations are \"dehumanising and prolonged and the women forced to endure them are often extraordinarily vulnerable\". She said those investigated can be victims of domestic abuse and violence, human trafficking and sexual exploitation or women who have given birth prematurely. \"The reality is that no woman wakes up 24 weeks pregnant or more and suddenly decides to end their own pregnancy outside a hospital or clinic. \"But some women, in desperate circumstances, make choices that many of us would struggle to understand. What they need is compassion and care, not the threat of criminal prosecution.\" Her amendment would maintain punishments for medical professionals and violent partners who end a pregnancy outside of the existing law. It has received the backing from 176 MPs and the main abortion providers. The Society for the Protection of Unborn Children has said the amendment is an \"extreme and dangerous proposal\" that would \"effectively decriminalise abortions\".\n\nHow is Stella Creasy's amendment different?"
    },
    {
        "title": "'Masterful' romance novel wins Women's Prize for Fiction",
        "description": "The award's judges say Yael van der Wouden's debut novel The Safekeep is a \"classic in the making\".",
        "url": "https://www.bbc.com/news/articles/c93yz7glw4vo",
        "source": "BBC News",
        "publishedAt": "2025-06-12T19:27:42Z",
        "full_text": "'Masterful' romance novel wins Women's Prize for Fiction\n\n12 June 2025 Share Save Steven McIntosh Entertainment reporter Share Save\n\nGetty Images Yael van der Wouden's novel The Safekeep was also shortlisted for the Booker Prize last year\n\nThis year's Women's Prize for Fiction has been awarded to Dutch author Yael van der Wouden for The Safekeep, a novel about an unlikely romance in the Netherlands in the 1960s. The judges called the book an \"astonishing debut... a masterful blend of history, suspense and historical authenticity\". The story follows a reclusive woman whose brother asks if his girlfriend can move in with her for the summer. Initially repulsed by her new housemate, a closer relationship gradually develops between the two women. The Women's Prize for Non-Fiction, meanwhile, went to Dr Rachel Clarke for The Story of a Heart, an exploration of two families on either side of an organ donation.\n\nThe winners were announced at a ceremony in London on Thursday, and will receive £30,000 each.\n\nAuthor Kit de Waal, chair of judges for the fiction award, described The Safekeep as a \"classic in the making\" which would be \"loved and appreciated for generations to come\". \"Books like this don't come along every day,\" she said. \"Every word is perfectly placed, page after page revealing an aspect of war and the Holocaust that has been, until now, mostly unexplored in fiction. \"It is also a love story with beautifully rendered intimate scenes written with delicacy and compelling eroticism.\"\n\nGetty Images The judges said Dr Rachel Clarke's book about organ donation \"left a deep and long-lasting impression\" on the panel\n\nThe Story of a Heart, which won the non-fiction prize, focuses on two family stories involved in organ donation. It follows the family of a nine-year-old girl named Kiera who dies an a car accident, and a nine-year-old boy, Max, who faces heart failure due to a viral infection. The book depicts the expertise and dedication of the medical staff who look after Kiera in her final hours, and use her organs to offer Max a new life. Kavita Puri, chair of judges for the non-fiction prize, said it had \"left a deep and long-lasting impression\" on the panel. \"Clarke's writing is authoritative, beautiful and compassionate. The research is meticulous, and the storytelling is expertly crafted,\" she said. \"She holds this precious story with great care and tells it with dignity, interweaving the history of transplant surgery seamlessly.\" The book, Dr Clarke's fourth, was adapted into an ITV series in 2024.\n\nWomen's Prize for Fiction shortlist\n\nGood Girl by Aria Aber\n\nAll Fours by Miranda July\n\nThe Persians by Sanam Mahloudji\n\nTell Me Everything by Elizabeth Strout\n\nThe Safekeep by Yael van der Wouden\n\nFundamentally by Nussaibah Younis\n\nWomen's Prize for Non-Fiction shortlist"
    },
    {
        "title": "How Highmark Health and Google Cloud are using Gen AI to streamline medical claims and improve care: 6 key lessons",
        "description": "Success in generative AI isn’t reserved for those with the biggest budgets, but for those with clear plans, flexible platforms, and patience.",
        "url": "https://venturebeat.com/ai/how-highmark-health-and-google-cloud-are-using-gen-ai-to-streamline-medical-claims-and-improve-care-6-key-lessons/",
        "source": "VentureBeat",
        "publishedAt": "2025-06-27T17:24:58Z",
        "full_text": ""
    },
    {
        "title": "Truth about UK nuclear veterans 'covered up', says Andy Burnham",
        "description": "The mayor of Greater Manchester calls on the government to act while the remaining survivors of the UK's 1950s nuclear tests are still alive.",
        "url": "https://www.bbc.com/news/articles/ce9x80g1jgxo",
        "source": "BBC News",
        "publishedAt": "2025-06-25T13:29:05Z",
        "full_text": "Truth about UK nuclear veterans 'covered up', says Andy Burnham\n\n25 June 2025 Share Save Carys Nally and Samuel Kerr BBC Newsnight Share Save\n\nBBC\n\nThe truth about tens of thousands British veterans who tested nuclear bombs has been \"covered up for decades\", the mayor of Greater Manchester has alleged. Andy Burnham told BBC Newsnight the government must act while the remaining survivors are still alive. In the 1950s and 60s, servicemen witnessed dozens of atomic and hydrogen bomb tests and radioactive experiments in Australia and the South Pacific as part of the UK's nuclear programme. Veterans claim the tests caused severe lifelong health problems, and that the government continues to conceal their health records. The Ministry of Defence has promised to \"thoroughly examine\" what information exists regarding veterans' medical tests.\n\nVeterans, along with many others who were exposed, are preparing to launch civil legal action against the MoD to gain access to their own medical records. They say their records are being illegally withheld, and harm was done to them and their families by the MoD's failure to keep, maintain and release them. Survivors allege they have suffered cancers of the liver, bone, bowel, skin and brain, as well as leukaemia, heart disease, stillbirths and generational birth defects as a result of exposure to the nuclear tests. John Morris, 87, worked as a laundry operator \"washing contaminated clothing\" on Christmas Island in the Indian Ocean in the 1950s, and said he witnessed tests of three atomic bombs and one hydrogen bomb. \"If you've seen the film 'Oppenheimer', I sat 20 miles from a nuclear explosion that was a thousand times greater than that explosion,\" he told Newsnight. \"People have reckoned it was like sitting in the centre of the sun,\" he said. \"With a pair of trousers on, a shirt and sunglasses.\" Mr Morris believes the bomb tests caused him to develop pernicious anaemia - an autoimmune condition - and cancer; and caused his first-born son Steven to tragically die in his cot due to birth defects at four months old. John and his wife Betty were initially questioned on suspicion of Steven's murder, before being released without charge. It took John 50 years and a Freedom of Information Act request to produce the coroner's report which suggested their son's lungs may not have formed properly. \"The MoD had the audacity to turn round and say they looked after us to the best of their ability,\" he said. \"I'm sorry MoD, you've an awful lot to answer for.\"\n\nJohn Morris believes the radiation he was exposed to is linked to his baby son's death\n\nFrom 1952 and for the following 15 years, about 39,000 British and Commonwealth servicemen and scientists witnessed 45 atomic and hydrogen bombs, and hundreds of radioactive experiments, in the Australian Outback and Pacific atolls. As well as the military personnel, the tests also allegedly put at risk their children and indigenous communities. \"This is a criminal cover-up on an industrial scale and only Parliament can overturn it,\" said Mr Bunham, who has campaigned on the issue before. He told BBC Newsnight's special programme: \"Why has this one got the firmest of lids on it? I think it is because it goes to the heart of the British state.\"\n\nMirrorpix via Getty Images The UK became the third country to develop and test nuclear weapons in 1952 - here a 1957 hydrogen bomb test is seen from near Kiribati in the Pacific\n\nSteve Purse, whose father David Purse took part in radioactive experiments in 1963, was born with a number of severe disabilities including a form of short stature, as well as curvature of the spine, a respiratory condition and hydrocephalus - a build-up of fluid in the brain. Mr Purse said his father would describe how contaminated sand would blow \"everywhere\", including into bedding, clothing and food, following the tests in Maralinga in South Australia. \"Along come I, a few years later, and in my mind it doesn't take a genius to make a link there and say there has to be something in it. \"My condition has never actually been diagnosed - doctors can't diagnose me so there's something genetically different there. There's something wrong.\"\n\nHis son, aged four, has a condition which results in his teeth crumbling. \"One dentist said he's seen this before in the children who were in the fallout clouds of Chernobyl,\" said Mr Purse. Another veteran, Brian Unthank, who was stationed on Christmas Island, said he lost all his teeth and his first wife suffered 13 miscarriages and their children have suffered various health issues. Mr Unthank said he was never issued any protective clothing during the two hydrogen bomb tests he witnessed. He has had treatment for 92 instances of skin cancers, including another treatment this week.\n\nSteve Purse Steve Purse, from Denbighshire, is unable to walk far without crutches\n\nIn May 2021, the National Radiological Protection Board said it had carried out three large studies of nuclear test veterans and found no valid evidence to link participation in these tests to ill health. The independent studies, commissioned by the MoD, said overall, test participants \"had similar overall levels of aggregated mortality and cancer incidence\" to the control group. It said records indicate that \"relatively few test participants received any measurable radiation dose as a result of the tests\". Veteran's blood and urine samples taken from them as young men at the Cold War weapons trials have been reclassified as \"scientific data\" and placed out of reach at the Atomic Weapons Establishment, an MoD agency. The government said the database where those records are held – known as Merlin – \"has not been declassified\" and \"contains information ranging from unclassified to Top Secret, with the majority being unclassified\". \"Plans are under way to release unclassified records at the National Archives with the appropriate privacy redactions, while classified records are being reviewed for potential publication with necessary security redactions,\" the MoD said in a statement."
    },
    {
        "title": "I've repaired medical equipment for over 30 years. My son is in the field now, and I think it's one of the most promising careers.",
        "description": "Bryant K. Hawkins Sr. found a rewarding career in healthcare technology management. He's helping others consider jobs in biomedical equipment repair.",
        "url": "https://www.businessinsider.com/biomedical-equipment-technician-job-healthcare-career-journey-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-06-11T19:33:32Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThis as-told-to essay is based on a conversation with Bryant K. Hawkins Sr., a site manager for the clinical asset management company Trimedx and the founder of Elevate HTM, a nonprofit elevating awareness of healthcare technology management careers. The following has been edited for length and clarity.\n\nI stumbled into a career in healthcare technology management over 30 years ago, and I'm so glad I did.\n\nWhen I graduated from high school in 1990, I had no clue what I wanted to do. So I opened the local college catalog, closed my eyes, and said whatever I touch is what I'm taking. I landed on biomedical equipment technology and haven't looked back.\n\nAfter getting my associate degree, I immediately found a job at a local hospital as a biomedical equipment technician. When I started repairing dialysis machines a few years later and realized these machines were keeping people alive, the sense of purpose in my career path really clicked.\n\nHe finds his job fulfilling because he helps repair and manage equipment that can save lives. Annie Flanagan for BI\n\nAfter 11 years as a technician, I shifted into a leadership role and have been a site manager at various organizations for the past 20 years. While most of my days are filled with meetings now, I still find fulfillment in knowing that my team is saving lives with the equipment.\n\nI work at a children's hospital now, and when I see a kid walking around with an IV pole, it makes me feel good knowing that they're able to walk around and get some sunlight because we make sure the poles' attached pumps work correctly. That's one of the beautiful things about what we do that I don't think people really understand. We don't have to deal with blood. We don't have to deal with patients. But we still get to contribute to bettering that patient's life.\n\nI encouraged my son to follow in my footsteps — and it's been the highlight of my career\n\nI believe in this career path so much that when my son graduated from high school in 2020, during the height of the COVID-19 pandemic and without a clear path, I encouraged him to try the online program with the College of Biomedical Equipment Technology.\n\nSixteen months later, he had an associate degree and numerous job offers, including one from the company I work for. I got to be the one to tell him he got the job with us, and we both cried out of excitement. That moment beat every accolade I'd ever received in my own career.\n\nHe encouraged his son to pursue a career in HTM, and they briefly worked for the same company. Courtesy of Bryant K. Hawkins Sr.\n\nHe's been working the job for three years now and isn't interested in doing anything else. While he had to incur some debt to get his degree, he immediately started earning an annual salary that was three times what his tuition was, which you don't see with most colleges. He's been able to support himself on his own since he graduated — this really is an industry that allows you to take care of yourself.\n\nThe opportunities for BMETs are vast — the biggest challenge is awareness\n\nWhen I first started in the healthcare technology management industry, it was a little more challenging to find jobs. Today, the sky's the limit. There's a demand in every aspect of the industry and so much opportunity for growth. You can work in hospitals, for medical equipment manufacturers, on cruise ships, or as a traveling tech. You can be steady and stay put, or be adventurous and work across the country in a traveling biomedical equipment technician role.\n\nYou can get started with a certificate, an associate degree, or a bachelor's degree. There are even apprentice programs where you can get on-the-job training — a lot of technicians are coming into the industry that way.\n\nThe biggest challenge is that most people don't know about this industry. A lot of older BMETs are retiring, and not enough new people are entering to fill the gap. That's why I'm passionate about bringing awareness to this industry, which I do through speaking engagements and my podcast.\n\nHe said there are a lot of opportunities for BMETs, and he tries to bring more awareness to them. Annie Flanagan for BI\n\nI especially love introducing this field to kids, and I even wrote a children's book to get HTM careers on their radar. When I talk at schools, I tell kids, \"What you're about to hear about today you probably never knew existed. And when you leave, you're going to have something in your pocket that can probably change your life.\" I think that's true for everybody who reads this and considers the BMET career path.\n\nCorrection: June 11, 2025 — An earlier version of this story misstated when Bryant K. Hawkins Sr. and his son worked at the same company. They briefly worked for the same company earlier in their careers, but do not work for the same company in 2025."
    },
    {
        "title": "Million-Dollar Project Aims to Expose Bad Medical Research",
        "description": "Armed with funding, algorithms, and a tip line, this new effort aims to dig corrupt studies out of medical literature before they do real-world harm.",
        "url": "https://gizmodo.com/these-researchers-are-launching-a-million-dollar-project-to-hunt-down-medical-misinformation-2000611025",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-07T14:00:21Z",
        "full_text": ""
    },
    {
        "title": "AI isn't replacing radiologists. Instead, they're using it to tackle time-sucking administrative tasks.",
        "description": "While clinical applications exist,  radiologists are using AI to increase productivity, and to help them communicate effectively with patients.",
        "url": "https://www.businessinsider.com/radiology-embraces-generative-ai-to-streamline-productivity-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-05T18:33:24Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nGenerative AI powered by large language models, such as ChatGPT, is proliferating in industries like customer service and creative content production. But healthcare has moved more cautiously.\n\nRadiology, a specialty centered on analyzing digital images and recognizing patterns, is emerging as a frontrunner for adopting new AI techniques.\n\nThat's not to say AI is new to radiology. Radiology was subject to one of the most infamous AI predictions when Nobel Prize winner Geoffrey Hinton said, in 2016, that \"people should stop training radiologists now.\"\n\nBut nearly a decade later, the field's AI transformation is taking a markedly different path. Radiologists aren't being replaced, but are integrating generative AI into their workflows to tackle labor-intensive tasks that don't require clinical expertise.\n\n\"Rather than being worried about AI, radiologists are hoping AI can help with workforce challenges,\" explained Dr. Curt Langlotz, the senior associate vice provost for research and professor of radiology at Stanford.\n\nRegulatory challenges to generative AI in radiology\n\nHinton's notion wasn't entirely off-base. Many radiologists now have access to predictive AI models that classify images or highlight potential abnormalities. Langlotz said the rise of these tools \"created an industry\" of more than 100 companies that focus on AI for medical imaging.\n\nThe FDA lists over 1,000 AI/ML-enabled medical devices, which can include algorithms and software, a majority of which were designed for radiology. However, the approved devices are based on more traditional machine learning techniques, not on generative AI.\n\nAnkur Sharma, the head of medical affairs for medical devices and radiology at Bayer, explained that AI tools used for radiology are categorized within computer-aided detection software, which helps analyze and interpret medical images. Examples include triage, detection, and characterization. Each tool must meet regulatory standards, which include studies to determine detection accuracy and false positive rate, among other metrics. This is especially challenging for generative AI technologies, which are newer and less well understood.\n\nCharacterization tools, which analyze specific abnormalities and suggest what they might be, face the highest regulatory standards, as both false positives and negatives carry risks. The idea of a kind of gen AI radiologist capable of automated diagnosis, as Hinton envisioned, would be categorized as \"characterization\" and would have to meet a high standard of evidence.\n\nRegulation isn't the only hurdle generative AI must leap to see broader use in radiology, either.\n\nToday's best general-purpose large language models, like OpenAI's GPT4.1, are trained on trillions of tokens of data. Scaling the model in this way has led to superb results, as new LLMs consistently beat older models.\n\nTraining a generative AI model for radiology at this scale is difficult, however, because the volume of training data available is much smaller. Medical organizations also lack access to compute resources sufficient to build models at the scale of the largest large language models, which cost hundreds of millions to train.\n\n\"The size of the training data used to train the largest text or language model inside medicine, versus outside medicine, shows a one-hundred-times difference,\" said Langlotz. The largest LLMs train on databases that scrape nearly the entire internet; medical models are limited to whatever images and data an institution has access to.\n\nGenerative AI's current reality in radiology\n\nThese regulatory obstacles would seem to cast doubt on generative AI's usefulness in radiology, particularly in making diagnostic decisions. However, radiologists are finding the technology helpful in their workflows, as it can undertake some of their daily labor-intensive administrative tasks.\n\nFor instance, Sharma said, some tools can take notes as radiologists dictate their observations of medical images, which helps with writing reports. Some large language models, he added, are \"taking those reports and translating them into more patient-friendly language.\"\n\nDr. Langlotz said a product that drafts reports can give radiologists a \"substantial productivity advantage.\" He compared it to having resident trainees who draft reports for review, a resource that's often available in academic settings, but less so in radiology practices, such as a hospital's radiology department.\n\nSharma said that generative AI could help radiologists by automating and streamlining reporting, follow-up management, and patient communication, giving radiologists time to focus more on their \"reading expertise,\" which includes image interpretation and diagnosis of complex cases.\n\nFor example, in June 2024, Bayer and Rad AI announced a collaboration to integrate generative AI reporting solutions into Bayer's Calantic Digital Solution Platform, a cloud-hosted platform for deploying AI tools in clinical settings. The collaboration aims to use Rad AI's technology to help radiologists create reports more efficiently. For example, RadAI can use generative AI transcription to generate written reports based on a radiologist's dictated findings. Applications like this face fewer regulatory hurdles because they don't directly influence diagnosis.\n\nLooking ahead, Dr. Langlotz said he foresees even greater AI adoption in the near future. \"I think there will be a change in radiologists' day-to-day work in five years,\" he predicted."
    },
    {
        "title": "OSHWA Healthware Highlight: OpenNerve",
        "description": "OpenNerve could be the community-driven solution to vagus nerve therapy.\nThe post OSHWA Healthware Highlight: OpenNerve appeared first on Make: DIY Projects and Ideas for Makers.",
        "url": "https://makezine.com/article/technology/oshwa-healthware-highlight-opennerve/",
        "source": "Makezine.com",
        "publishedAt": "2025-07-02T16:00:00Z",
        "full_text": "This piece is part of a highlight series on OSHWA.org.\n\nWe started this series by looking at COSMIIC and you cannot talk about them without mentioning their sister project, OpenNerve developed by the Center for Autonomic Nerve Recording and Stimulation Systems (CARRS). OpenNerve is the other project supported by the National Institute of Health, the US-based government organization that funds medical research. Both projects were selected as part of the SPARC grant that was looking to explore bringing open source into medical care, especially with implantable devices.\n\nAs we noted in the COSMIIC Healthware Highlight there are multiple classes to medical devices, and many open source devices sit in Class 1. OpenNerve is another exception to this rule, and are using their funding support from the NIH to develop a Class 3 implant for therapies involving neuromodulation.\n\nOpenNerve was developed to be placed in the body to work with the vagus nerve. This nerve comes down on both sides of the neck and controls all of the organs, such as your heartbeat, pancreas, liver, etc., and by interfacing with this nerve we can adjust those organ activities. This idea can also be utilized for the sacral nerves that affect your bowel and bladder activity, or other peripheral nerves like the phrenic nerve, which controls the diaphragm and breathing, or nerves near the throat which control tongue movement and swallowing.\n\nNeuromodulation of these nerves using OpenNerve could treat many different diseases, from heart disease to sleep apnea. One group of people who may see significant benefit are those with paralysis due to spinal cord injury.\n\n“If you look into it and talk to these patients, walking is not always the highest priority for somebody with a spinal injury,” notes Dr. Alex Baldwin, Director of Technology Integration and Dissemination at CARSS. “What they prioritize is to be able to use the bathroom in a dignified way. Bladder, bowel and sexual function are much more important to them.”\n\nWith this technology in development there could be some significant advances for people who have nerve damage, an area that is not extraordinarily funded because it’s not often seen as profitable.\n\nThe medical industry is complicated in many ways, especially in the context of access. We have simultaneously some of the strongest healthcare in the history of humankind as well as enormous issues with having access to said care. Through the expansion of Open Healthware and an accompanying certification procedure we can try to bridge some of these gaps by providing reassurance that these devices have transparency to the source, effective reproducibility, and allow for a level of user freedom that is invaluable.\n\nOpenNerve is one of the first Class 3 implantable devices developed to be open source from the very beginning.\n\n“Before the center existed, before I worked here, the NIH said, ‘we want you to make this system, but it has to be open source, and all the data has to be released to the community,’” Baldwin said.\n\nMany scientists seek ways to create more flexible systems that can get products to patients faster but are hit with the roadblocks of production and fighting through the regulatory requirements. When a device is developed as open source from the beginning other groups can take advantage of the regulations already being met and see what ways they can adjust to meet their needs.\n\n“It was important for us that we have our core system open forever. Everything we’re building will be out there as open source. We’re not going to get rid of any of the resources we put out,” Baldwin notes. “Other groups will probably take our device and heavily modify it, making their own proprietary device. And we’re very happy with that because that sort of community adoption and modification is what’s necessary to help treat many different patients.”\n\nThe device has already resonated with other groups doing research who are working on taking the core system and doing minor modifications to meet their own needs looking at different diseases or medical situations.\n\n“I believe that having these designs publicly available will have a huge impact on translating therapies from academic labs to the clinic, and I think we’re having an effect on how the neuromodulation field as a whole sees these types of therapy platforms,” Baldwin said.\n\nBaldwin has previously worked for a startup as a hardware engineer and noted that had there been a set of validated design documents for an implantable neuromodulation device to use as a template, that they knew worked and complied with all regulatory requirements for human use, it would have been an absolute game changer.\n\n“I saw firsthand how an open source hardware implant like this would have helped my own work and accelerated our hardware development. I knew this was a problem that many other companies, especially academic spin-out startups, are facing,” Baldwin said.\n\nThe institutional knowledge being created in OpenNerve is so important to see more development of open source medical devices. Their experience bringing a device from research to market with the continued commitment to honour openness is going to help many more open source healthware devices make it to their end users.\n\n“We hope that by releasing everything we do as open source that we can enable more people to participate in this project. And maybe this will lower the barrier to developing new therapies and reaching patients in need,” Baldwin said.\n\nThere’s bound to be exciting progress in this area as more groups get involved and begin finding more ways to use this technology in new ways for different patient needs. We are certainly excited to see further work from them and their partner groups as they bring OpenNerve to the forefront of neuromodulation therapy development."
    },
    {
        "title": "'Commercialising concussion': The Australians taking a backyard collision game global",
        "description": "As hype over the game grows, so do concerns about the potential for brain injuries.",
        "url": "https://www.bbc.com/news/articles/cedg05z18z7o",
        "source": "BBC News",
        "publishedAt": "2025-06-27T22:31:19Z",
        "full_text": "'Commercialising concussion': The Australians taking a backyard collision game global\n\n27 June 2025 Share Save Lana Lam and Tiffanie Turnbull BBC News, Sydney Share Save\n\nWatch: People compete in Auckland RUNIT championship league event\n\n\"Defender ready?\" calls the host. A thumbs up and moments later, two burly men - with no protective gear - run full speed at each other before they clash, the unmistakable sound of flesh and bone crunching. The crowd erupts into a collective roar, some cheering, others wincing. This is the moment they've been waiting for - and it's exactly this adrenaline-fuelled energy that organisers of the Run It Championship League are banking on to help bring what they call the \"world's fiercest, new collision sport\" to global audiences. It is a supercharged version of a one-on-one tackle game which originated in the backyards and school playgrounds of Australia and New Zealand - namely in Pacific Islander communities. One person carrying a ball must \"run it straight\" at the defender, who is also sprinting towards them: they are not allowed to duck, hurdle or sidestep the tackler. Videos of the game have recently gone viral, and the founders of the Run It league have capitalised on the surge of interest - they say they've gained millions of views online, won over thousands of fans, attracted big name sponsors, and even inspired rival competitions. They've held jousts in Melbourne and Auckland, and on Saturday another will take place in a Dubai arena, the winner taking away prize money of A$200,000 (£98,000). Next on their agenda, is an expansion to the UK and US. But the groundswell of support for the league is increasingly being rivalled by critical voices. Medical experts and sporting figures are worried about the physical and mental health impacts of the game - which has also become a wider social media craze, that is already accused of claiming one life. \"It's like shaking a baby,\" says Peter Satterthwaite, whose teenage nephew died after copying the game at a party.\n\nFrom the schoolyard to the world stage\n\nLuis Enrique Ascui/THE AGE/SMH The Run It Straight founders played the game growing up in Melbourne\n\nThe objective of the game is simple: be the person who \"dominates\" the contact, as deemed by a panel of three judges. Two of the league's seven co-founders, Brandon Taua'a and Stephen Hancock, tell the BBC they have fond memories of playing the game as teenagers in Melbourne. \"I used to 'run it straight' at Brandon all the time,\" Hancock says, joking that the pair would usually try to avoid hitting each other straight on. There'll be none of that this weekend, when the eight finalists compete for that giant cash prize in United Arab Emirates. Hancock insists Run It is a \"game of skill\" - \"[It's] all about the footwork\" - but there's no denying the violent nature of it. A quick scroll of the league's social media accounts shows dozens of quick-burst videos, all honing in on the explosive action of two men colliding. In other videos circulating from the events, several competitors are knocked out and require immediate medical attention. Taua'a acknowledges the sport comes with risks, but says the league has safety protocols to minimise them. Competitors are screened, undergoing medical assessments – such as blood tests and a physical exam – and they must also send a recent video of themselves playing a sport that features tackling. Medical staff are also on the sidelines of the events. \"There's an element of danger with surfing, with boxing, and many other sports as well,\" Taua'a argues. For Champ Betham - who won NZ$20,000 earlier this month at the competition in Auckland and is gunning for the title in Dubai on Saturday – the element of danger is a secondary consideration. \"This is a massive blessing to a whole heap of us to pretty much try and win 20K or whatever for a couple hours' work,\" he told Radio New Zealand at the time. \"We got to pay off some debts and stock up the fridges and the cupboards, food for our little ones, especially with the economy and stuff like that here in New Zealand. Nothing's cheap these days.\"\n\nGetty Images Warriors halfback Chanel Harris-Tavita is one of the rugby players promoting Run It\n\nThe money involved, for a league which has only been around for six months, is impressive. Along with the prize fund, competitors' travel and accommodation expenses are being paid. A 1,600-seat arena has been booked. The league has a slick social media account, a PR representative, and a bunch of promoters - including antipodean sports stars. Its initial financial backers have been described only as \"a group of local investors who believe in the product\", but bigger names are emerging: days before the Dubai event, the league announced it had secured a major sponsor in online gambling platform Stake.com, which is banned in key markets like Australia and the UK. There are also ongoing talks with potential US investors, including a contact linked to American podcaster and UFC heavyweight Joe Rogan, which Taua'a says \"will definitely help\" the league build a presence in the US. They will need big backers to match their ambitions for the contest, which they argue is more than just a fleeting social media trend. \"This could actually eventuate into a sport that could sit [in a class] with MMA and boxing,\" Hancock says.\n\n'An innocuous clash'\n\nBut as Taua'a and Hancock focus on the competition's future ambitions, more and more voices are questioning its safety. \"They might as well set up smoking as a legitimate sport,\" says neuroscientist Alan Pearce. Speaking to the BBC from the New Zealand city of Palmerston North, Peter Satterthwaite is unequivocal. \"It's not a sport,\" he says. It's \"a dangerous activity\" designed purely \"to hurt the guy in front of you\". His 19-year-old nephew Ryan was celebrating a 21st birthday with friends at a local park when they decided to try the game they'd seen all over their social media feeds. Ryan did two tackles. Neither he or his friend fell down or clashed heads. But as he walked away, he told his mates he didn't feel well, his uncle recounts. \"[Ryan] was coherent for a bit, then he lay down and his eyes just rolled back in his head.\"\n\nPete Satterthwaite Ryan Satterthwaite, 19, was the youngest of three brothers who all grew up playing rugby\n\nFriends rushed him to hospital where doctors had to \"cut a sizable chunk out of his skull\" to alleviate pressure caused by brain swelling, Satterthwaite says. \"I saw him on the ventilator, his chest going up and down as he was breathing, and it was like 'Get up! Open your eyes'.\" On Monday evening, just a day after he was playing with his mates, Ryan's life support was turned off in a hospital room filled with loved ones. \"It was just an innocuous clash,\" Ryan's uncle says, \"and it just shows you how fragile life is and how fragile your brain is.\" Run It says it understands the dangers of contact sports and takes safety seriously. Weeks after Ryan's death, the league posted a video saying the game is \"not for the backyard, not for the street\". \"Do not try this at home,\" they said. But Satterthwaite doubts that warning will have much impact. \"I don't think there's a sport in the world that people don't do at the beach, or in their backyard, or at the park.\" It's not just the physical impacts that worry Shenei Penaia.\n\nShenei Penaia Mental health worker Shenei Penaia says she used to see versions of 'run it straight' tackles during her school years\n\nAs a Samoan growing up in Australia, she would often see schoolkids playing the game as a bit of fun. But the mental health worker fears it reinforces \"a version of masculinity where silence is strength, and violence is proof of pride\". \"It sends a dangerous message to young men that their worth is based on how much pain they can take. That if you're not tough, you don't belong.\" And the league's attempt to turn this into a lucrative spectator sport contradicts the values of many in the Pacific Islander community, Penaia says. \"We are taught to look out for one another... and to make decisions that serve more than just ourselves.\"\n\n'Blood in the air'\n\nTheir concerns are echoed by a pack of concussion experts and sporting figures. For more than a decade, the world of high-impact sports has been introducing safety measures as the research into brain injuries develops. Official bodies including Rugby Australia, New Zealand Rugby have warned people not to take part, with the New Zealand Prime Minister also weighing in, saying it's a \"dumb thing to do\".\n\nRUNIT The Run It finale will take place on Saturday in Dubai"
    },
    {
        "title": "I paid £15,000 for arranging IVF – then the service went bust",
        "description": "Companies that act as \"middlemen\" between patients and doctors are not regulated by the fertility watchdog.",
        "url": "https://www.bbc.com/news/articles/cm2eyzndlvvo",
        "source": "BBC News",
        "publishedAt": "2025-06-25T04:33:25Z",
        "full_text": "I lost £15,000 after going to an IVF middleman\n\n25 June 2025 Share Save Emer Moreau Business reporter, BBC News Share Save\n\nSyreeta Sandhu Syreeta Sandhu has spent £15,000 on IVF\n\nIVF patients are being warned over unregulated \"concierge clinics\" after a popular one went bust leaving scores of clients without treatment or refunds. As the number of privately funded IVF cycles has risen, online concierge companies have emerged, acting as \"middlemen\" between patients, donors and doctors. The fertility watchdog has said that as these clinics do not provide IVF treatment directly, it does not have powers to regulate them. It is calling for the law to be strengthened to protect patients. Syreeta Sandhu lost nearly £15,000 when her concierge clinic went bust. \"You're on your knees,\" she said. \"Upset has turned to frustration and anger.\"\n\nThe 40-year-old mother-of-two contacted online firm Apricity Fertility after four failed rounds of IVF and five miscarriages, in the hope of having a third child. She paid Apricity, which matched her with an egg donor and contracted established clinic King's Fertility. She was due to start treatment in December last year when her appointments were cancelled without explanation. Syreeta found out via the company's app that it was ceasing operations on 1 January. When she contacted King's, the clinic said data protection rules meant it did not have access to her file or details of her egg donor. It had not been paid by Apricity so her treatment could not begin. \"When you're on this journey, every month counts. You'll do anything, and you do throw lots of money at it,\" she said. \"It takes a long time to meet [medical staff] you can trust,\" she said. \"I spent almost 12 months building that trust and it just dropped off.\"\n\nConcierge clinics offer services like matching patients with donors and doctors, booking appointments and posting medication. It is not clear how many there are operating in the UK but experts believe their number is growing. Satellite arrangements – where patients attend medical appointments with one doctor, usually their own GP, and then undergo the IVF process elsewhere – is an established set-up in fertility care. But concierge clinics don't have physical premises or store eggs, sperm or embryos themselves. The fertility watchdog, the Human Fertilisation and Embryology Authority (HFEA), is warning patients that these new services are not covered by its protections. Clare Ettinghausen, director of strategy and corporate affairs at the HFEA, said: \"The fallout from Apricity's closure and the effect it had on patients highlights how the current law does not reflect the range and type of fertility treatments being offered today.\" She said the watchdog was calling for the Human Fertilisation and Embryology Act to be revised to take account of the different ways fertility services are provided. Syreeta is one of 52 patients owed money by Apricity. The company owes a total of £119,000 to its patients, according to the liquidator appointed to manage its debts, Cork Gully.\n\n'There was no communication'\n\nBeth Rodgers Beth Rodgers has a rare condition which means her ovaries don't produce eggs\n\nBeth Rodgers, 32, from Belfast has Turner syndrome, a rare genetic condition that means her ovaries do not produce eggs. Because Northern Ireland has a severe shortage of donor eggs, Beth had to secure a donor in England. She and her partner paid Apricity £4,600 and had been matched with an egg donor. \"Then I saw a comment on a Facebook group saying 'thinking of everyone affected by the Apricity news,'\" she said. \"There was no communication, no number to call.\" The couple were able to claim some of the money back on their insurance but it did not cover a £385 fee for a doctor's appointment and £985 for donor compensation. \"Time was probably the biggest thing I felt I lost. It was such a long process,\" said Beth. She has now restarted treatment with a regulated clinic. She has had appointments with a doctor in the Republic of Ireland and travelled to Manchester for the embryo transfer. That transfer was unsuccessful but she will be able to get another round of IVF on her insurance with a different egg donor.\n\n'No realistic chance of a refund'\n\nIn recent years, more British couples have paid for private fertility treatment, in part because IVF on the NHS is a postcode lottery. Jonathan, not his real name, and his wife went through five failed rounds of IVF before they went to Apricity. They paid £10,000 for treatment with their savings and a loan. \"We've been told there's no realistic chance of getting our money back,\" he said. \"We haven't been able to resume treatment yet as we're still trying to raise finance.\" Cork Gully told Jonathan and other patients in a letter seen by the BBC: \"It is unlikely that there will be funds to pay to patients.\" It said any affected patients should get in touch.\n\nThe BBC asked Mel Chacksfield, who was chief executive of Apricity when it ceased operations, why the business had gone under and if patients would be refunded but she did not respond to our request. However, Caroline Noublanche, one of the company's founders and the previous chief executive, told the BBC it had \"faced sudden and irreversible financial difficulties in December when planned investment from an investor was withdrawn\".\n\nClinics falling into regulatory gap\n\nProf Emily Jackson is a researcher in medical law and ethics at the London School of Economics. She said: \"You need a licence to do things with embryos and sperm and eggs but you don't need any licence to offer to arrange things on the internet. \"For people thinking about their options, it is probably sensible to opt for treatment in an HFEA-licensed clinic, because they have responsibilities towards patients in the event of closure.\" Those responsibilities mean that if an HFEA-licensed clinic closes, it has to give patients information and ensure they are supported. The clinic must also ensure all eggs, sperm and embryos that are in storage are kept safe.\n\nGetty Images IVF clinics need a special licence to store and fertilise eggs and sperm\n\nA spokesperson for the Department of Health and Social Care told BBC News: \"While digital or 'virtual' clinics do not currently fall within the remit of the Human Fertilisation and Embryology Authority, ministers have met with its chair to discuss the emerging regulatory challenges. \"The government is currently considering the HFEA's recommendations on modernising fertility law. We would advise all those looking at using digital clinics to carry out thorough research before making any decisions.\"\n\nKing's Fertility, which was providing Syreeta's treatment, was a contractor of Apricity's and is now a creditor of the company. Its director, Dr Ippokratis Sarris, a consultant in reproductive medicine, said it was likely more concierge clinics would emerge in the future as patients look for convenience and flexibility. \"The shift toward more remote and digital models of care is an inevitable progression in today's world. This is increasingly what patients want, and often prefer, so it's important that we don't deny them that choice.\" But he advised patients to do careful research before choosing a provider, and to be cautious about paying upfront for multi-cycle packages. \"It's wise to look into how long a clinic has been established, who owns it (NHS, private individual, or private equity), and make an informed choice,\" he added. \"We shouldn't resist change, but we do need to be proactive in shaping it responsibly.\""
    },
    {
        "title": "DJI Portable Power Station Gets 55% Off as Part of Amazon’s Surprise Early Deals, Limited Time Only",
        "description": "Save hundreds and feel confident that no matter what happens, you'll still have electricity.",
        "url": "https://gizmodo.com/dji-portable-power-station-gets-55-off-as-part-of-amazons-surprise-early-deals-limited-time-only-2000617516",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-18T21:40:34Z",
        "full_text": ""
    },
    {
        "title": "Trump’s ‘Big Beautiful Bill’ Will Literally Kill, Study Warns",
        "description": "Millions of Americans are expected to lose their Medicaid coverage under the current version of the bill, and many will suffer or die as a result, a new analysis shows.",
        "url": "https://gizmodo.com/trumps-big-beautiful-bill-will-literally-kill-study-warns-2000616454",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-16T21:00:44Z",
        "full_text": ""
    },
    {
        "title": "1500W Portable Power Station Is Cheaper Than on Black Friday, And You’ll Get a Free 200W Solar Panel Too",
        "description": "It’s the perfect companion for your van adventures or camping trips this summer.",
        "url": "https://gizmodo.com/1500w-portable-power-station-is-cheaper-than-on-black-friday-and-youll-get-a-free-200w-solar-panel-too-2000621824",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-29T11:40:03Z",
        "full_text": ""
    },
    {
        "title": "Use a lot of words",
        "description": "Verbosity is the new brevity. Google felt like a miracle. We could type just a word or two (“blog“) and it would magically guess what we wanted and take us there. This shortcut spread from Google to the search built into online shopping as well. How convenien…",
        "url": "https://seths.blog/2025/06/use-a-lot-of-words/",
        "source": "Seths.blog",
        "publishedAt": "2025-06-26T09:03:00Z",
        "full_text": "Verbosity is the new brevity.\n\nGoogle felt like a miracle. We could type just a word or two (“blog“) and it would magically guess what we wanted and take us there.\n\nThis shortcut spread from Google to the search built into online shopping as well. How convenient. A few words and done.\n\nAI isn’t like that. In fact, our concision is getting in the way of the insight we’re looking for.\n\nGo to Etsy and search for “white pants” and you’ll get more than 10,000 matches, most of them useless. Instead, type “white pants to wear to a wedding in July in lower michigan for a 30 year old woman” and you’ll get this.\n\nAI systems like Claude and ChatGPT let you attach a PDF or text file to your query. Here’s the useful hack:\n\nCreate a document that has pages of background.\n\nYour medical history for example. Include your age and every interaction you’ve had with the medical system, including illnesses and drugs and outcomes. Now, every time you ask a health question, attach the document.\n\nOr, a copy of your resume, work history, letters of recommendation and career goals, all in a PDF. Upload it every time you’re asking for career advice.\n\nIt works for business plans, for customer lists and even legal documents. Upload an entire email correspondence, or a fifty page wine list.\n\nAI isn’t impatient, easily bored or distracted.\n\nIt’s insatiable.\n\nPS chat GPT knows a shocking amount about you, while Claude starts over every time. Neither promises airtight security, but then again, neither does American Express, Visa or Google…"
    },
    {
        "title": "AirPods Pro 2 Are Back at Their Lowest Price as Apple Clears Out Limited Stock on Amazon",
        "description": "Enhanced noise cancellation and personalized spatial audio make these Apple's best AirPods yet, and they're $80 off while this Amazon deal is live.",
        "url": "https://gizmodo.com/airpods-pro-2-are-back-at-their-lowest-price-as-apple-clears-out-limited-stock-on-amazon-2000617233",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-18T12:10:04Z",
        "full_text": ""
    }
]