[
    {
        "title": "Plantaform Smart Indoor Garden Review: Rewarding but Risky",
        "description": "We tested this unique indoor gardening solution that utilizes NASA technology, but air quality data raised concerns.",
        "url": "https://www.wired.com/review/plantaform-smart-indoor-garden/",
        "source": "Wired",
        "publishedAt": "2025-06-27T05:46:47Z",
        "full_text": "It was about a week into my journey as a hydroponic lettuce farmer when I noticed my Mila air purifier, set to auto mode, was running at full blast. Its internal air quality sensor told me the air was dirty. Not sure if the sensor was overly sensitive, I swapped it out for the more powerful and far quieter IQ Air Atem X (9/10 WIRED Recommends) and set it on auto mode. Next time I went into my son’s room, the Atem was running at its highest speed. I checked the room’s IQAir Visual Pro Indoor Air Quality Monitor and noticed it was reading a higher-than-usual PM 2.5. For context, my sons’ room’s air quality index is usually in the teens or below, and that’s with my air purifiers running at their lowest, almost inaudible, setting.\n\nIt was at this point that I moved several other air quality monitors into my sons’ room. I noticed that there was a smaller uptick in PM 2.5 in other areas of my apartment as well. I took screenshots of my air monitor’s dashboard graphs and noticed that when the Plantaform’s grow lights were turned off from 10 pm to 8 am, the air quality improved. This happened every night, and I could see it on the various graphs from my consumer air quality monitors. I don’t pretend to be Berkeley Lab, but I’ve been covering air quality long enough to watch for patterns. I knew that Plantaform was using its fogponics system.\n\nI had seen Plantaform’s cofounder and CEO, Alberto Aguilar, claiming, “NASA tech is going to revolutionize your kitchens … using NASA’s fogponic technology … ” on Canada’s equivalent of Shark Tank, known as Dragons’ Den. I was naive and hadn’t considered how a hydroponics system could impact my indoor air. I began to wonder if the monitors were picking up increased moisture. I’ve tested humidifiers in the past that impacted indoor air quality—maybe it was moisture.\n\nI reached out to Plantaform to ask how their system impacts indoor air quality. They emailed back to say it might be because my air quality monitor was too close to the Plantaform, or the fogponics was impacting the humidity. Most of my indoor air quality monitors also measure humidity, and they were showing fairly constant levels of humidity. It did not mirror what was happening with the PM 2.5. The company also confirmed that the foggers continue to run at a reduced level during the night cycle.\n\nCourtesy of Lisa Wood Shapiro Courtesy of Lisa Wood Shapiro Courtesy of Lisa Wood Shapiro\n\nI still couldn’t control my indoor air quality. And if I unplugged my IQAir Atem air purifier, the indoor air quality shot up above 150. For context, the NCAA will consider rescheduling events if the air quality index rises above 200. It was around this time that I remembered the included powder plant nutrients I scooped into the water. Plantaform’s own container lists it as fertilizer in the fine print. Their own warning label says, “If inhaled, move person to fresh air. If inhalation occurs or persists, get medical attention.” I looked up each ingredient. Soluble potash, boron, and fer are a few that can lead to health issues when inhaled.\n\nI began to look at my growing lettuce with worry. I opened the window in the bedroom and was glad my boys were off at college. During the past two weeks of growing, I had developed my annual chest cold and asthma, though the hypochondriac in me worried that my giant egg growing lettuce might not be helping. I’m sure I sounded crazy when I mentioned the hydroponic lettuce egg to my primary care provider, who assured me that it seemed like my usual upper respiratory infection.\n\nHealth Concerns\n\nI shut the boys’ bedroom door and found myself looking into some of the health risks of those exposed to indoor hydroponic growing systems, like childhood hypersensitivity pneumonitis (HP) or extrinsic allergic alveolitis—\"farmer’s lung,\" or “pigeon breeder’s lung.” In reading the above linked study about a 14-year-old girl who developed HP due to an indoor hydroponic system, it was noted that they tested a water sample from the hydroponic system and found that Aureobasidium pullulans was the dominant fungal microorganism.\n\nWhen I emailed Plantaform and asked if there was a water filter in the tank, they wrote back, “Plantaform does not include a built-in water filter, so the device uses the exact water you pour in to generate the fog that nourishes your plants.”"
    },
    {
        "title": "After Slashing Thousands of Jobs, Trump’s FDA Wants to Use AI to Rapidly Approve New Drugs",
        "description": "Will more technology make America healthier?",
        "url": "https://gizmodo.com/after-slashing-thousands-of-jobs-trumps-fda-wants-to-use-ai-to-approve-new-drugs-more-quickly-2000614144",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-11T14:55:58Z",
        "full_text": ""
    },
    {
        "title": "Physicists Solve a 50-Year Mystery About a Critically Important Molecule",
        "description": "The discovery itself is simple and fundamental, but the applications stretch far and wide into astrophysics and quantum technology, the researchers say",
        "url": "https://gizmodo.com/physicists-solve-a-50-year-mystery-about-a-critically-important-molecule-2000623370",
        "source": "Gizmodo.com",
        "publishedAt": "2025-07-02T16:20:54Z",
        "full_text": ""
    },
    {
        "title": "Police must 'do their bit' on funding, minister warns",
        "description": "Science and Technology Secretary Peter Kyle says police should \"embrace change\" as talks over funding continue.",
        "url": "https://www.bbc.com/news/articles/cx2edggr805o",
        "source": "BBC News",
        "publishedAt": "2025-06-08T11:58:29Z",
        "full_text": "Police must 'do their bit' on funding, minister warns\n\n8 June 2025 Share Save Kate Whannel Political reporter Share Save\n\nBBC\n\nThe science and technology secretary has urged police to \"do their bit\" to \"embrace change\" as the Home Office and the Treasury continue negotiations over this week's Spending Review. Peter Kyle told the BBC's Sunday with Laura Kuenssberg that \"every part of society was struggling\" and the chancellor was facing pressure from all sectors including doctors and universities to increase funding. He said the review would boost spending for schools and scientific research but declined to rule out a squeeze on policing. Conservative Chris Philp, the shadow home secretary, said he was concerned about police numbers being cut and urged the government to protect their budget.\n\nChancellor Rachel Reeves will set out on Wednesday how much money each government department will get to spend for the next three to four years. Earlier this week Reeves warned not every government department would \"get everything they want\" and said there were \"good things I've had to say no to\".\n\nThe BBC has been told that Home Office ministers do not believe there is enough money to recruit the additional police officers Labour promised in its manifesto. Asked about police funding, Kyle said the government had already provided an additional £1bn to the police. \"We are delivering investment in the police,\" he said. \"We expect the police to start embracing the change they need to do to do their bit for change as well.\" \"Money is part of how we change our country for the better. And reform – modernisation, using technology, doing things in the way that people would expect our public services to be doing in the 2020s – is the other part.\" Last month, five police chiefs, including Sir Mark Rowley, head of the Metropolitan Police, said years of cuts had left forces working with \"outdated\" technology and warned further cuts would \"bake in structural inefficiencies\".\n\nAlso appearing on Sunday with Laura Kuenssberg, Philp said he was \"very concerned that police numbers may fall\". Asked how the Conservatives would find money to protect police funding, he said there were \"all kinds of areas where Labour is essentially splurging money\". He criticised the government for its spending on environmental projects and public sector pay rises. He also said his party would \"go further on welfare reform\" and pointed to its plans to cut £12bn from the welfare budget. Richard Tice, Reform UK's deputy leader, told the programme his party wanted the government and councils to \"stop wasting money\" and cut money from the \"back offices\". He added the Bank of England could save money by changing its quantitative easing programme. Liberal Democrat deputy leader Daisy Cooper said: \"There's already an epidemic of unsolved crime across the country, so it beggars belief that the government won't rule out cutting vital police funding.\""
    },
    {
        "title": "How 3D-printed guns are spreading online",
        "description": "The technology to build your own lethal weapon is promoted on social media",
        "url": "https://www.bbc.com/news/articles/cvg84rke4ejo",
        "source": "BBC News",
        "publishedAt": "2025-06-19T00:17:34Z",
        "full_text": "Print and shoot: How 3D-printed guns are spreading online\n\n19 June 2025 Share Save Dan Hardoon BBC Trending Share Save\n\nGetty/BBC\n\n3D-printed guns could become \"the weapon of choice\" for criminals and violent extremists around the world, an expert has told the BBC. These DIY, untraceable firearms have been recovered in several recent criminal cases, including the alleged use of a partially 3D-printed gun in the killing of United Healthcare CEO Brian Thompson. BBC Trending has investigated the global spread of 3D-printed guns across social media platforms including Telegram, Facebook and Instagram, as well as websites offering how-to guides.\n\n3D-printed guns, often described as a type of \"ghost\" gun, are untraceable firearms that can be assembled using a 3D printer, downloadable blueprints and some basic materials. Designed to evade gun-control laws, the technology has advanced rapidly in the last decade, with the latest models capable of firing multiple rounds without their plastic components breaking. According to Nick Suplina of Everytown, a US-based gun control organisation, 3D-printed guns could become the \"weapon of choice\" for people planning acts of violence: \"The materials have gotten better, the cost has gone down, and the ease of access of these blueprints is at a high,\" he said. BBC Trending's investigation began with advertisements for guns on Instagram and Facebook. In October 2024, the Tech Transparency Project, a non-profit that monitors technology companies, found hundreds of gun ads - including for 3D-printed and other ghost guns - appearing on Meta's platforms, in violation of its policies. Meta declined to comment on the findings at the time. Several months later, BBC Trending found similar gun adverts still showing as active in Meta's ad database.\n\nMeta/BBC\n\nMany of these gun adverts directed potential customers to Telegram or WhatsApp channels. On Telegram, we found channels displaying a variety of guns for sale. Some of these appeared to be 3D-printed. One Telegram account with over 1,000 subscribers claimed to ship weapons globally. BBC Trending contacted the account, which called itself \"Jessy\", to confirm whether it would be willing to break the law by shipping 3D-printed guns to the UK. Within an hour, Jessy offered us a Liberator or a Glock switch.\n\nA glock switch (also known as an auto sear) is a small, sometimes 3D-printed part that converts a pistol into an automatic weapon. The Liberator, designed in 2013 by \"crypto-anarchist\" Cody Wilson, is the world's first widely available 3D-printed gun, capable of firing a single shot. Jessy claimed he could smuggle the weapon through UK customs, asked for payment of £160 in bitcoin, then suggested a bank transfer to a UK account we couldn't trace. When we later contacted Jessy, identifying ourselves as the BBC, he acknowledged that selling weapons in the UK is illegal but sounded unapologetic. \"I run my business, sell some straps [slang for weapons] online,\" he said.\n\nBBC Trending investigates a Telegram channel offering to sell guns\n\nWe did not proceed with the transaction to test Jessy's claims. While his casual attitude suggested he might have been a scammer, his ability to advertise on Meta and operate on Telegram highlights apparent loopholes that real gun dealers could exploit. When contacted, Meta told the BBC that the adverts we highlighted had been \"automatically disabled in line with our policies\", and that inclusion in its ad library \"doesn't necessarily mean the ad is still live or visible\". Telegram said that Jessy's account had been proactively removed for breaching its policies. A spokesperson added: \"The sale of weapons is explicitly forbidden by Telegram's terms of service and is removed whenever discovered. Moderators empowered with custom AI and machine learning tools proactively monitor public parts of the platform and accept reports in order to remove millions of pieces of harmful content each day, including the sale of weapons.\" Concerningly though, people seeking 3D-printed guns don't need to buy readymade ones through social media. They can assemble their own. Models like the FGC-9 are designed using only 3D-printed plastic and repurposed metal components, with no commercially available gun parts required. \"You are essentially becoming a DIY gunsmith,\" says Dr Rajan Basra, a researcher at King's College London. However, \"It's not as easy as printing off a sheet of A4 paper in your office printer.\" As the BBC has previously reported, there are websites offering free step-by-step guides and downloadable blueprints for building 3D-printed guns. One such guide was written by Matthew Larosiere, a gun rights attorney in Florida. He's associated with the global pro-3D-printed gun community, which has many members in the USA who see the Second Amendment right to bear arms as a human right. BBC Trending challenged him about why he is sharing information to help people build a lethal weapon. He replied: \"It's just information. It's ones and zeros. The fact that the information has a use case that makes you uncomfortable, I understand and I sympathise with that, but that doesn't make it correct to say it's anything more than information.\" Asked about the risk of this \"information\" being used in a school shooting or massacre, he replied: \"I thank God that has not happened.\" He cited Myanmar as a country where, in his view, 3D-printed guns have served a positive cause.\n\nGetty 3D printers have been used by Myanmar's rebel groups to make guns"
    },
    {
        "title": "Futureproof",
        "description": "AI tools are flooding the culture ecosystem — and no corner of the arts space is immune. In this series, we’re looking at the ways artists are embracing AI, pushing back on it, or trying their best to find an equilibrium with a new technology that’s both swee…",
        "url": "https://www.theverge.com/ai-artificial-intelligence/688592/futureproof-artists-and-ai",
        "source": "The Verge",
        "publishedAt": "2025-06-18T16:15:59Z",
        "full_text": "AI tools are flooding the culture ecosystem — and no corner of the arts space is immune. In this series, we’re looking at the ways artists are embracing AI, pushing back on it, or trying their best to find an equilibrium with a new technology that’s both sweeping and destabilizing. We talk to perfumers questioning the looming automation of scent creation, fanfic writers pushing back on archive scrapers, and illustrators replacing the AI that once replaced them. The tech isn’t going away. Here’s how artists are starting to deal with it."
    },
    {
        "title": "Google bets on fusion power as its greenhouse gas emissions grow",
        "description": "Google has agreed to purchase electricity from a forthcoming nuclear fusion power plant, the so-called holy grail of clean energy that scientists have been chasing for more than half a century.  While the fusion industry reached a significant milestone a few …",
        "url": "https://www.theverge.com/news/694682/google-nuclear-fusion-deal-cfs",
        "source": "The Verge",
        "publishedAt": "2025-06-30T13:00:40Z",
        "full_text": "is a senior science reporter covering energy and the environment with more than a decade of experience. She is also the host of Hell or High Water: When Disaster Hits Home , a podcast from Vox Media and Audible Originals.\n\nGoogle has agreed to purchase electricity from a forthcoming nuclear fusion power plant, the so-called holy grail of clean energy that scientists have been chasing for more than half a century.\n\nWhile the fusion industry reached a significant milestone a few years ago, the technology has yet to prove whether it can be a technically feasible or commercially viable option. Nevertheless, the deal Google announced today shows confidence in the possibility of harnessing nuclear fusion to power its data centers.\n\nThe news follows the release of Google’s latest sustainability report on Friday, which shows its greenhouse gas emissions continuing to climb despite its clean energy commitments. Even in a best-case scenario, fusion reactors wouldn’t be online in time to help Google meet its goal of slashing emissions by 2030.\n\n“It’s a world-changing technology in our view.”\n\n“It’s a world-changing technology in our view,” Michael Terrell, head of advanced energy at Google, said in a Friday call with reporters. “Yes, there are some serious physics and engineering challenges that we still have to work through to make it commercially viable and scalable. But that’s something that we want to be investing in now to realize that future.”\n\nSpecifically, Google has agreed to purchase 200 megawatts of “future carbon-free power” from Commonwealth Fusion Systems (CFS), a private company that is building the fusion plant in question and in which Google is also an investor. Offtake agreements like this are common for other sources of electricity as a way to fund new projects. What’s different here is that the timeline for nuclear fusion is far more uncertain.\n\nNuclear fusion researchers are attempting to recreate the way stars generate their own light and heat. In our sun, hydrogen nuclei fuse together, creating helium and a tremendous amount of energy. If someone can figure out how to do that in a controlled way on Earth, they would unlock a potentially limitless source of carbon pollution-free energy.\n\nBut doing so takes extreme heat — more than 100 million degrees Celsius. With such high temperature and pressure requirements, scientists weren’t even able to achieve a net energy gain from a fusion reaction until 2022. And so far, only the Lawrence Livermore National Laboratory has been able to do this. (Today’s nuclear power plants generate electricity through fission — releasing energy by splitting atoms apart rather than fusing them together; a process that leaves behind radioactive waste.)\n\nCFS says the technology is finally advancing fast enough to connect its first fusion power plant to the electricity grid in Virginia by the early 2030s. Virginia is also home to “data center alley,” where tech companies have built or expanded facilities to develop new AI tools. Other energy experts The Verge has spoken to over the years, however, think it could take decades longer for fusion to become commercially available. CFS is currently building its pilot plant in Massachusetts.\n\nGoogle and CFS aren’t alone in their ambitions. Microsoft inked a deal in 2023 to purchase electricity from a nuclear fusion generator being developed by Helion Energy, which is supposed to be ready by 2028. Around $8 billion from primarily private investors has flowed into fusion startups in recent years, the Washington Post reported last week.\n\nGoogle first announced an initial investment in CFS to support R&D back in 2021. It’s now making a second capital investment, although the companies aren’t disclosing any concrete numbers. Google has also been an investor in another fusion company, TAE Technologies, since 2015 — although the recent deal with CFS marks Google’s first offtake agreement for fusion.\n\nIn 2021, Google pledged to reduce its planet-heating pollution by 50 percent by the end of the decade compared to a 2019 baseline. The company’s latest sustainability report, however, shows that the its carbon emissions have actually ballooned by more than 50 percent since 2019 as it doubles down on AI.\n\nThe 200MW deal with CFS represents a fraction of Google’s carbon-free energy purchases. It says it has signed more than 170 agreements since 2010 to purchase 22,000MW of clean energy — much of that in wind and solar projects that it sees as more feasible near-term solutions."
    },
    {
        "title": "We confirmed Nintendo’s Switch 2 TV dock supports VRR — so why doesn’t it work with Switch 2?",
        "description": "You want your games to play the smoothest they possibly can - but sometimes, screen technology gets in the way. That's why some of the latest TVs and handhelds feature variable refresh rate (VRR) screens that can compensate when your graphics can't deliver a …",
        "url": "https://www.theverge.com/report/697937/nintendo-switch-2-vrr-steam-deck-rog-x-ally-120hz",
        "source": "The Verge",
        "publishedAt": "2025-07-03T22:55:17Z",
        "full_text": "is a senior editor and founding member of The Verge who covers gadgets, games, and toys. He spent 15 years editing the likes of CNET, Gizmodo, and Engadget.\n\nYou want your games to play the smoothest they possibly can — but sometimes, screen technology gets in the way. That’s why some of the latest TVs and handhelds feature variable refresh rate (VRR) screens that can compensate when your graphics can’t deliver a consistent 60 or 120 frames per second.\n\nThe Nintendo Switch 2 has a VRR screen — and originally, Nintendo advertised that the Switch 2 would also work with your VRR-capable TV. But Nintendo soon scrubbed mentions of docked VRR from its website, and on May 16th, it apologized. “Nintendo Switch 2 supports VRR in handheld mode only,” the company told Nintendo Life, apologizing for “the incorrect information.”\n\nBut I’ve just confirmed that the official Nintendo Switch 2 dock does support VRR — by plugging the Steam Deck into it.\n\nVRR works. Photo by Sean Hollister / The Verge\n\nIn fact, we found multiple rival handhelds can output 4K at 120Hz with both HDR and VRR if you plug them into the Nintendo Switch 2 dock. I saw the same with the Lenovo Legion Go S with SteamOS, and an Asus ROG Ally X with Bazzite, each outputting to my Samsung S90C TV. We got the idea from Reddit, where u/DynaMach and others have reported VRR working this way.\n\nIt’s not particularly practical to play a PC handheld via Nintendo’s dock, because you’ll need a female-to-male USB-C extension cable and you’ll need to continually hold it against Nintendo’s spring-loaded platform to keep it from getting ejected — but I just so happened to have one of those cables lying around.\n\nA Legion Go S with SteamOS plugged into the Switch 2 dock with a USB-C extension. Photo by Sean Hollister / The Verge\n\nAnd before you ask, yes, I did actually test that 4K VRR actually works at up to 120 frames per second — I didn’t just trust SteamOS’s flag that it was supported. I downloaded the open-source VRRTest tool and messed with various settings, just to check that intermediate framerates between 48fps and 60fps and 90fps all stayed smooth on my TV as the framerate fluctuates.\n\nSo if the Switch 2 supports VRR, and the dock supports VRR, why does Nintendo not offer VRR display output from the Nintendo Switch 2?\n\nIt would be a boon in many games, whether we’re talking about games like Cyberpunk 2077 that don’t run at 60fps on Switch to begin with, or even games that only occasionally dip below that threshold (say, 55fps) where that dip currently manifests as a big stutter in your gameplay.\n\nPersonally, I think it’s possible Nintendo just doesn’t think the Switch 2 is ready to put it on the big screen.\n\nLast month, Digital Foundry found “clear problems” even in the Switch 2’s handheld VRR mode, including judder in Cyberpunk 2077 and No Man’s Sky’s 40fps “performance” modes, as well as Hitman: World of Assassination’s unlocked-but-capped 60fps mode — although Nintendo’s own Welcome Tour showed proper VRR support.\n\n“Clearly the feature is in there and working, because the Welcome Tour proves it, but the actual implementation in other games so far is disappointing,” Digital Foundry’s Rich Leadbetter explained on the channel’s podcast.\n\nBut if you’re looking for technical reasons why Nintendo might not pass along VRR to the official dock, Leadbetter tells me he hasn’t yet heard a good theory. He does believe, however, that Nintendo probably made an honest mistake when it wrote, then apologized for writing, that the Switch 2 would support VRR in TV mode. He doubts that Nintendo axed the feature at the last minute.\n\nThis is just the latest technological weirdness around the Switch 2’s launch, like we saw when testing the Switch 2’s semi-locked-down USB-C video output and why the best webcams didn’t work.\n\nBut as before, Nintendo is staying silent: it didn’t have a comment for our story."
    },
    {
        "title": "E Ink is turning the laptop touchpad into an e-reader for AI apps",
        "description": "E Ink has developed a new touchpad for laptops featuring the same electronic paper technology found in e-readers. It’s not the first company to look at the ever-growing size of laptop touchpads and see the potential of additional functionality, but instead of…",
        "url": "https://www.theverge.com/news/697688/eink-epaper-touchpad-laptop-intel-ai-pcs",
        "source": "The Verge",
        "publishedAt": "2025-07-03T17:37:33Z",
        "full_text": "is a senior reporter who’s been covering and reviewing the latest gadgets and tech since 2006, but has loved all things electronic since he was a kid.\n\nE Ink has developed a new touchpad for laptops featuring the same electronic paper technology found in e-readers. It’s not the first company to look at the ever-growing size of laptop touchpads and see the potential of additional functionality, but instead of serving as a second smaller screen for the computer’s OS, E Ink is positioning its touchpad as a dedicated home for AI applications and assistants.\n\nA mockup image shared by the company features a laptop with a touchpad upgraded with a color E Ink screen similar to what’s in use by devices like the Amazon Kindle Colorsoft. Instead of it being an extension of a laptop’s main screen, E Ink envisions its new touchpad as being a separate place where AI-generated text summaries could appear under your hands while working on a document, or you could maintain a constant conversation with an AI chatbot without having to juggle desktop windows.\n\nE Ink’s display technology only consumes power when it’s being updated. That’s a big benefit given the higher demands of AI tools on a laptop’s battery life.\n\nThe idea is reminiscent of laptops that companies like Asus have already released featuring upgraded touchpads that double as secondary displays, but they typically feature smartphone-sized LCD screens that are often too small to effectively use applications designed for larger computer screens. A full color screen under your hands can also be a distraction and potentially reduce a laptop’s battery life. The use of E Ink screens has expanded outside e-readers to include colorful signage and digital notepads, but the technology is still best suited to displaying text.\n\nSimilar to Apple’s now discontinued Touch Bar, E Ink also says the touchpad display could provide quick access to frequently used shortcuts, display notifications or the weather, or provide temporary playback controls without having to sacrifice a laptop keyboard’s row of function keys. It would also help reduce battery anxiety, because unlike LCD or OLED panels, E Ink’s display technology only consumes power when it’s being updated. That’s a big benefit given the higher demands of AI tools on a laptop’s battery life.\n\nWhat’s not currently known are more in-depth technical specifications. Aside from the touchpad potentially using color e-paper displays, E Ink hasn’t revealed if it will adapt one of its current panels, or if it’s developed an entirely new one with increased resolutions. Today’s announcement specifically references compatibility with Intel-based AI PCs, but E Ink didn’t go into details about whether the touchpad display would be powered by a laptop’s primary OS, or if it would feature its own. The company also didn’t provide a timeline for when these touchpads might start showing up in laptops or which hardware makers may be interested."
    },
    {
        "title": "HP reveals $24,999 hardware created just for Google Beam",
        "description": "HP has become the first company to preview hardware built with Google Beam, the 3D video communication technology formerly known as Project Starline. It’s launching the HP Dimension, a device that features a 65-inch light field display with six high-speed cam…",
        "url": "https://www.theverge.com/news/684859/hp-dimension-google-beam-3d-video-communication",
        "source": "The Verge",
        "publishedAt": "2025-06-10T21:45:48Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nHP has become the first company to preview hardware built with Google Beam, the 3D video communication technology formerly known as Project Starline. It’s launching the HP Dimension, a device that features a 65-inch light field display with six high-speed cameras inside the bezel to create “a true-to-life” 3D video of your caller.\n\nGoogle first announced Project Starline’s rebrand last month. At the time, Google said that it would let third-party manufacturers, starting with HP, use its design framework to build devices with Beam. The HP Dimension is meant for enterprise use. It costs $24,999, and that doesn’t even include the software needed to hold video calls, as users will need to purchase a Google Beam license separately to gain access to Zoom or Google Meet. (HP and Google haven’t said how much a license will cost yet.)\n\nAs my colleague Alex Heath pointed out in a demo of Google Beam, you don’t need a headset, glasses, or any kind of special equipment to see a colleague as if they’re in the same room. Beau Wilder, HP’s head of future customer experiences, said you don’t need a special room either, but having a white background is best for an “optimal” experience.\n\n“We’re not trying to put a caricature in a small box across the table from you,” Wilder said. “We want you to walk into the room and instantly make eye contact without even thinking about it.”\n\nThe Dimension is supposed to give you a lifelike look at your colleague on the other side of the screen. Image: HP\n\nHP Dimension users will still be able to hold calls with people from other video conferencing platforms and devices, but their colleagues won’t be able to see their images projected in 3D — and vice versa. Along with a series of built-in cameras, the HP Dimension features adaptive lighting that “adjusts to the environment,” allowing users to see realistic shadows on facial features and natural skin tones.\n\nThe HP Dimension pairs its light field display with spatial audio that Wilder said “never separates the voice from the body.” It comes with HP’s new Poly Studio A2 table mics, as well as four speakers located behind its curved, “acoustically transparent” mid-wall for “a direct path to the ears.”\n\n“The ultimate goal of Google Beam — and it’s manifested on HP Dimension — is to feel like you’re there,” Andrew Nartker, general manager of Google Beam, said during the briefing. “You feel just like you’re there at the table working together … It’s all meant to bring us together and ultimately feel like we’re completely physically present.”\n\nThe HP Dimension will launch in the US, Canada, the UK, France, Germany, and Japan later this year. Companies like Salesforce, Deloitte, and NEC Corporation have already committed to bringing Google Beam into their offices."
    },
    {
        "title": "Laptop Mag is shutting down",
        "description": "Laptop Mag is shutting down after nearly 35 years of providing consumers with in-depth information about laptops and other technology. In a staff meeting seen by The Verge, Faisal Alani, the global brand director at Laptop Mag owner Future PLC, said, “After c…",
        "url": "https://www.theverge.com/news/695969/laptop-mag-shutdown-future-plc",
        "source": "The Verge",
        "publishedAt": "2025-07-01T17:43:47Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nLaptop Mag is shutting down after nearly 35 years of providing consumers with in-depth information about laptops and other technology. In a staff meeting seen by The Verge, Faisal Alani, the global brand director at Laptop Mag owner Future PLC, said, “After careful consideration and a review of our long-term strategy, we’ve made the decision to close the Laptop Mag business effective today.”\n\nLaptop Mag has evolved many times over the years. It started as a print publication in 1991, when Bedford Communications launched the Laptop Buyers Guide and Handbook. Laptop Mag was later acquired by TechMedia Network (which is now called Purch) in 2011 and transitioned to digital-only content in 2013. Future PLC, the publisher that owns brands like PC Gamer, Tom’s Guide, and TechRadar, acquired Purch — and Laptop Mag along with it.\n\n“We are incredibly grateful for your dedication, talent, and contributions to Laptop Mag, and we are committed to supporting you throughout this transition,” Alani said. Laptop Mag’s shutdown follows the closure of long-running tech site AnandTech, which was also owned by Future PLC. It’s not clear whether Laptop Mag’s archives will be available following the shutdown. Future PLC declined to comment."
    },
    {
        "title": "The Trump administration appears to be planning its own chatbot",
        "description": "The Trump administration is working on an “AI.gov” website and API to “accelerate government innovation with AI,” 404 Media found based on code posted to Github and an early version of the site. The project appears to be run by the General Services Administra…",
        "url": "https://www.theverge.com/news/684579/ai-api-trump-administration-doge-gsa",
        "source": "The Verge",
        "publishedAt": "2025-06-10T16:55:05Z",
        "full_text": "The early AI.gov website discovered by 404 Media (the live URL currently redirects to the White House website) describes three tools that are part of the platform, “powered by the best in American AI.” They are: an AI chat assistant, an API to connect with models from OpenAI, Google, and Anthropic, and a console “to analyze agency-wide implementation.” The project is expected to launch on July 4th, 404 reports."
    },
    {
        "title": "Airplane Wi-Fi Is Now … Good?",
        "description": "For years, in-flight internet has been fine for email, not great for Zoom meetings. That’s all changing fast.",
        "url": "https://www.wired.com/story/airplane-wifi-good-now/",
        "source": "Wired",
        "publishedAt": "2025-07-02T13:00:00Z",
        "full_text": "Expensive and erratic, in-flight Wi-Fi has been more of a punchline than a pipeline over the past decade. But 2025 has marked a sea change for the skies: the rollout of fast, and free, connectivity on most of the world’s major airlines.\n\nSatellite technology has enabled leaps in speed and bandwidth. SpaceX’s Starlink network of low Earth orbit satellites, for example, can deliver a connection capable of downloading more than 200 megabits per second—twice as fast as most basic home internet plans. As a result, a host of global airlines are inking deals with the company.\n\n“We’re creating a little bit of a living room in the sky,” says Grant Milstead, vice president of digital technology for United Airlines, which flew its first Starlink-equipped route, from Chicago to Detroit, in May.\n\nThe boost in bandwidth is changing the face of business travel, giving flyers the unprecedented ability to Slack, Zoom, and collaborate with coworkers from 35,000 feet. They can download lengthy PowerPoints, edit Google Docs in real time, and join livestream conferences as seamlessly as on the ground. (Voice and video calls are technically possible with satellite technology but prohibited by the FAA and “strongly discouraged” by airlines around the world from an etiquette standpoint.)\n\nIt’s a shift that’s felt, at times, like it would never come. For most of the 21st century, airlines relied on ground-based cell towers that provided slow, or no, coverage over rural areas, deserts, and oceans—a problem for carriers such as Air New Zealand and Hawaiian Airlines. Launched in 2008, Aircell, which would later become known as Gogo Inflight, offered a pricey yet spotty air-to-ground service that served as the stodgy industry standard.\n\nThen, in 2013, JetBlue partnered with Viasat to pioneer the use of satellites for in-flight Wi-Fi. Though faster and more reliable than Gogo, satellite-based connectivity was slow to take off—an expensive endeavor requiring affixing an antenna to the top of the plane and placing routers throughout the aircraft.\n\nMajor carriers such as Delta and Cathay Pacific signed on with the provider several years later, but the advent of Starlink has curtailed Viasat’s first-mover advantage. Qatar Airways, Scandinavian Airlines (SAS), Hawaiian Airlines, Virgin Atlantic, and Air France have adopted or are in talks to potentially pilot test Starlink technology, as have Canada’s WestJet and US-based charter operator JSX.\n\nThis story is part of The New Era of Work Travel, a collaboration between the editors of WIRED and Condé Nast Traveler to help you navigate the perks and pitfalls of the modern business trip.\n\nAir New Zealand, which uses Viasat for its transpacific flights, plans to equip its domestic fleet with Starlink service later this year. The move will be a “game-changer” for business travelers who might typically drive between hubs such as Auckland and Wellington, according to Nikhil Ravishankar, the airline’s chief digital officer."
    },
    {
        "title": "Max will show autoplaying video previews picked by AI",
        "description": "Max — soon to be called HBO Max again — is rolling out an update that automatically plays video previews when you hover over shows and movies. The video previews are launching to users in the US now, but Max is still working on an “AI-assisted” tool to pick t…",
        "url": "https://www.theverge.com/news/688313/max-video-previews-autoplay-update",
        "source": "The Verge",
        "publishedAt": "2025-06-17T16:18:02Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nMax — soon to be called HBO Max again — is rolling out an update that automatically plays video previews when you hover over shows and movies. The video previews are launching to users in the US now, but Max is still working on an “AI-assisted” tool to pick the clips that go in them.\n\nIn the “coming weeks,” Max says its AI tool will automatically identify “standout” scenes from its shows and movies, which its team will then use to choose the clips featured in video previews. “This AI-driven technology will enable us to identify Drop-in Moments for the vast catalog of content on Max and significantly reduce the manual time needed to curate previews,” Avi Saxena, Warner Bros. Discovery’s chief technology officer, said in the press release.\n\nThe previews will appear when you hover over content. GIF: Warner Bros. Discovery\n\nThe streaming service will also include an option to turn off the audio or video in the autoplaying content, similar to Netflix.\n\nMax updated its interface in January to move the options from its top menu bar to the left side of the screen — basically the opposite of what Netflix is doing in its upcoming homepage redesign. Max will have another big change sometime this summer, as that’s when the switch back to HBO Max will be official."
    },
    {
        "title": "Apple Releases Safari Technology Preview 222 With Bug Fixes and Performance Improvements",
        "description": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the S…",
        "url": "https://www.macrumors.com/2025/07/01/apple-releases-safari-technology-preview-222/",
        "source": "MacRumors",
        "publishedAt": "2025-07-01T23:06:09Z",
        "full_text": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the Safari browser.\n\n\n\n‌Safari Technology Preview‌ 222 includes fixes and updates for Accessibility, CSS, Media, Rendering, Scrolling, and Web API.\n\nThe current ‌Safari Technology Preview‌ release is compatible with machines running macOS Sequoia and macOS Tahoe, the newest version of macOS that's set to launch this later this year.\n\nThe ‌Safari Technology Preview‌ update is available through the Software Update mechanism in System Preferences or System Settings to anyone who has downloaded the browser from Apple’s website. Complete release notes for the update are available on the Safari Technology Preview website.\n\nApple’s aim with ‌Safari Technology Preview‌ is to gather feedback from developers and users on its browser development process. ‌Safari Technology Preview‌ can run side-by-side with the existing Safari browser and while it is designed for developers, it does not require a developer account to download and use."
    },
    {
        "title": "OpenAI awarded $200 million US defense contract",
        "description": "OpenAI is officially on the Pentagon’s payroll. The Department of Defence announced a $200 million contract with OpenAI to provide the US government with new artificial intelligence tools, including those used for proactive cyber defense. In a post outlining …",
        "url": "https://www.theverge.com/news/688041/openai-us-defense-department-200-million-contract",
        "source": "The Verge",
        "publishedAt": "2025-06-17T09:35:46Z",
        "full_text": "OpenAI is officially on the Pentagon’s payroll. The Department of Defense announced a $200 million contract with OpenAI to provide the US government with new artificial intelligence tools, including those used for proactive cyber defense.\n\nIn a post outlining its latest contracts, the DoD said that OpenAI “will develop prototype frontier AI capabilities to address critical national security challenges in both warfighting and enterprise domains.” The work will primarily be completed in the Washington, DC, region with an estimated completion date of July 2026.\n\nOpenAI said in a new blog post that the DoD contract is its first partnership under a new initiative to provide its AI technology to workers across federal, state, and local governments. The company is offering custom models for national security on “a limited basis,” according to the announcement, with OpenAI saying that all use cases must comply with its policies and guidelines. OpenAI’s current usage policy bans its services from being used to “develop or use weapons” and “injure others or destroy property.”\n\n“This contract, with a $200 million ceiling, will bring OpenAI’s industry-leading expertise to help the Defense Department identify and prototype how frontier AI can transform its administrative operations, from improving how service members and their families get health care, to streamlining how they look at program and acquisition data, to supporting proactive cyber defense,” OpenAI said.\n\nThis isn’t the first time OpenAI has bedded down with the military, having entered a partnership with Anduril Industries in December 2024 to integrate its AI software into the defense tech company’s counterdrone systems. The new one-year DoD contract is antithetical to earlier versions of OpenAI’s terms of service that banned its technology from being used for “military and warfare” — a prohibition removed by the company last year.\n\nOpenAI’s DoD contract is the latest of several efforts to bolster military efforts with AI technology, with the US having renamed the AI Safety Institute earlier this month to focus on combating national security risks instead of overall safety. Rival AI developer Anthropic announced an AI model with looser guardrails for US defense and intelligence agencies on June 5th, Google removed commitments in February to not use AI in ways “that cause or are likely to cause overall harm,” and Meta started allowing the US government to use its Llama AI model for “national security applications” last year."
    },
    {
        "title": "Apple Releases Safari Technology Preview 221 With Bug Fixes and Performance Improvements",
        "description": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the S…",
        "url": "https://www.macrumors.com/2025/06/11/apple-releases-safari-technology-preview-221/",
        "source": "MacRumors",
        "publishedAt": "2025-06-11T22:30:48Z",
        "full_text": "Apple today released a new update for Safari Technology Preview, the experimental browser that was first introduced in March 2016. Apple designed ‌Safari Technology Preview‌ to allow users to test features that are planned for future release versions of the Safari browser.\n\n\n\n‌Safari Technology Preview‌ 221 includes fixes and updates for Accessibility, Forms, JavaScript, Media, PDF, Rendering, Web API, Web Inspector, and WebRTC.\n\nThe current ‌Safari Technology Preview‌ release is compatible with machines running macOS Sequoia and macOS Tahoe, the newest version of macOS that's set to launch this later this year.\n\nThe ‌Safari Technology Preview‌ update is available through the Software Update mechanism in System Preferences or System Settings to anyone who has downloaded the browser from Apple’s website. Complete release notes for the update are available on the Safari Technology Preview website.\n\nApple’s aim with ‌Safari Technology Preview‌ is to gather feedback from developers and users on its browser development process. ‌Safari Technology Preview‌ can run side-by-side with the existing Safari browser and while it is designed for developers, it does not require a developer account to download and use."
    },
    {
        "title": "PCIe 7.0 is coming, but not soon, and not for you",
        "description": "The PCIe 7.0 specification has now been released, while many of us are still waiting for PCIe 6.0 to materialize in consumer products. The PCI Special Interest Group (PCI-SIG) announced on Wednesday that PCIe 7.0 is now available to members of its organizatio…",
        "url": "https://www.theverge.com/news/686560/pcie-7-0-specification-launch-bandwith-speed",
        "source": "The Verge",
        "publishedAt": "2025-06-13T09:22:06Z",
        "full_text": "The PCIe 7.0 specification has now been released, while many of us are still waiting for PCIe 6.0 to materialize in consumer products. The PCI Special Interest Group (PCI-SIG) announced on Wednesday that PCIe 7.0 is now available to members of its organization, delivering a theoretical maximum bandwidth speed of 512GB per second in both directions, across a x16 connection.\n\n“PCIe technology has served as the high-bandwidth, low-latency IO interconnect of choice for over two decades and we are pleased to announce the release of the PCIe 7.0 specification, which continues our long-standing tradition of doubling the IO bandwidth every three years,” PCI-SIG President Al Yanes said in the announcement. “As artificial intelligence applications continue to scale rapidly, the next generation of PCIe technology meets the bandwidth demands of data-intensive markets deploying AI, including hyperscale data centers, high performance computing (HPC), automotive, and military/aerospace.”\n\nYou may have noticed that consumer computing devices weren’t included in that statement — the specification is targeting data-driven applications like cloud and quantum computing datacenters for now, and will take some time to even appear in those markets. PCI-SIG says that PCIe 7.0 will be backward compatible with previous PCI Express versions, but there’s no mention of plans to bring it to everyday desktop SSDs or GPUs any time soon. That shouldn’t be surprising, given the PCIe 5.0 spec that launched in 2019 only started trickling into consumer hardware two years ago, and is still fairly uncommon.\n\nHere’s a snapshot of all the improvements PCIe 7.0 has over PCIe 6.0. Image: PCI-SIG\n\nMeanwhile, PCI-SIG says that pathfinding for PCIe 8.0 is “already in progress.” With any luck, PCIe 6.0 will have made its consumer debut by the time the next-gen specifications have been finalized in 2028."
    },
    {
        "title": "Runway is going to let people generate video games with AI",
        "description": "So far, Runway is known for bringing generative AI to Hollywood. Now, the $3 billion startup is setting its sights on the gaming industry. This week, I was granted access to a new interactive gaming experience that Runway plans to make available to everyone a…",
        "url": "https://www.theverge.com/ai-artificial-intelligence/694531/runway-ai-video-games-generate",
        "source": "The Verge",
        "publishedAt": "2025-06-27T19:50:34Z",
        "full_text": "So far, Runway is known for bringing generative AI to Hollywood. Now, the $3 billion startup is setting its sights on the gaming industry.\n\nThis week, I was granted access to a new interactive gaming experience that Runway plans to make available to everyone as soon as next week, according to CEO Cristóbal Valenzuela. The consumer-facing product is currently quite barebones, with a chat interface that supports only text and image generation, but Valenzuela says that generated video games are coming later this year. He says that Runway is also in talks with gaming companies about both using its technology and accessing their datasets for training.\n\nAn interactive Runway game that’s generated with AI. The Verge\n\nThe Verge\n\nBased on his recent conversations, Valenzuela believes the gaming industry is in a similar position to Hollywood when it was first introduced to generative AI. There was considerable resistance, but over time, AI has been gradually adopted in more areas of the production process. Valenzuela says Amazon’s recent show, House of David, was made in part with Runway’s technology, and that his company is working with “pretty much every major studio” and “most of the Fortune 100 companies.”\n\n“If we can help a studio make a movie 40 percent faster, then we’re probably gonna be able to help developers of games make games faster,” he says. “They’re waking up, and they’re moving faster than I would say the studios were moving two years ago.”\n\nNaturally, I couldn’t let Valenzuela get off our Zoom call without asking him about his recent acquisition talks with Zuckerberg: “I think we have more interesting intellectual challenges being independent, and remaining independent for now.”\n\nThis story was first published in Command Line."
    },
    {
        "title": "Tesla's Robotaxi Service Hits the Road in Texas",
        "description": "The company debuted its autonomous ride-hailing service Sunday. The limited program is invite-only and uses around 20 cars—signs that Tesla has a long way to go to catch up to its robotaxi rivals.",
        "url": "https://www.wired.com/story/tesla-robotaxi-service-launches-austin-texas/",
        "source": "Wired",
        "publishedAt": "2025-06-22T19:41:03Z",
        "full_text": "After nearly a decade of waiting, Tesla has launched a limited self-driving car service in the Austin, Texas, area. Company executives, including Musk, have said the autonomous vehicle technology debuting today is critical to Tesla’s future.\n\nThe limited service, which for now is open only to early users invited by Tesla, includes some 20 2025 Model Y sedans available for rides through a Tesla-made app between 6 a.m and midnight. Terms of service posted on X by invited riders indicate that the service will be paused or limited for bad weather. Rides during this invite-only phase are available for a flat $4.20 fee, Musk posted on X Sunday.\n\nPeople who scored one of the limited invitations—several of whom traveled to Texas this weekend to participate in the launch—were able to start taking rides around 2 pm local time on Sunday.\n\nThe company has said that its purpose-built Cybercab will go into production next year; for now, Model Ys will be the only Teslas driving autonomously as part of the program.\n\nAccording to screenshots posted on X, the service appears to pick up and drop off in an area of Austin limited to part of the south side of the city, just across the Colorado River from downtown. The service area appears to include the bustling thoroughfares of South Congress Avenue and South Lamar Boulevard. The service cannot go to the local airport, Austin-Bergstrom International, which is about five miles from downtown. Those invited to try the service can bring one guest on the ride, as long as they are 18 or older.\n\nIn an email to invitees posted on X this week, Tesla said that a company employee would sit in the front passenger seat of each robotaxi. Launching an autonomous-vehicle service with a “safety driver” is not unusual. Alphabet subsidiary Waymo launched its service with a safety driver in 2018, as did General Motors’ Cruise in 2020. The Michigan company May Mobility says it will do the same when it starts service in Atlanta this year. But a Tesla safety monitor in the passenger seat—not the driver’s seat—likely won’t be able to grab the steering wheel or hit the brakes in the case of a road incident.\n\nTesla’s robotaxi service will also likely be augmented by teleoperators: drivers who can, when needed, advise or perhaps even pilot the car remotely to get it around an unorthodox obstacle or out of a sticky situation.\n\nMusk has been promising Tesla robotaxi technology since October 2016, when he told investors every vehicle his company produced from then on had all the hardware needed to become self-driving. That wasn’t true; Tesla has since updated the hardware on its vehicles. In 2019, Musk said Tesla would have 1 million robotaxis on the road by the next year. (It didn’t.)\n\nMusk said earlier this year that the company will have hundreds of thousands of robotaxis on public roads next year."
    },
    {
        "title": "Waymo’s robotaxis are coming back to New York City",
        "description": "Waymo announced today that it intends to launch a fully autonomous robotaxi service in New York City — but first it needs to change state law to permit its vehicles to operate with safety drivers behind the wheel. The Alphabet-owned company said it has applie…",
        "url": "https://www.theverge.com/news/689093/waymo-nyc-permit-autonomous-testing-new-york-state",
        "source": "The Verge",
        "publishedAt": "2025-06-18T16:00:08Z",
        "full_text": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nWaymo announced today that it intends to launch a fully autonomous robotaxi service in New York City — but first it needs to change state law to permit its vehicles to operate with safety drivers behind the wheel.\n\nThe Alphabet-owned company said it has applied for a permit from the city’s Department of Transportation to test its vehicles with safety drivers. If granted, it would be the first permit allowed under the city’s new process for regulating autonomous test vehicles. While it waits, Waymo says next month it will start collecting mapping data with manually driven vehicles in Manhattan.\n\nNew York state law requires “that a test vehicle operator be present and ready to assume control of the vehicle while the AV technology is in operation,” according to the city’s AV testing website. Waymo said it is actively lobbying to change the law to allow for autonomous vehicles without safety drivers.\n\nNew York state law requires “that a test vehicle operator be present and ready to assume control of the vehicle while the AV technology is in operation.”\n\nA bill was introduced in the New York State Legislature earlier this year that would permit autonomous vehicles without safety drivers “provided that the automated driving system is engaged and the vehicle meets certain conditions.” The bill is currently under consideration by the state Senate’s transportation committee.\n\nNew York City also has some of the most dangerous, congested, and poorly managed streets in the world. They are also full of construction workers, pedestrians, bicyclists, and double- and sometimes even triple-parked cars. In theory, this would make it very difficult for an autonomous vehicle to navigate, given that AVs typically rely on good weather, clear signage, and less aggressive driving from other road users for safe operation. And it’s not clear that the state will amend its laws to allow for fully driverless vehicles, with some lawmakers expressing reservations.\n\n“This kind of testing hasn’t even been completed in other parts of the country,” state Sen. John Liu told Daily News last year after the city announced its new permitting process. “It would behoove New York City to wait to see some of those other results of driverless technology in less dense urban settings. This is an example of something where New York City does not have to be first.”\n\nWhile other states have become hotbeds for AV testing, New York has been a bit of a ghost town. Part of the reason could be the state’s strict rules, which originally required a police escort of autonomous test vehicles — though that language was removed after a renewal of the law several years ago."
    },
    {
        "title": "I'm a psychologist, and people who have anxiety over AI tell me they're losing their sense of self-worth",
        "description": "Psychologist Elaine Ryan advises people not to avoid the technology, but to embrace it and reclaim their self-worth.",
        "url": "https://www.businessinsider.com/im-a-psychologist-who-talks-people-with-ai-anxiety-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-19T09:11:02Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThis as-told-to essay is based on a conversation with Elaine Ryan, a psychologist with two decades of experience. The following has been edited for length and clarity.\n\nI'm a psychologist. I don't work with clients one-to-one anymore because I spend most of my days writing, but I still hear from people — past clients and readers.\n\nOver the past year, I've noticed a new kind of unease creeping into the conversations I have with people. They don't come to me saying, \"I have AI anxiety.\" Just like no one used to say, \"I have job anxiety\" or \"relationship anxiety.\" They simply say, \"I feel anxious.\"\n\nWe like to give things names — climate anxiety, AI anxiety — but the emotion itself isn't new. It's still anxiety. And when I was practicing one-to-one, I never focused on the trigger. I focused on the process.\n\nHow does the anxiety show up? In thoughts, in behaviors, in the body? Are they avoiding? Overthinking? Imagining worst-case scenarios?\n\nThe trigger today is the sheer scale of AI. It didn't arrive quietly. It appeared everywhere — at work, in healthcare, in education, even in creativity. People feel disoriented. They worry not just about losing jobs, but about losing relevance. Some even wonder if they're losing their sense of identity.\n\nI've heard it again and again: \"Where do I fit now?\" or \"What do I have to offer that AI can't?\" It taps into what we call core beliefs in psychology — those quiet, deep-seated fears like, I'm not good enough or I don't belong. AI has a way of activating those beliefs in a very direct and disorienting way.\n\nAnd I understand that feeling. I use AI myself — for writing, administrative tasks, and recently, even to interpret my own medical results. I uploaded my lab results, and AI explained them more clearly than my own doctor could. It was impressive, and honestly, a little unsettling.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nEven though AI can do so much, not everyone knows how to work with it, and that creates fear. Fear of being left behind, of being replaced, or of becoming invisible. When something non-human appears to outperform us, it can trigger that old, hidden fear that maybe we were never enough to begin with.\n\nThis doesn't just affect people's careers. It shows up across life —finances, relationships, even spirituality. It creates a subtle withdrawal from the world. People stop creating, stop participating, because something inside them says: Why bother?\n\nSo what do I tell people? I tell them this is still anxiety. And anxiety is something we know how to work with. Some people will adapt. Others might withdraw. I think a lot depends on how we talk about AI — whether we treat it as a tool for us, or a force over us.\n\nAnd most of all: Don't avoid AI if it scares you. Avoidance is what keeps anxiety alive. Take small steps toward the thing you fear. Understanding reduces fear — of AI, and of anxiety itself.\n\nSo if you're not in therapy, the best thing you can do is watch for avoidance. Name the thought. Ask yourself, What's going on in my head? What's happening in my body? What do I do next? And if you notice you're avoiding it — if you stop reading, stop learning, and pull back — try instead to move toward it, slowly.\n\nAI may be new, but the human response to uncertainty is not. The goal isn't to compete with the machine. It's to reclaim the human part— the experience, the depth, the emotional intelligence — that still matters more than we think."
    },
    {
        "title": "Disney laid off staff as it rebalances product, tech resources",
        "description": "The reduction fell under Adam Smith, product and technology chief, and amounted to under 2% of the group.",
        "url": "https://www.businessinsider.com/disney-lays-off-staff-to-rebalance-product-tech-resources-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-24T23:30:02Z",
        "full_text": "Disney laid off workers for the second time this month, this time in product and technology.\n\nDisney laid off workers for the second time this month, this time in product and technology. Araya Doheny/Getty Images\n\nlighning bolt icon An icon in the shape of a lightning bolt.\n\nlighning bolt icon An icon in the shape of a lightning bolt. Impact Link\n\nThis story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nDisney has laid off workers for the second time this month, this time in product and technology.\n\nThis one fell under Adam Smith, product and technology chief over Disney's entertainment and sports media businesses, and amounted to under 2% of the group, according to a person with direct knowledge.\n\nThe layoffs were geared toward rebalancing resources, and the company continues to hire in product and technology, the person said.\n\nSmith, who joined last year from YouTube, is tasked with boosting technologies for Disney+ and Hulu and also developing the upcoming ESPN flagship streaming product that is set to come out this year.\n\nEarlier this month, the entertainment giant let go of several hundred people, the latest in a series of head count reductions in recent years.\n\nThat cut mainly affected people in TV and film marketing and was related to the industrywide decline in linear TV viewership.\n\nDisney has made several head count reductions in recent years as the TV audiences migrate to streaming platforms , where profits have been slow to follow.\n\nCEO Bob Iger laid the groundwork for broad cuts when he returned in late 2022 for his second tour as chief executive, saying in 2023 that he would cut 7,000 jobs ."
    },
    {
        "title": "Anker 1800W Power Station With 11 Ports Is Selling For Peanuts, Amazon Clears Out Stock Before Summer",
        "description": "No matter if it's home backup in the event of power outages or camping trips outside the Solix C1000 delivers the right mix of power, mobility, and environmental responsibility.",
        "url": "https://gizmodo.com/anker-1800w-power-station-with-11-ports-is-selling-for-peanuts-amazon-clears-out-summer-2000604275",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-14T15:29:47Z",
        "full_text": ""
    },
    {
        "title": "Citi's 'accelerating' its AI strategy with new leaders. Here's how they're readying the firm for a new future.",
        "description": "Citi is consolidating its AI strategy behind three key leaders. They're also eying a push into the next generation of the technology.",
        "url": "https://www.businessinsider.com/citigroup-jane-fraser-ai-strategy-new-leadership-agentic-ai-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-18T16:42:59Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nCitigroup's Jane Fraser is on a mission to modernize the global bank. Three executives have been appointed to ensure AI plays a big role in that.\n\nAs part of the push, the firm — which has long struggled with its reputation issues, some of which are directly tied to tech — said it's unveiling new tools, pilot programs, and a broader effort to embed AI across its operations, in a memo seen by Business Insider.\n\nThe internal memo, which went out to Citi's roughly 200,000 employees, reveals the scope and ambition of the bank's AI efforts, which will be overseen by new co-sponsors of Citi's AI strategy, who are part of the Executive Management Team, include Gonzalo Luchetti, head of US personal banking; Tim Ryan, head of technology and business enablement; and Anand Selva, the firm's chief operating officer.\n\n\"We are focusing on accelerating our AI strategy—connecting teams and partners, prioritizing resources and expediting use cases across our businesses and functions,\" the three leaders wrote in a memo sent to staff on Wednesday.\n\nTo realize the push, the bank will rely on some of its $12 billion annual tech budget, though it's unclear how much is specifically dedicated to AI. But it comes as much of Wall Street, from JPMorgan to Goldman Sachs, races to integrate the technology into everything from consumer service to trading to internal operations.\n\n\"AI is reshaping how we operate, serve our clients and scale our business,\" they added. \"We firmly believe that to be competitive in this digital evolution, we must be an AI-ready workforce—nimble and ready for what this technology can unlock.\"\n\nThey explained that Citi is scaling its generative AI capabilities across the company, with more than 150,000 employees now equipped with Citi AI tools. They're looking for opportunities to push ahead, such as the emergence of \"agentic AI,\" a type of artificial intelligence designed to be capable of pursing goals and making decisions without human input.\n\n\"We're also well underway with Agentic AI, the next big iteration of artificial intelligence with real promise to transform our bank, \" they said in the memo, adding that they'll share more on this initiative in the coming months.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nThe bank launched its Citi AI suite of tools in December, though some came online in the first quarter of this year, like a pilot program that assists with vocal response for its consumer bank operations in the United States. Beyond that, the firm has made available real-time chat in Citi Stylus, a browser plug-in for document and article analysis, and integration of Citi Assist into Microsoft Teams. The AI leaders encouraged using tools like Citi Stylus Workspaces for tasks such as mid-year self-evaluations.\n\nThe bank has enlisted more than 2,000 workers to provide feedback and help their colleagues master the tools through special AI-focused programs. It even announced in the fall a strategic alliance with Google, creating its in-house AI tools on Google's Vertex platform.\n\nA spokesperson for the company said it believes this trio of leaders is right for the next phase of Citi's strategy: Luchetti brings a consumer banking focus; Ryan's group has the tech know-how; and Selva's operations team is helping roll out the strategy across the firm's workforce.\n\nSelva has been entrusted with Fraser's \"Transformation\" mission, which seeks to appease regulators and update its technology that lags behind its other house-hold name peers.\n\nLooking ahead, the bank encouraged employees to engage with the new feature and discussed possibilities for expansion in areas like fraud prevention and trade confirmation matching in its markets business.\n\n\"All businesses and functions have been given the mandate to explore how we can build artificial intelligence into our day-to-day work and operations and, as the EMT co-sponsors, we are here to help,\" the memo authors wrote. \"We encourage you to just jump in and start exploring our current tools. With new capabilities added almost monthly, our tools are user-friendly and advancing quickly.\""
    },
    {
        "title": "Military Launches Website to Find Big Tech’s ‘Army Strong’ Employees",
        "description": "Silicon Valley heads to West Point.",
        "url": "https://gizmodo.com/military-launches-website-to-find-big-techs-army-strong-employees-2000620849",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-26T20:15:30Z",
        "full_text": ""
    },
    {
        "title": "China Set for Critical Orbital Refueling Test With 2 U.S. Satellites Watching Closely",
        "description": "The orbital demonstration could be a game-changer for extending the lifespan of satellites in space.",
        "url": "https://gizmodo.com/china-set-for-critical-orbital-refueling-test-with-2-u-s-satellites-watching-closely-2000613754",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-10T17:50:24Z",
        "full_text": ""
    },
    {
        "title": "I've repaired medical equipment for over 30 years. My son is in the field now, and I think it's one of the most promising careers.",
        "description": "Bryant K. Hawkins Sr. found a rewarding career in healthcare technology management. He's helping others consider jobs in biomedical equipment repair.",
        "url": "https://www.businessinsider.com/biomedical-equipment-technician-job-healthcare-career-journey-2025-5",
        "source": "Business Insider",
        "publishedAt": "2025-06-11T19:33:32Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThis as-told-to essay is based on a conversation with Bryant K. Hawkins Sr., a site manager for the clinical asset management company Trimedx and the founder of Elevate HTM, a nonprofit elevating awareness of healthcare technology management careers. The following has been edited for length and clarity.\n\nI stumbled into a career in healthcare technology management over 30 years ago, and I'm so glad I did.\n\nWhen I graduated from high school in 1990, I had no clue what I wanted to do. So I opened the local college catalog, closed my eyes, and said whatever I touch is what I'm taking. I landed on biomedical equipment technology and haven't looked back.\n\nAfter getting my associate degree, I immediately found a job at a local hospital as a biomedical equipment technician. When I started repairing dialysis machines a few years later and realized these machines were keeping people alive, the sense of purpose in my career path really clicked.\n\nHe finds his job fulfilling because he helps repair and manage equipment that can save lives. Annie Flanagan for BI\n\nAfter 11 years as a technician, I shifted into a leadership role and have been a site manager at various organizations for the past 20 years. While most of my days are filled with meetings now, I still find fulfillment in knowing that my team is saving lives with the equipment.\n\nI work at a children's hospital now, and when I see a kid walking around with an IV pole, it makes me feel good knowing that they're able to walk around and get some sunlight because we make sure the poles' attached pumps work correctly. That's one of the beautiful things about what we do that I don't think people really understand. We don't have to deal with blood. We don't have to deal with patients. But we still get to contribute to bettering that patient's life.\n\nI encouraged my son to follow in my footsteps — and it's been the highlight of my career\n\nI believe in this career path so much that when my son graduated from high school in 2020, during the height of the COVID-19 pandemic and without a clear path, I encouraged him to try the online program with the College of Biomedical Equipment Technology.\n\nSixteen months later, he had an associate degree and numerous job offers, including one from the company I work for. I got to be the one to tell him he got the job with us, and we both cried out of excitement. That moment beat every accolade I'd ever received in my own career.\n\nHe encouraged his son to pursue a career in HTM, and they briefly worked for the same company. Courtesy of Bryant K. Hawkins Sr.\n\nHe's been working the job for three years now and isn't interested in doing anything else. While he had to incur some debt to get his degree, he immediately started earning an annual salary that was three times what his tuition was, which you don't see with most colleges. He's been able to support himself on his own since he graduated — this really is an industry that allows you to take care of yourself.\n\nThe opportunities for BMETs are vast — the biggest challenge is awareness\n\nWhen I first started in the healthcare technology management industry, it was a little more challenging to find jobs. Today, the sky's the limit. There's a demand in every aspect of the industry and so much opportunity for growth. You can work in hospitals, for medical equipment manufacturers, on cruise ships, or as a traveling tech. You can be steady and stay put, or be adventurous and work across the country in a traveling biomedical equipment technician role.\n\nYou can get started with a certificate, an associate degree, or a bachelor's degree. There are even apprentice programs where you can get on-the-job training — a lot of technicians are coming into the industry that way.\n\nThe biggest challenge is that most people don't know about this industry. A lot of older BMETs are retiring, and not enough new people are entering to fill the gap. That's why I'm passionate about bringing awareness to this industry, which I do through speaking engagements and my podcast.\n\nHe said there are a lot of opportunities for BMETs, and he tries to bring more awareness to them. Annie Flanagan for BI\n\nI especially love introducing this field to kids, and I even wrote a children's book to get HTM careers on their radar. When I talk at schools, I tell kids, \"What you're about to hear about today you probably never knew existed. And when you leave, you're going to have something in your pocket that can probably change your life.\" I think that's true for everybody who reads this and considers the BMET career path.\n\nCorrection: June 11, 2025 — An earlier version of this story misstated when Bryant K. Hawkins Sr. and his son worked at the same company. They briefly worked for the same company earlier in their careers, but do not work for the same company in 2025."
    },
    {
        "title": "Sam Altman says his own kids will 'never be smarter than AI'",
        "description": "In the first episode of the OpenAI Podcast, CEO and cofounder Sam Altman spoke about the impact of new AI technology on his son's life.",
        "url": "https://www.businessinsider.com/sam-altman-kids-never-smarter-than-ai-chatgpt-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-18T21:07:37Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nOpenAI's CEO and cofounder, Sam Altman, recently said that new AI technology will have a net-positive impact on his infant son and potential future kids.\n\nAltman, who announced the birth of his first child on February 22, said his kids will grow up to be more capable — but not more intelligent — because of tools like ChatGPT.\n\n\"My kids will never be smarter than AI,\" Altman said on the first episode of the OpenAI Podcast, released on Wednesday. \"They will grow up vastly more capable than we grew up, and able to do things that we cannot imagine, and they'll be really good at using AI.\"\n\nAltman said he thinks more about what AI will provide the next generation than what it will take away.\n\n\"I don't think my kids will ever be bothered by the fact that they're not smarter than AI,\" he added.\n\nShortly after, Altman reiterated that advancements in AI technology will likely yield problems for future societies and social systems, including an increased number of people who are dependent on these tools — but he believes the benefits will ultimately outweigh the drawbacks.\n\n\"Again, I suspect this is not all going to be good,\" Altman told the podcast's host, Andrew Mayne. \"There will be problems. People will develop these somewhat problematic — or, maybe, very problematic — parasocial relationships, and, well, society will have to figure out new guardrails. But the upsides will be tremendous.\"\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nAltman, who described himself in the episode as \"extremely kid-pilled\" (meaning he believes \"everybody should have a lot of kids\"), also said ChatGPT plays a major role in his parenting style. He said in the first few weeks of his son's life, he was \"constantly\" asking the AI chatbot questions about how to provide basic care.\n\n\"Clearly, people have been able to take care of babies without ChatGPT for a long time,\" Altman said. \"I don't know how I would have done that.\"\n\nHowever, later in the episode, Altman also acknowledged that ChatGPT is known to \"hallucinate\" — that is, provide false information — and despite this, many users have placed a surprising amount of trust in the chatbot.\n\n\"People have a very high degree of trust in ChatGPT, which is interesting, because AI hallucinates,\" Altman said. \"It should be the tech that you don't trust that much.\""
    },
    {
        "title": "CEOs are trying to warn you: Use AI or else",
        "description": "Amazon CEO Andy Jassy warned that AI could eliminate some desk jobs. It's the latest call from CEOs for workers to embrace the technology.",
        "url": "https://www.businessinsider.com/amazon-jassy-ceos-warning-workers-ai-bring-massive-change-2025-6",
        "source": "Business Insider",
        "publishedAt": "2025-06-18T23:02:20Z",
        "full_text": "This story is available exclusively to Business Insider subscribers. Become an Insider and start reading now.\n\nThe latest corporate mantra: AI or bye-bye.\n\nAmazon CEO Andy Jassy's warning this week that expanding use of artificial intelligence will mean the company needs fewer people in some roles — and more in others — is the latest sign that, increasingly, CEOs see no place in the corporate world for AI holdouts.\n\nWhile messages that amount to \"learn AI or be left behind\" might be unnerving, corporate observers told Business Insider that it's ultimately better for cubicle dwellers to hear this message now, rather than when they're sidelined.\n\n\"If I were an employee, I would be very frustrated with my leader saying, 'No, we're still not sure if this is going to have an impact,'\" Christopher Myers, the faculty director of the Center for Innovative Leadership at the Johns Hopkins Carey Business School, told BI.\n\nInstead, he said, corporate leaders are wise to acknowledge that AI \"almost certainly\" will rejigger roles and entire org charts.\n\nSeveral other high-wattage CEOs are saying as much.\n\nOpenAI's Sam Altman said this month that AI agents were already starting to churn out work comparable to that of junior employees. That followed a warning in late May from Dario Amodei, who runs Anthropic, that AI could eliminate half of entry-level desk jobs within five years.\n\nEven Nvidia CEO Jensen Huang, who disagreed with Amodei's sobering take, has said AI is likely to change \"everyone's\" job — as it had already done to his.\n\nManaging humans and AI agents\n\nSalesforce chief Marc Benioff has also spoken regularly about the changes AI is bringing. He has said the software giant likely won't hire any more engineers in 2025 because AI is supercharging its existing workers. Benioff also said in a February call with investors that he tells fellow chiefs that they're the last generation of leaders to oversee only people.\n\n\"I think every CEO going forward is going to manage humans and agents together,\" he said.\n\nRelated stories Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know\n\nYet CEOs' straight talk doesn't always go over well with employees or customers. Luis von Ahn, CEO of Duolingo, said in a recent memo to staff that the language-learning company was going to be \"AI-first\" and that, as such, it would gradually stop turning to contractors when AI could do the job, among other changes. Some Duolingo users said the company was driving out workers in favor of AI.\n\nLater, von Ahn wrote on LinkedIn that one of the most important things leaders can do is to provide clarity. \"When I released my AI memo a few weeks ago, I didn't do that well,\" he wrote.\n\nIn the post, von Ahn added that while he didn't know exactly what would happen with AI, it would \"fundamentally change the way we work, and we have to get ahead of it.\"\n\nSome of that change could involve cutting workers. In its annual outlook on the future of jobs, the World Economic Forum said in January that among the more than 1,000 employers it surveyed globally, 41% said they planned to trim their workforce as AI takes on some tasks.\n\nClearing the way\n\nMyers, from Johns Hopkins, said Jassy's latest pronouncement on AI's impact could create space for other CEOs to have sometimes difficult discussions about how AI will affect workers.\n\n\"Having the frank conversation may be better than allowing people to just speculate wildly about whether it will or won't have an impact,\" he said.\n\nMyers said those who think they have AI all figured out are fooling themselves — as are those who think they can ignore it.\n\n\"Anyone who's putting their head in the sand is missing a very rapidly changing thing,\" he said.\n\nLeading workers through what are likely to be rapid changes is something leaders have to nail, Sarah Franklin, CEO of the HR software company Lattice, told BI. She said those in charge need to make clear that while prior periods of transition didn't occur as fast, it will be possible to get through this one.\n\nAt times, though, it could be a treacherous passage. Franklin said the structure of some organizations is shifting from a triangle shape — with a plethora of entry-level jobs at the bottom — to more of a diamond, as AI takes on more of the rote work once handled by less-experienced workers. That means the elimination of many starter roles.\n\nThere could be other challenges, as well. For all the zeal some CEOs have shown for AI's promise of soaring productivity, Melissa Swift, the founder and CEO of consultancy Anthrome Insight, told BI that she often hears from clients that the tech investments they've made aren't paying off.\n\nShe said one part of the problem is that companies need to orchestrate changes in how humans work, not just invest in shiny new technology.\n\nSwift said people often learn by playing with things. So, until more workers dig into AI, it could be hard for some bosses to bring about some of the widespread changes they're hoping for, she said.\n\nAnother challenge: Changing how organizations work is easier when technology is more or less static, Swift said. Yet AI is clocking massive gains in its abilities every few months.\n\n\"None of this stuff is mature,\" she said. \"We're doing the world's biggest beta test.\"\n\nLattice's Franklin said the speed of the technological changes is one reason it's essential that leaders communicate clearly with employees about what's underway — and that workers listen.\n\n\"Armageddon isn't happening,\" she said. \"But our world is evolving at a very fast pace.\""
    },
    {
        "title": "ICE Rolls Facial Recognition Tools Out to Officers' Phones",
        "description": "Plus: US feds charge alleged masterminds behind infamous forum, Scattered Spider targets airlines, and hackers open a valve at a Norwegian dam.",
        "url": "https://www.wired.com/story/ice-rolls-facial-recognition-tools-out-to-officers-phones/",
        "source": "Wired",
        "publishedAt": "2025-06-28T10:30:00Z",
        "full_text": "WIRED published a shocking investigation this week based on records, including audio recordings, of hundreds of emergency calls from United States Immigration and Customs Enforcement (ICE) detention centers. The calls—which include reports of incidents of staff sexual assaults, suicide attempts, and head injuries—indicate a system inundated by life-threatening incidents, delayed treatment, and overcrowding.\n\nIn a 6-3 decision on Friday, the US Supreme Court upheld a Texas porn ID law, finding that age verification for explicit sites is constitutional. In a dissent, Justice Elena Kagan warned that this determination ignores First Amendment precedent and will have privacy implications for adults.\n\nLooking at the US bombing of Iranian nuclear sites last weekend, President Donald Trump posted initial announcements of the strikes on the social Network Truth Social, which then began suffering intermittent outages. And WIRED reported on assessments of the damage to the nuclear sites based on satellite photos taken before and after the bombing.\n\nMeanwhile, Taiwan is scrambling to make its own unmanned aerial vehicles domestically as drones increasingly become a crucial weapon of war. The urgency comes as a potential conflict with China looms. And Telegram launched a purge of Chinese cryptocurrency markets last month, banning black markets that sold tens of billions of dollars in crypto-scam-related services. Now, though, the markets are rebranding and bouncing back with no further action from the communication platform.\n\nBut wait, there’s more! Each week, we round up the security and privacy news we didn’t cover in depth ourselves. Click the headlines to read the full stories. And stay safe out there.\n\nImmigration and Customs Enforcement (ICE) is now using a mobile app called Mobile Fortify that allegedly allows agents to identify individuals by pointing a smartphone at their face or capturing contactless fingerprints, 404 Media reports. The app reportedly taps into government databases, including Customs and Border Protection’s Traveler Verification Service and a DHS biometric intelligence system, in an attempt to match facial images taken in the field against prior government-collected records. ICE says the tool is intended to help officers identify “unknown subjects,” but civil liberties advocates tell 404 Media that it may open the door to surveillance-driven profiling and wrongful arrests.\n\nNathan Freed Wessler of the ACLU told the site, “Face recognition technology is notoriously unreliable, frequently generating false matches and resulting in a number of known wrongful arrests across the country. Immigration agents relying on this technology to try to identify people on the street is a recipe for disaster. Congress has never authorized DHS to use face recognition technology in this way, and the agency should shut this dangerous experiment down.\"\n\nGlobal law enforcement this week announced the bust of a group of alleged cybercriminal hackers accused of carrying out years of profit-focused data breaches and running a notorious cybercriminal forum and market known as Breachforums. French authorities arrested four members of the group who went by the names “ShinyHunters,” “Hollow,” “Noct,” and “Depressed,” though the police sources who shared the news with the French newspaper Le Parisien didn’t reveal the suspects’ real names. The US Justice Department, meanwhile, criminally charged Kai West, a young British man, with carrying out a broad, years-long hacking spree under the handle “Intelbroker” that inflicted $25 million total damage against victims before he was arrested in February. In addition to hacking and selling vast troves of stolen data, the group—or at least some subset of its members—appears to have served as administrators for Breachforums, a notorious sales forum for cybercriminal information and tools that was shut down in a law enforcement operation in 2023 but was later relaunched by its staff.\n\nThe loose cybercriminal gang known as Scattered Spider has carried out data theft and ransomware incidents for years, most recently targeting the grocery industry, other retailers, and the insurance industry in the US and the UK. Now cybersecurity analysts at Mandiant and Palo Alto Networks say the group is turning their attention to the aviation and transportation sector. Specifically, hackers were behind a cybersecurity incident last week that took down some IT systems and the mobile app for Canadian airline WestJet, Axios reports. Now Hawaiian Airlines has said it’s experiencing a “cybersecurity incident” affecting its network, though it hasn’t yet revealed more details or any evidence that Scattered Spider is responsible. Cybersecurity firms tracking the group warn that other potential aviation and transportation industry targets should be on the lookout for the group, which often uses sophisticated social engineering to trick staff into letting them bypass multi-factor authentication and gain a foothold on target systems.\n\nHere’s a curiosity that we missed a couple weeks ago: A rare industrial control system hijacking incident in which an unknown hacker appears to have messed with the computer systems that control the Lake Risevatnet dam in southwest Norway, opening a valve to its maximum setting. The tampering, the motivation for which was far from clear, increased the dam’s water flow by nearly 500 liters a second, but didn’t come close to approaching a dangerous level. No one appears to have spotted the change for close to four hours. Officials told the Norwegian energy news outlet Energiteknikk, which broke the story, that a weak password on a web-accessible control panel allowed the unauthorized access."
    },
    {
        "title": "Spending Review to include £86bn science and tech package",
        "description": "The government says every corner of the country will benefit, but research backers call for a long-term plan for science.",
        "url": "https://www.bbc.com/news/articles/cn7zngr6jn5o",
        "source": "BBC News",
        "publishedAt": "2025-06-08T08:09:04Z",
        "full_text": "Spending Review to include £86bn science and tech package\n\n8 June 2025 Share Save Adam Hale BBC News Marc Ashdown Business correspondent Share Save\n\nGetty Images Areas like Newport in Wales, home to the UK's biggest semiconductor manufacturing facility, will be allowed to decide how investment is targeted in their communities.\n\nThe government has said it will spend £86bn on the science and technology sector by the end of this Parliament, ahead of Wednesday's Spending Review. The package will help fund research into drug treatments and longer-lasting batteries, and include up to £500m for regions across the UK with local leaders having a say on how it is spent. Chancellor Rachel Reeves, whose review will outline day-to-day departmental and investment budgets over the next few years, said investing in the sector would create jobs and boost security. But research backers have warned that the government needs to do more to secure the UK's reputation for science on the world stage.\n\nReeves will set out departmental spending plans on Wednesday, with the package for science and technology expected to be worth more than £22.5 billion-a-year by 2029. The Department for Science, Innovation and Technology said \"every corner of the country\" would benefit, with communities able to direct funding to expertise specific to their areas. In Liverpool, which has a long history in biotech, funding will be used to speed up drug discovery. Northern Ireland will receive money to develop defence equipment, while south Wales will use the money to design microchips used to power mobile phones and electric cars. The chancellor said: \"Britain is the home of science and technology. Through the plan for change, we are investing in Britain's renewal to create jobs, protect our security against foreign threats and make working families better off.\"\n\nTony McBride, director of policy and public affairs at the Institute of Physics, welcomed the funding but said the government would need to commit to a decade-long plan to train workers. \"This must include a plan for the skilled workforce we need to deliver this vision, starting with teachers and addressing every educational stage, to underpin the industrial strategy,\" he said. John-Arne Rottingen, chief executive of Britain's biggest non-governmental research funder Wellcome, warned that visa costs for scientists from overseas, financial challenges at universities and a budget that was not adjusted for inflation could hamper the government's ambitions. \"The UK should be aiming to lead the G7 in research intensity, to bring about economic growth and the advances in health, science and technology that benefit us all.\"\n\nGetty Images The chancellor has warned that her Spending Review will reflect a squeeze on government funding."
    },
    {
        "title": "This Chatbot Tool Pays Users $50 a Month for Their Feedback on AI Models",
        "description": "On Yupp, chatbot users earn cash by saying which of two prompts they prefer—info that has great value to the AI companies running the models",
        "url": "https://www.wired.com/story/yupp-chatbot-pays-users-ai-model-feedback/",
        "source": "Wired",
        "publishedAt": "2025-06-13T11:00:00Z",
        "full_text": "To show off how easy it is for users to earn money by using his new chatbot platform, Pankaj Gupta offers to cash out $1 worth of Yupp credits, sending it to me over Venmo or PayPal. I’m talking with Gupta in the WIRED office during a prelaunch demo of Yupp, which comes out of stealth mode today. Journalistic ethics forbid accepting gifts from sources, so I politely decline. He proceeds to send it over PayPal to his Stanford alumni email.\n\nGupta is the CEO of Yupp, which is free to use and available globally. The website looks similar to other generative AI tools like ChatGPT. There’s a prompt box, a way to attach files, and a log of past conversations.\n\nThe main difference is that every time users ask Yupp a question, they’ll see two answers, generated by two different models and displayed side by side. Yupp routes prompts to a pair of large language models, choosing from a pool of over 500 models that includes products from leading US generative AI companies like OpenAI, Google, and Anthropic, as well as international releases, like models from Alibaba, DeepSeek, and Mistral.\n\nAfter looking over the two answers, users pick the response they like best, then provide feedback explaining why. For their effort, they earn a digital scratch card with Yupp credits.\n\n\"You're not being employed, but you can make a little bit of money,” says Gupta. In my testing, the Yupp credits on the scratch cards typically ranged from zero to around 250, though they occasionally went higher. Every 1,000 credits can be exchanged for $1. Users can cash out a maximum of $10 a day and $50 a month.\n\nCourtesy of Yupp\n\nNot sure where to start while testing this web app, I turned to the range of prewritten topics flickering beneath Yupp’s prompt bar, which spanned from news topics, like David Hogg leaving the Democratic National Committee, to ideas for image-creation prompts, like generating a crochet-looking surfer. (Yupp’s models can generate text or images.) I eventually chose to have the bots explain different perspectives on the current Los Angeles protests."
    },
    {
        "title": "Texas Lawmakers Want More Control of the Tesla Robotaxis on Their Roads",
        "description": "WIRED spoke to Texas State Senator Sarah Eckhardt, who represents part of the area in Austin served by Tesla’s new and limited robotaxi service.",
        "url": "https://www.wired.com/story/texas-lawmakers-control-of-tesla-robotaxis/",
        "source": "Wired",
        "publishedAt": "2025-06-26T11:30:00Z",
        "full_text": "As a small number of Tesla robotaxis continue to pick up and drop off a select few Tesla influencers in Austin, Texas, a state legislator who represents part of the electric automakers’ limited service area says she’s concerned the cars’ driving is “less reliable” than the typical human driver.\n\nVideos posted online show some “moving violations” that “could be very serious,” state senator Sarah Eckhardt, a Democrat who represents Texas’ 14th district, told WIRED in an interview. “My constituency is particularly tech savvy and excited about this [autonomous vehicle] technology, but my constituency is also very concerned about public safety, and we can hit the right balance.”\n\nLast week, as the hours before the debut of Tesla’s robotaxi service ticked down, Eckhardt was one of seven Texas Democratic lawmakers who sent a letter to Tesla field quality director Eddie Gates asking the company to delay its plans to launch. Texas has for years had loose rules and oversight around autonomous vehicle operations, making it an attractive place for tech developers to test and launch. But a new law requiring AV companies to comply with \"basic safety guardrails” passed this spring and will kick in on September 1, and the lawmakers were “formally requesting” Tesla wait until then to put its driverless cars on Austin’s roads.\n\n“We believe that this is in the best interest of both public safety and building public trust in Tesla’s operations,” the lawmakers wrote. If Tesla chose to go ahead with the scheduled June 22 launch, the lawmakers requested \"detailed information\" about how Tesla will comply with the new law.\n\nEckhardt, the first to sign the letter, hasn’t heard from Tesla since, even after the company launched its service Sunday. “They’re sometimes difficult to get a hold of,” she says.\n\nStill, Eckhardt credits the lawmakers’ pressure for Tesla’s decision to leave a human monitor in the front passenger seat of each robotaxi. According to videos posted by riders, these people seem to have some power to intervene when the technology doesn’t perform as expected. (Tesla did not respond to any of WIRED’s questions for this story.)"
    },
    {
        "title": "OpenAI’s Unreleased AGI Paper Could Complicate Microsoft Negotiations",
        "description": "The partnership between OpenAI and Microsoft in many ways hinges on the definition of artificial general intelligence, creating a tension that has spilled over into OpenAI research that has not been made public.",
        "url": "https://www.wired.com/story/openai-five-levels-agi-paper-microsoft-negotiations/",
        "source": "Wired",
        "publishedAt": "2025-06-27T19:35:29Z",
        "full_text": "A small clause inside OpenAI’s contract with Microsoft, once considered a distant hypothetical, has now become a flashpoint in one of the biggest partnerships in tech.\n\nThe clause states that if OpenAI’s board ever declares it has developed artificial general intelligence (AGI), it would limit Microsoft’s contracted access to the startup’s future technologies. Microsoft, which has invested more than $13 billion in OpenAI, is now reportedly pushing for the removal of the clause and is considering walking away from the deal entirely, according to the Financial Times.\n\nLate last year, tensions around AGI’s suddenly pivotal role in the Microsoft deal spilled into a debate within OpenAI over an internal research paper, according to multiple sources familiar with the matter. Titled “Five Levels of General AI Capabilities,” the paper outlines a framework for classifying progressive stages of AI technology. By making specific assertions about future AI capabilities, sources claim, the paper could have complicated OpenAI’s ability to declare that it had achieved AGI, a potential point of leverage in negotiations.\n\n“We’re focused on developing empirical methods to evaluate AGI progress—work that is reproducible, measurable, and useful to the broader field,” OpenAI spokesperson Lindsay McCallum said in a written comment to WIRED. “The ‘Five Levels’ was an early attempt at classifying stages and terminology to describe general AI capabilities. This was not a scientific research paper.” Microsoft declined to comment.\n\nIn a blog post describing its corporate structure, OpenAI notes that AGI “is excluded from IP licenses and other commercial terms with Microsoft.” OpenAI defines AGI as \"a highly autonomous system that outperforms humans at most economically valuable work.”\n\nThe two companies have been renegotiating their agreement as OpenAI prepares a corporate restructuring. While Microsoft wants continued access to OpenAI’s models even if the startup declares AGI before the partnership ends in 2030, one person familiar with the partnership discussions tells WIRED that Microsoft doesn’t believe OpenAI will reach AGI by that deadline. But another source close to the matter describes the clause as OpenAI’s ultimate leverage. Both sources have been granted anonymity to speak freely about private discussions.\n\nAccording to the Wall Street Journal, OpenAI has even considered whether to invoke the clause based on an AI coding agent. The talks have grown so fraught that OpenAI has reportedly discussed if it should publicly accuse Microsoft of anticompetitive behavior, per the Journal.\n\nA source familiar with the discussions, granted anonymity to speak freely about the negotiations, says OpenAI is fairly close to achieving AGI; Altman has said he expects to see it during Donald Trump’s current term.\n\nThat same source suggests there are two relevant definitions: First, OpenAI’s board can unilaterally decide the company has reached AGI as defined in its charter, which would immediately cut Microsoft off from accessing the technology or revenue derived from AGI; Microsoft would still have rights to everything before that milestone. Second, the contract includes a concept of sufficient AGI, added in 2023, which defines AGI as a system capable of generating a certain level of profit. If OpenAI asserts it has reached that benchmark, Microsoft must approve the determination. The contract also bars Microsoft from pursuing AGI on its own or through third parties using OpenAI’s IP."
    },
    {
        "title": "Controversial project to create artificial human DNA begins",
        "description": "Scientists start a controversial project to create the building blocks of human life, in what is thought to be a world first.",
        "url": "https://www.bbc.com/news/articles/c6256wpn97ro",
        "source": "BBC News",
        "publishedAt": "2025-06-26T00:09:45Z",
        "full_text": "Work begins to create artificial human DNA from scratch\n\n26 June 2025 Share Save Pallab Ghosh • @BBCPallab Science Correspondent Gwyndaf Hughes Science Videographer Share Save\n\nHow the researchers hope to create human DNA\n\nWork has begun on a controversial project to create the building blocks of human life from scratch, in what is believed to be a world first. The research has been taboo until now because of concerns it could lead to designer babies or unforeseen changes for future generations. But now the World's largest medical charity, the Wellcome Trust, has given an initial £10m to start the project and says it has the potential to do more good than harm by accelerating treatments for many incurable diseases. Dr Julian Sale, of the MRC Laboratory of Molecular Biology in Cambridge, who is part of the project, told BBC News the research was the next giant leap in biology. \"The sky is the limit. We are looking at therapies that will improve people's lives as they age, that will lead to healthier aging with less disease as they get older. \"We are looking to use this approach to generate disease-resistant cells we can use to repopulate damaged organs, for example in the liver and the heart, even the immune system,\" he said. But critics fear the research opens the way for unscrupulous researchers seeking to create enhanced or modified humans. Dr Pat Thomas, director of the campaign group Beyond GM, said: \"We like to think that all scientists are there to do good, but the science can be repurposed to do harm and for warfare\". Details of the project were given to BBC News on the 25th anniversary of the completion of the Human Genome Project, which mapped the molecules in human DNA and was also largely funded by Wellcome.\n\nGetty Images Artwork: The aim is to build sections of human DNA from scratch\n\nEvery cell in our body, with the exception of red blood cells, contains a molecule called DNA which carries the genetic information it needs. DNA is built from just four much smaller blocks referred to as A, G, C and T, which are repeated over and over again in various combinations. Amazingly it contains all the genetic information that physically makes us who we are. The Human Genome Project enabled scientists to read all human genes like a bar code. The new work that is getting under way, called the Synthetic Human Genome Project, potentially takes this a giant leap forward – it will allow researchers not just to read a molecule of DNA, but to create parts of it – maybe one day all of it - molecule by molecule from scratch.\n\nBBC News Scientists will begin developing tools to create ever larger sections of human DNA\n\nThe scientists' first aim is to develop ways of building ever larger blocks of human DNA, up to the point when they have synthetically constructed a human chromosome. These contain the genes that govern our development, repair and maintenance. These can then be studied and experimented on to learn more about how genes and DNA regulate our bodies. Many diseases occur when these genes go wrong so the studies could lead to better treatments, according to Prof Matthew Hurles, director of the Wellcome Sanger Insititute which sequenced the largest proportion of the Human Genome. \"Building DNA from scratch allows us to test out how DNA really works and test out new theories, because currently we can only really do that by tweaking DNA in DNA that already exists in living systems\".\n\nBBC News Machines at the Sanger Institute were used to sequence the human genome"
    },
    {
        "title": "Applebee’s and IHOP have plans for AI",
        "description": "Applebee’s and IHOP plan to launch an AI-powered “personalization engine” that could help its restaurants provide recommendations and customized deals, according to a report from The Wall Street Journal. The personalization engine would use a customer’s past …",
        "url": "https://www.theverge.com/news/690458/applebees-ihop-ai-restaraunt-recommendations",
        "source": "The Verge",
        "publishedAt": "2025-06-20T17:21:52Z",
        "full_text": "is a news writer who covers the streaming wars, consumer tech, crypto, social media, and much more. Previously, she was a writer and editor at MUO.\n\nApplebee’s and IHOP plan to launch an AI-powered “personalization engine” that could help its restaurants provide recommendations and customized deals, according to a report from The Wall Street Journal. The personalization engine would use a customer’s past purchases — or the orders of customers similar to them — to make recommendations.\n\nJustin Skelton, the chief information officer at the restaurants’ parent company, Dine Brands, tells the Journal that an AI-powered personalization system would be designed to boost customer loyalty, as well as serve as a way to upsell products. As noted by the Journal, IHOP already has some information about its customers’ ordering habits through its rewards program.\n\nAs noted by the Journal, Dine Brands is considering rolling out AI tools designed for staff members as well. Along with exploring the use of AI-powered cameras to detect when a table needs cleaning, it’s also testing an AI app for managers."
    },
    {
        "title": "Tesla’s robotaxis are operating in a regulatory vacuum",
        "description": "This week, Tesla launched its long-promised robotaxi service in Austin, and almost immediately its vehicles were caught fucking up. In a YouTube video, a Tesla robotaxi briefly drives on the wrong side of the road. Another video shared by Ed Niedermeyer, the …",
        "url": "https://www.theverge.com/tesla/691975/tesla-robotaxi-mistake-nhtsa-regulatory-weak",
        "source": "The Verge",
        "publishedAt": "2025-06-24T17:12:21Z",
        "full_text": "is transportation editor with 10+ years of experience who covers EVs, public transportation, and aviation. His work has appeared in The New York Daily News and City & State.\n\nThis week, Tesla launched its long-promised robotaxi service in Austin, and almost immediately its vehicles were caught fucking up.\n\nIn a YouTube video, a Tesla robotaxi briefly drives on the wrong side of the road. Another video shared by Ed Niedermeyer, the author of a book about Tesla’s origins, shows a robotaxi braking hard in the middle of the road in response to stationary police vehicles that were not in its immediate driving path. And a third captures a robotaxi dropping off its passengers in the middle of a busy intersection.\n\nTypically, when a driverless vehicle makes a mistake or is involved in a crash, the National Highway Traffic Safety Administration launches an investigation. And that’s just what happened yesterday, when the agency released a statement to Bloomberg that said it was reviewing the incident and would “take any necessary actions to protect road safety.”\n\nDriving in the wrong lane, braking hard in the middle of the road, dropping passengers off in the middle of an intersection\n\nThat may leave you with the impression that Tesla has been put on notice. One more mistake, one more close call, and NHTSA will bring the smackdown. Except that’s not really what will happen.\n\nUnder Donald Trump’s administration, the federal government’s ability to effectively regulate autonomous vehicle operators has been drastically diminished. The Department of Government Efficiency, led by Elon Musk himself, has laid off tens of thousands of federal workers, including dozens of safety regulators at NHTSA — the very agency charged with overseeing the safe rollout of robotaxis. Consumer protections have been further kneecapped over the years thanks to the right-leaning courts, including the Supreme Court’s decision to overturn the Chevron deference.\n\nIn a sense, Tesla is operating in a regulatory vacuum. And that is very good for Elon Musk and his plan to put “a million” robotaxis on the road by the end of 2026.\n\nThis is not unique to the current Trump administration. Other administrations have similarly taken a hands-off approach to autonomous vehicles, in the name of “fostering innovation.” From the Obama administration through the first Trump administration and into the Biden White House, top government officials have cleared the way for self-driving cars to hit the road with as few regulatory roadblocks as possible. These officials have fully bought into the marketing materials put forward by the automakers and tech companies that autonomous vehicles could help solve the safety crisis on our roads — to say nothing about their potential as a cash cow for their owners.\n\nThis has continued up through today, with the US Department of Transportation recently announcing its intention to fast-track requests for exemptions from federal safety rules requiring autonomous vehicles to have traditional controls like steering wheels, pedals, and mirrors — vehicles like Tesla’s Cybercab. In the announcement, Transportation Secretary Sean Duffy noted that the exemption process has been “bogging developers down in unnecessary red tape that makes it impossible to keep pace with the latest technologies.”\n\nThe rush to exempt automakers from certain safety requirements when it comes to self-driving cars should raise a lot of red flags, especially when it comes to Elon Musk, who has long thumbed his nose at those very rules. Tesla’s rush to be the first to bring partially autonomous technology to market has resulted in billions of dollars of revenue for the company — and also numerous deaths from the crashes involving the company’s driver-assist products. There have been at least 58 people killed while using Tesla’s Autopilot and Full Self-Driving products over the years, according to a website tracker.\n\nThe rush to exempt automakers from certain safety requirements when it comes to self-driving cars should raise a lot of red flags\n\nNHTSA isn’t turning a blind eye to those incidents — its launched a series of investigations into Autopilot and issued at least two recalls — but it lacks an ability to rein in Tesla. Last year, a group of six Democratic senators sounded the alarm about the hands-off approach to automation taken by NHTSA, questioning why the agency hasn’t ordered the company to disable its partially automated technology to prevent further crashes. The National Transportation Safety Board, NHTSA’s sister agency, has also blasted it for its inability to regulate companies like Tesla.\n\nKeep in mind, all of this is prior to Trump’s second victory and Musk’s ascendency to the role of chief chainsaw wielder. Under DOGE, NHTSA has fewer people on staff to make the necessary calls when something goes wrong. Even if the agency does decide to drop the hammer on Tesla, who’s say some embedded DOGE appointee won’t overrule them? And would the decision even hold up in court if Tesla decides to ignore it?\n\nIn this regulatory vacuum, states are left holding the bag. California’s Department of Motor Vehicles effectively ended Cruise’s robotaxi adventures when it suspended its permit following a grisly crash that injured a pedestrian. It could do the same for Tesla should the company follow through on its plans to launch there. Texas has far fewer safeguards in place, though it’s making a belated attempt at correcting that.\n\nBut states are only supposed to regulate drivers. They lack the recall authority of the federal government, which can order a company to discontinue its autonomous technology if proven to be unsafe. But proving that takes time and resources — both of which the current administration seems unlikely to allow."
    },
    {
        "title": "AI Is Dehumanization Technology",
        "description": "A call to reject the deployment and use of AI systems in Canada's public sector.",
        "url": "https://thedabbler.patatas.ca/pages/ai-is-dehumanization-technology.html",
        "source": "Patatas.ca",
        "publishedAt": "2025-06-26T19:41:35Z",
        "full_text": "AI is Dehumanization Technology\n\nAI systems are an attack on workers, climate goals, our information environment, and civil liberties. Rather than enhancing our human qualities, these systems degrade our social relations, and undermine our capacity for empathy and care. The push to adopt AI is, at its core, a political project of dehumanization, and serious consideration should be given to the idea of rejecting the deployment of these systems entirely, especially within Canada's public sector.\n\nAt the end of February, Elon Musk - whose xAI data centre is being powered by nearly three dozen on-site gas turbines that are poisoning the air of nearby majority-Black neighborhoods in Memphis - went on the Joe Rogan podcast and declared that \"the fundamental weakness of western civilization is empathy\", describing \"the empathy response\" as a \"bug\" or \"exploit\" in our collective programming.\n\nThis is part of a broader movement among Silicon Valley tech oligarchs and a billionaire-aligned political elite to advance a disturbing notion: that by abandoning our deeply-held values of justice, fairness, and duty toward one another - in short, by abandoning our humanity - we are in fact promoting humanity's advancement. It's clearly absurd, but if you're someone whose wealth and power are predicated on causing widespread harm, it's probably easier to sleep at night if you can tell yourself that you're serving a higher purpose.\n\nAnd, well, their AI systems and infrastructure cause an awful lot of harm.\n\nTo get to the root of why AI systems are so socially corrosive, it helps to first step back a bit and look at how they work. Physicist and critical AI researcher Dan McQuillan has described AI as 'pattern-finding' tech. For example, to create an LLM such as ChatGPT, you'd start with an enormous quantity of text, then do a lot of computationally-intense statistical analysis to map out which words and phrases are most likely to appear near to one another. Crunch the numbers long enough, and you end up with something similar to the next-word prediction tool in your phone's text messaging app, except that this tool can generate whole paragraphs of mostly plausible-sounding word salad.\n\nWhat's important to note here is that the machine's outputs are solely based on patterns of statistical correlation. The AI doesn't have an understanding of context, meaning, or causation. The system doesn't 'think' or 'know', it just mimics the appearance of human communication. That's all. Maybe the output is true, or maybe it's false; either way the system is behaving as designed.\n\nAutomating bias\n\nWhen an AI confidently recommends eating a deadly-poisonous mushroom, or summarizes text in a way that distorts its meaning - perhaps a research paper, or maybe one day an asylum claim - the consequences can range from bad to devastating. But the problems run deeper still: AI systems can't help but reflect the power structures, hierarchies, and biases present in their training data. A 2024 Stanford study found that the AI tools being deployed in elementary schools displayed a \"shocking\" degree of bias; one of the LLMs, for example, routinely created stories in which students with names like Jamal and Carlos would struggle with their homework, but were \"saved\" by a student named Sarah.\n\nAs alarming as that is, at least those tools exhibit obvious bias. Other times it might not be so easy to tell. For instance, what happens when a system like this isn't writing a story, but is being asked a simple yes/no question about whether or not an organization should offer Jamal, Carlos, or Sarah a job interview? What happens to people's monthly premiums when a US health insurance company's AI finds a correlation between high asthma rates and home addresses in a certain Memphis zip code? In the tradition of skull-measuring eugenicists, AI provides a way to naturalize and reinforce existing social hierarchies, and automates their reproduction.\n\nThis is incredibly dangerous, particularly when it comes to embedding AI inside the public sector. Human administrators and decision-makers will invariably have biases and prejudices of their own, of course - but there are some important things to note about this. For one thing, a diverse team can approach decisions from multiple angles, helping to mitigate the effects of individual bias. An AI system, insofar as we can even say it 'approaches' a problem, does so from a single, culturally flattened and hegemonic perspective. Besides, biased human beings, unlike biased computers, are aware that we can be held accountable for our decisions, whether via formal legal means, professional standards bodies, or social pressure.\n\nAlgorithmic systems can't feel those societal constraints, because they don't think or feel anything at all. But the AI industry continues to tell us that at some point, somehow, they will solve the so-called 'AI alignment problem', at which point we can trust their tools to make ethical, unbiased decisions. Whether it's even possible to solve this problem is still very much an open debate among experts, however.\n\nPossible or not, we're told that in the meantime, we should always have human beings double-checking their systems' outputs. That might sound like a good solution, but in reality it opens a whole new can of worms. For one thing, there's the phenomenon of 'automation bias' - the tendency to rely on an automated system's result more than one's own judgement - something that affects people of all levels of skill and experience, and undercuts the notion that error and bias can be reliably addressed by having a 'human in the loop'.\n\nThen there's the deskilling effect. Despite AI being touted as a way to 'boost productivity', researchers are consistently finding that these tools don't result in productivity gains. So why do people in positions of power continue to push for AI adoption? The logical answer is that they want an excuse to fire workers, and don't care about the quality of work being done.\n\nThis attack on labour becomes a self-reinforcing cycle. With a smaller team, workers get overloaded, and increasingly need to rely on whatever tools are at their disposal, even as those tools devalue their skills and expertise. This drives down wages, reduces bargaining power, and opens the door for further job cuts - and likely for privatization.\n\nWorse still, it seems that the Canadian federal government is actively pursuing policy that could reinforce this abusive dynamic further; the 2024 Fall Economic Statement included a proposal that would, using public money, incentivize our public pension funds to invest in AI data centres to the tune of tens of billions of dollars.\n\nSuffocating the soul of the public service\n\nI'd happily wager that when people choose careers in the public sector, they rarely do so out of narrow self-interest. Rather, they choose this work because they're mission-oriented: they want the opportunity to express care through their work by making a positive difference in people's lives. Often the job will entail making difficult decisions. But that's par for the course: a decision isn't difficult if the person making it doesn't care about doing the right thing.\n\nAnd here's where we start to get to the core of it all: human intelligence, whatever it is, definitely isn't reducible to just logic and abstract reasoning; feeling is a part of thinking too. The difficulty of a decision isn't merely a function of the number of data points involved in a calculation, it's also about understanding, through lived experience, how that decision will affect the people involved materially, psychologically, emotionally, socially. Feeling inner conflict or cognitive dissonance is a good thing, because it alerts us to an opportunity: it's in these moments that we're able to learn and grow, by working through an issue to find a resolution that expresses our desire to do good in the world.\n\nAI, along with the productivity logic of those pushing its adoption, short-circuits that reflective process before it can even begin, by providing answers at the push of a button or entry of a prompt. It turns social relations into number-crunching operations, striking a technocratic death blow to the heart of what it means to have a public sector in the first place.\n\nThe dehumanizing effects of AI don't end there, however. Meredith Whittaker, president of the Signal Foundation, has described AI as being fundamentally \"surveillance technology\". This rings true here in many ways. First off, the whole logic of using AI in government is to render members of the public as mere collections of measurements and data points. Meanwhile, AI also acts as a digital intermediary between public sector workers and service recipients (or even between public employees, whenever they generate an email or summarize a meeting using AI), an intermediary that's at least capable of keeping records of each interaction, if not influencing or directing it.\n\nThis doesn't inescapably lead to a technological totalitarianism. But adopting these systems clearly hands a lot of power to whoever builds, controls, and maintains them. For the most part, that means handing power to a handful of tech oligarchs. To at least some degree, this represents a seizure of the 'means of production' from public sector workers, as well as a reduction in democratic oversight.\n\nLastly, it may come as no surprise that so far, AI systems have found their best product-market fit in police and military applications, where short-circuiting people's critical thinking and decision-making processes is incredibly useful, at least for those who want to turn people into unhesitatingly brutal and lethal instruments of authority.\n\nAI systems reproduce bias, cheapen and homogenize our social interactions, deskill us, make our jobs more precarious, eliminate opportunities to practice care, and enable authoritarian modes of surveillance and control. Deployed in the public sector, they undercut workers' ability to meaningfully grapple with problems and make ethical decisions that move our society forward. These technologies dehumanize all of us. Collectively, we can choose to reject them."
    },
    {
        "title": "TP-Link AX1800 WiFi 6 Router Gets Second Price Drop in Two Days, Now Nearly Free on Amazon",
        "description": "The TP-Link AX21 is certainly one of the most popular WiFi 6 router models on the market right now.",
        "url": "https://gizmodo.com/tp-link-ax1800-wifi-6-router-gets-second-price-drop-in-two-days-now-nearly-free-on-amazon-2000613027",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-09T11:40:36Z",
        "full_text": ""
    },
    {
        "title": "Scientists Launch Wild New Project to Build a Human Genome From Scratch",
        "description": "The medical charity behind the controversial new plan says the benefits outweigh the risks.",
        "url": "https://gizmodo.com/scientists-launch-wild-new-project-to-build-a-human-genome-from-scratch-2000620762",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-29T14:00:04Z",
        "full_text": ""
    },
    {
        "title": "UGREEN 65W 4-Port Charger Block: It’s Not Free, But Nearly Free on Amazon",
        "description": "This charger block has four ports and lets you charge your laptop and smartphone together.",
        "url": "https://gizmodo.com/ugreen-65w-4-port-charger-block-its-not-free-but-nearly-free-on-amazon-2000612891",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-07T16:26:17Z",
        "full_text": ""
    },
    {
        "title": "For 9 Days, Earth Was Sending Out Mysterious Signals. Now We Know What They Were.",
        "description": "NASA technology traced the pulsing back to a massive tsunami.",
        "url": "https://www.popularmechanics.com/science/environment/a65011788/greenland-megatsunami-waves/",
        "source": "Popular Mechanics",
        "publishedAt": "2025-06-10T12:00:00Z",
        "full_text": "Gear-obsessed editors choose every product we review. We may earn commission if you buy from a link. Why Trust Us?\n\nHere’s what you’ll learn when you read this story:\n\nStrange signals coming from the Arctic in 2023 were assumed to be a seiche (trapped water with waves sloshing back and forth), but this was never confirmed.\n\nPrevious instruments used to measure seismic weather phenomena were not able to pick up enough information, but NASA’s SWOT satellite eventually found that the signal actually was from a seiche caused by a landslide.\n\nReconstructions of what the weather was like during the days SWOT picked up the signal also show that it couldn’t have been anything but a seiche.\n\nAs fascinating as bizarre signals from other planets can be—teaching us about earthquakes on Mars or auroras in the skies of Jupiter—sometimes even weirder signals come from weather extremes happening right here on Earth.\n\nFor nine days in 2023, an unknown seismic pulse was generated by the Earth every 90 seconds. It first appeared that September, vanished, and then returned in October. The signals began after a landslide triggered by a megatsunami in Dickson Fjord, Greenland, and was thought to have been produced by a seiche, or standing wave. This wave had probably been stirred up by the tsunami and then trapped by ice in the fjord—but there was no way to prove it.\n\nRelated Story What Will Happen When the Moon Leaves Earth Orbit?\n\nSatellite observations were able to document avalanches and the tsunamis they caused, and scientists collected further data in a research station. There was just one problem—the hypothesized seiche was eluding detection. It remained a mystery, even though studies at the time found seismic data that seemed to align with the sloshing motions of standing waves. So, researcher Thomas Monahan of Oxford University decided to take a closer look.\n\nUsing data from the KaRIn (Ka-band Radar Interferometer) instrument on board NASA’s Surface Water Ocean Topography (SWOT) satellite—an international collaboration capable of high-resolution measurements that extended into Dickson fjord—Monahan and his team finally found evidence for a seiche whose waves were slowly losing intensity.\n\n“Based on the seismic attribution, and systematic ruling out of other dynamic phenomena, we conclude that the observed variability in the SWOT data is consistent with that of a slowly decaying seiche,” the team in a study recently published in Nature Communications.\n\nSeiches can occur in lakes and other enclosed (or partially enclosed) bodies of water. The tsunami unleashed in Dickson Fjord had enough strength to leave powerful winds and sudden atmospheric pressure shifts in its wake, pushing water from one end of the enclosure to the other. The water then sloshed back and forth, oscillating for anywhere from hours to days after winds ceased. Tsunamis are often seismic phenomena, and the very long period (VLP) seismic signal that came from the fjord was the aftermath of a tsunamigenic landslide.\n\nPrevious attempts at recording evidence for this particular seiche had been thwarted by the limitations of satellite altimeters, which did not pick up data during extended gaps between observations. They were also not able to record the differences in the height of waves beyond the area directly under the satellite.\n\nRelated Story This Unlimited Energy Could Power Earth Forever\n\nThey were, however, able to get an especially accurate read on the water below. The landslides in Dickson Fjord happened right when SWOT was transitioning to its Science phase, during which and survey most of the planet’s surface from an altitude of 890 km (553 miles) for 21 days. This orbit was purposely out of sync with the Sun to lower the chances of misidentifying signal frequencies.\n\nThe researchers went through the data from every pass the satellite made over the region for the weeks in September and October and used this data to create maps of the fjord, modeling it how would have behaved during different times after the landslide and the height differences between waves (which reached up to two meters, or about 6.5 feet). Reconstructions of weather conditions ruled out all other possible causes behind the signal, and convinced scientists that it could only have been caused by a seiche.\n\n“This study shows how we can leverage the next generation of satellite earth observation technologies to study these processes,” Monahan said in a recent press release. “SWOT is a game changer for studying oceanic processes in regions such as fjords which previous satellites struggled to see into.”"
    },
    {
        "title": "Apple makes major AI advance with image generation technology rivaling DALL-E and Midjourney",
        "description": "Apple researchers develop STARFlow, a breakthrough AI image generation system that challenges diffusion models used by DALL-E and Midjourney with competitive performance.",
        "url": "https://venturebeat.com/ai/apple-makes-major-ai-advance-with-image-generation-technology-rivaling-dall-e-and-midjourney/",
        "source": "VentureBeat",
        "publishedAt": "2025-06-09T18:50:06Z",
        "full_text": ""
    },
    {
        "title": "Bernie Sanders Says If AI Makes Us So Productive, We Should Get a 4-Day Work Week",
        "description": "Senator Bernie Sanders called for a four-day work week during a recent interview with podcaster Joe Rogan, arguing that AI productivity gains should benefit workers rather than just technology companies and corporate executives. Sanders proposed reducing the …",
        "url": "https://slashdot.org/story/25/06/25/194207/bernie-sanders-says-if-ai-makes-us-so-productive-we-should-get-a-4-day-work-week",
        "source": "Slashdot.org",
        "publishedAt": "2025-06-25T19:30:00Z",
        "full_text": "Senator Bernie Sanders called for a four-day work week during a recent interview with podcaster Joe Rogan, arguing that AI productivity gains should benefit workers rather than just technology companies and corporate executives. Sanders proposed reducing the standard work week to 32 hours when AI tools increase worker productivity, rather than eliminating jobs entirely.\"Technology is gonna work to improve us, not just the people who own the technology and the CEOs of large corporations,\" Sanders said. \"You are a worker, your productivity is increasing because we give you AI, right? Instead of throwing you out on the street, I'm gonna reduce your work week to 32 hours.\""
    },
    {
        "title": "Big Accounting Firms Fail To Track AI Impact on Audit Quality, Says Regulator",
        "description": "The six largest UK accounting firms do not formally monitor how automated tools and AI impact the quality of their audits, the regulator has found, even as the technology becomes embedded across the sector. From a report: The Financial Reporting Council on Th…",
        "url": "https://tech.slashdot.org/story/25/06/27/0426230/big-accounting-firms-fail-to-track-ai-impact-on-audit-quality-says-regulator",
        "source": "Slashdot.org",
        "publishedAt": "2025-06-27T04:30:00Z",
        "full_text": "The six largest UK accounting firms do not formally monitor how automated tools and AI impact the quality of their audits, the regulator has found, even as the technology becomes embedded across the sector. From a report:"
    },
    {
        "title": "U.S.-China trade talks continue for a 2nd day in London",
        "description": "Chinese exports of rare earth minerals, which are vital to carmakers and other industries, and China's access to high-end technology from the U.S., including computer chips, are high on the agenda.",
        "url": "https://www.npr.org/2025/06/10/g-s1-71676/us-china-trade-talks-london",
        "source": "NPR",
        "publishedAt": "2025-06-10T14:25:40Z",
        "full_text": "U.S.-China trade talks continue for a 2nd day in London\n\ntoggle caption Li Ying/Xinhua News Agency via Getty Images\n\nLONDON — Lancaster House, an ornate government mansion in the U.K. capital, is the location for the second round of tariff negotiations between the U.S. and China. Investors and world leaders are watching these talks closely to see if they can help thwart the prospect of a deepening trade war between the world's two biggest economies.\n\nTalks continued into a second day Tuesday, with three of Trump's top aides attending. Commerce Secretary Howard Lutnick, Trade Secretary Scott Bessent and Trade Representative Jamieson Greer are in London, with Chinese vice premier and lead economic representative He Lifeng representing Beijing.\n\nSponsor Message\n\nPresident Trump told reporters at the White House on Monday that he was getting \"good reports\" from the talks. \"We're doing well with China. China's not easy,\" Trump said.\n\nThe two sides last met in Geneva in May, where they agreed to a 90-day pause on the more than 100% base tariffs that each side had levied on the other as the trade war escalated. Some U.S. tariffs imposed during a previous trade war during Trump's first term have remained in place on Chinese goods as well.\n\nOverall, U.S. tariffs on goods from China still remain higher than those imposed on other countries. The U.S. cut its base tariffs on goods from China to 30%, while China cut tariffs to 10%.\n\nChinese exports of rare earth minerals , which are vital to carmakers and other industries, and China's access to high-end technology from the U.S., including computer chips, are high on the agenda this time around.\n\nThe American negotiation team has also continued to push China to purchase more American goods and reduce a U.S. trade deficit with China, a key demand in a so-called Phase One trade deal struck during Trump's first term and which China never fully implemented.\n\nRelations between the two countries have deteriorated since their tentative truce in Geneva, with each accusing the other of violating the agreement struck there.\n\nChina retaliated against U.S. tariffs by halting more of its exports of rare earths, the refining of which it has a near monopoly on. Beijing has been quietly restricting the export of rare earths to the U.S. and European Union since 2024 but in recent weeks has cut off even more minerals. Chinese customs data show rare earths exports by value have dropped by more than 20% this year compared to the same period last year.\n\nPresident Trump said last week that China's Xi Jinping had agreed to restart the flow of these rare earths, and analysts say there may be some progress on this sticking point during the talks this week.\n\nSponsor Message\n\nBut while China has said it would be willing to set up an expedited \"green channel\" for companies needing rare earths, it has also signaled it will not completely ease its powerful grip on the world's supply of refined rare earth products, saying its export controls are \"driven by its domestic industrial sustainable development needs,\" according to a commentary published this week by the country's state news agency.\n\nThere have also been tensions after the U.S. announced stringent new export controls on high-end semiconductor chip technology, including chip design software, on China — and said it also plans to revoke some visas held by Chinese students.\n\nYu Jie, senior research fellow on China at London's Chatham House international affairs think-tank, warns that we \"should not hold our breath for any major progress\" following the talks, with both sides unlikely to offer any further tariff reductions. \"We're now into deep water of trade negotiations between Beijing and Washington. China is aware of the importance of holding this card of the rare earth export controls. On the other hand, the U.S. really wants to slow down China's technology progress.\"\n\nYu says the two sides will have to talk through some of these thornier sticking points over the next few days. Lutnick said Tuesday he expects the talks to go on \"all day.\" He told reporters the talks were \"going well\" and \"we're spending lots of time together.\" The Chinese delegation is in London all week and talks could go on beyond Tuesday.\n\nIn a separate meeting in London, China's commerce minister Wang Wentao spoke with Britain's business secretary, Jonathan Reynolds. A statement from China's commerce ministry said Wang called for both countries to uphold the multilateral trading system, and he wanted to see greater cooperation between China and Britain on finance and sustainability.\n\nSponsor Message\n\nThe U.K. government says it's providing the venue and logistics for the U.S.-China talks but is not involved in them. \"We are a nation that champions free trade and have always been clear that a trade war is in nobody's interests, so we welcome these talks,\" it said in a statement."
    },
    {
        "title": "Experimental Propulsion Tech Could Reach Mysterious Planet Beyond Pluto in 10 Years",
        "description": "Sedna will make its closest approach to the Sun in 2076, giving us a rare opportunity to visit the planetoid before it drifts off for thousands of years.",
        "url": "https://gizmodo.com/experimental-propulsion-tech-could-reach-mysterious-planet-beyond-pluto-in-10-years-2000622774",
        "source": "Gizmodo.com",
        "publishedAt": "2025-07-01T20:21:13Z",
        "full_text": ""
    },
    {
        "title": "This 150W USB-C/A Wall Charger Is 41% Off, No Need to Wait for Prime Day",
        "description": "This charger block lets you charge three devices at the same time and is now at a record low price.",
        "url": "https://gizmodo.com/this-150w-usb-c-a-wall-charger-is-41-off-no-need-to-wait-for-prime-day-2000615403",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-13T11:40:14Z",
        "full_text": ""
    },
    {
        "title": "Is Amazon Clearing Out Dyson? This Hair Dryer Has Just Dropped to a New All-Time Low",
        "description": "This hair dryer is one of Dyson’s most famous products, and it’s rarely on sale like this.",
        "url": "https://gizmodo.com/is-amazon-clearing-out-dyson-this-hair-dryer-has-just-dropped-to-a-new-all-time-low-2000612936",
        "source": "Gizmodo.com",
        "publishedAt": "2025-06-08T11:10:22Z",
        "full_text": ""
    }
]